{"count": 100, "reviews": [{"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 6145, "author": {"uid": "sodacat", "avatar": "https://img3.doubanio.com/icon/u2407595-4.jpg", "signature": "Cookie到我碗里来", "alt": "https://www.douban.com/people/sodacat/", "id": "2407595", "name": "猫饼干"}, "created_at": "2015-01-09 11:50:41", "title": "技术基佬什么的太有爱了！（附真人八卦）", "updated_at": "2019-02-14 00:11:50", "share_url": "https://m.douban.com/movie/review/7331596", "summary": "多年前我大一的时候，有一门全系公选课叫“信息技术导论”，每一节课讲一个计算机领域的专题，其中一个讲人工智能的专题里，提到了图灵测试。随后我们又知道了计算机领域没有诺贝尔奖，最牛逼的奖项是“图灵奖”...", "content": "多年前我大一的时候，有一门全系公选课叫“信息技术导论”，每一节课讲一个计算机领域的专题，其中一个讲人工智能的专题里，提到了图灵测试。随后我们又知道了计算机领域没有诺贝尔奖，最牛逼的奖项是“图灵奖”。我对这个充满了整个领域的名字产生了好奇，从图书馆里借来一本介绍图灵生平的书，看完之后被这人充满传奇的人生震撼到了……简直就是年度，不对，是二十世纪难得一见的狗血大戏好吗！\n这一出狗血大戏终于被搬上了大银幕，而且是由演出过霍金福尔摩斯阿桑奇，开创了“脸的长度决定智商高度”的卷福扮演图灵。作为角色粉+演员粉，我期待了大半年终于等到电影上映，打着鸡血刷完后发现——\n呃，除了我全程在花痴卷福之外，这部电影的剧情，还是不错的。只是好像，图灵这个角色有点OOC，和我之前读到的传记（没错，这电影是根据同一本传记改编过来的啊）画风不一样啊！\n艾伦•图灵是一个什么样的人呢？他出身公学，毕业于剑桥国王学院，接受的是腐国传统的精英知识分子教育，从一个方面来说，他一直身在一个被保护得很好的、只要有科研问题就可以开开心心地活下去的环境里。图灵年轻时害羞而敏感，不善于用语言表达自己的感情，长开了之后也并不了解人情世故，不懂得使用政治手段达到目的。卷福的图灵，给人们呈现的也是这样一种形象。他埋头工作，不能理解同事们叫他吃饭的意图；他坚持自己的破译方式，手忙脚乱地跟前来视察的军队领导解释（这一段超级可爱）。他甚至连跟妹子求婚都不懂得好好说话……\n但是另一方面，现实中的艾伦•图灵，还有这呆萌和毒舌这两项技能……他大概就属于永远不懂得读空气，总是有话直说的那种人。这反而让他赢得了同辈和晚辈的喜爱，他在布莱切利庄园的时候总有一群脑残粉围着。\n和电影里对于同性恋身份的怀疑和纠结相反，图灵其实……从来都没掩饰过自己的取向，聊天的时候简直是找到机会就跟同事出柜。当然技术宅们不认同他的取向，却最终还是接受了他。\n图灵平时喜欢穿睡衣外面套上运动夹克，而不是电影里那么凸显身材的西装（还好电影选了西装，可以舔舔舔）。正式场合下，他会穿……正装夹克。\n图灵喜欢骑自行车和长跑，还差点代表英国参加奥运会呢。所以卷福才会在电影里跑跑跑个不停。而他喜欢长跑的原因呢，是为了纾解没有人和他约的压力（正经脸）。\n图灵还有花粉过敏这种有点萌的属性，以至于周围人对他戴着防毒面具上班都见怪不怪。话说我真的好期待卷福眼泪汪汪花粉过敏的样子，或者是防毒面具脸啊！可惜电影里没用这个梗，只在图灵最后跟警探问答时有一句“我花粉过敏”的台词。\n图灵还能一口气喝下一品脱的啤酒。看到这里是不是想起了叉男初恋里的X教授！没错最初我对图灵的脑补就是他那样的啊！\n图灵还是个写小黄文的大手，这是真的。在他因为同志身份暴露，被警察调查时，警察要求他写陈述报告，他……洋洋洒洒写了五页纸，文辞优美语句流畅，详细生动地描述了他和他当时的情人的关系，警察们都震惊了，没想到这人这么直截了当。\n电影里对图灵的同性感情线处理得很含蓄，只提到了他那早早夭折的初恋。没错，克里斯多夫同学是图灵心中永远的白月光，但在这个竹马战不过天降的年代，早早退场的竹马更加……只能出现在记忆里了。其实！图灵在大学里就有了新的恋情啊！还不止一次！剑桥这种地方你懂的，男人们对身体交流蛮放得开。只是图灵似乎是那种把身体和精神交流分得很开的人……这好像也是当时社会里主流的家庭观，性和爱是两回事什么的。图灵有个几乎是克里斯多夫的替身的好基友，两人的友谊从大学一直维持到一起去普林斯顿读博士，但是某次阴差阳错睡在同一张床上时，图灵试图推倒基友未遂，于是这段关系就变成纯友谊了。图灵成名后，还资助过一个正太上学，养成了人家好几年之后正太说叔叔我们不约，图灵又只好退回到一个资助人的位置上了。他还和一位19岁的少年维持过短暂的关系，可惜这段关系最终暴露，也使得图灵的取向被警察发现，而导致了他必须接受激素治疗（可恶的化学阉割）。他的情路……还真每一段都可以脑补出两万字的狗血文啊……\n至于在电影里存在感超级高，让人看演员表就怀疑“基佬传记怎么还能有女主角”的，凯拉•奈特莉饰演的琼•克拉克小姐，她确实是图灵唯一一个求过婚的女人。但是！真实的故事比电影里更萌啊！他们并不是在布莱切利庄园才认识的，而是大学就见过面，勉强算是青梅竹马的关系生生被掰成了天降，让我这种幼驯染爱好者好心塞。克拉克也并不像电影里演的那样，害怕伤风败俗而只能在家偷偷工作（虽然她父母确实都是研究神学的），而是真的作为唯一的一名女性，和图灵的小组一起在8号营房一起破译Enigma。电影的改编，让我觉得导演是真的不了解基佬……有哪个基佬会对一个第一次见面的女人这么感兴趣，还做半夜爬窗去妹子家这种这么少女漫画的事（虽然电影解释是为了工作），还为了担心妹子的安全而隐瞒俄罗斯特工的事情。卷福演得无比直，他演福尔摩斯都基得无法直视，但是演图灵有一种微妙的直男气场……这到底是怎么回事啦。\n这还不是电影里最奇葩的改编——电影里，图灵隐瞒了同性恋的取向，向克拉克求婚，直到分手时才说明。这不是妥妥的渣男是什么！而事实是，图灵对克拉克求婚，很大程度上也是基于当时社会对婚姻的认识：婚姻伴侣不是首先作为性伴侣存在，而更多的是一个“维持家庭的另一半”。所以他求婚的第二天就跟克拉克出柜了，真是有勇气的男人……现在有哪个骗婚基佬敢向老婆出柜啊。而克拉克却没有退却，因为他们双方都觉得，除了身体上不合拍之外，他们的精神世界还是蛮和谐的。这段关系维持了六个月才结束，也是和平分手，他们还是好朋友啦。\n要说电影里有没有可以挖掘的基情，应该还是有，马修•古德饰演的国际象棋冠军休•亚历山大，一开始就特别傲娇地跟图灵针锋相对，随后才（转折生硬地）把图灵当成了好朋友，真是好标准的少年漫画里男二号对男主角的态度啊。这两人在现实中也特别萌，图灵刚到布莱切利庄园时，迎接他的就是亚历山大，图灵对他的第一印象特别好。他自己是个社交障碍死宅，而亚历山大和克里斯多夫一样，也是聪明又懂得和人打交道的那一种，于是图灵又很自然地在社交方面对人家各种依赖了。这就是所谓的，“之后爱的每个人都带着初恋的影子”嘛（不对！！）。虽然图灵是破译Enigma的主力，但是这个小团队的领导是亚历山大，因为他更懂得如何和军人们打交道。\n电影里有一点遗憾，就是仅用一行字就带过图灵充满悲剧（以及一些浪漫色彩）的死亡。这是个大家都知道的故事，图灵吃了沾有氰化物的苹果，死在家中，只留下咬了一半的苹果。值得一提的是，在图灵年轻时看到《白雪公主与七个小矮人》的演出时，曾公开表示喜欢巫婆与毒苹果的句子。一生追求完美的图灵，也许是想在自己被激素治疗侵蚀之前，用自己喜欢的方式结束这一生吧。虽然有点不厚道，我真的挺想看这样一个场景被搬上银幕，超级天才美丽的，平静如同沉睡一般的结局。可惜导演……你为啥不拍这一段。\n另一点遗憾，就是在图灵牛逼闪闪的科学贡献，电影只取了最热血的“破解谜机”这一点。其实图灵还有很多其他成就啊！限于篇幅，电影里把好些东西都扔到台词或者细节里了。图灵最出名的，是提出了现代计算机的理论模型，用有限状态机来描述一个可以自我学习的机器。这个机器最早出现在他24岁那年一篇论文的脚注中。他还提出了著名的“图灵测试”，作为一台机器是否具有智能的标准。在电影里，这些都体现在他与调查他的警探的对话中了，他们现场表演了一次图灵测试。图灵去世前几年一直在研究小菊花，呃，是真的菊花，为了研究植物形态里的斐波那契数列。在影片开头，图灵凌乱不堪的公寓里那些复杂的图案，看样子就像是这方面的图。他还和计算机之父（或者之母？取决于攻受）冯•诺伊曼勾搭过，对诺伊曼日后的研究产生了影响。图灵和做信息论的香农也有一腿，之后图灵在贝尔实验室做语音加密，那个系统不能说有多成功，但确实是当时的第一个尝试。图灵还在连鸡都没有的时候就先下了蛋（不对），在连计算机都没有的时候，就写了国际象棋的计算机程序……他的任何一项成绩，都足够我等战五渣仰望一辈子。\n说了这么多，如果要客观评价这一部电影，我只能说，它只刻画了图灵波澜起伏的人生中，短短的一小段；也只展现了图灵人格中的一个方面。它能让更多连“图灵”这个名字都没听过的人了解这位伟大的科学家，知道正是他的工作让二战提前结束了好几年。另一方面，图灵的其他科学成就，他性格里果敢、直率的一面，他那狗血淋漓的感情生活，只能在原著传记里找。所以大家快去读传记啊！真是又燃又腐！\n\n-------------------- 我是来安利图灵传的分割线 -------------------\n看到很多小伙伴因为电影的缘故，想要去读原作传记，真是太好了 XD 与其逐一回复豆油，不如在这边就把书名和链接放出来给大家吧：\n中文版戳这里：http://book.douban.com/subject/11541213/\n《艾伦·图灵传》，作者：安德鲁霍奇斯，译者：孙天齐，出版社：湖南科学技术出版社 \n\n英文版戳这里：http://www.amazon.com/Alan-Turing-Enigma-Inspired-Imitation/dp/069116472X/ref=tmm_pap_title_0\n《Alan Turing: The Enigma》 by Andrew Hodges. \n\n\n\n", "useless_count": 159, "comments_count": 516, "alt": "https://movie.douban.com/review/7331596/", "id": "7331596", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2557, "author": {"uid": "violette", "avatar": "https://img3.doubanio.com/icon/u1877121-32.jpg", "signature": "仍静候着你说我别错用神", "alt": "https://www.douban.com/people/violette/", "id": "1877121", "name": "初尘"}, "created_at": "2014-11-27 06:23:00", "title": "他和他的Christopher", "updated_at": "2019-02-11 20:36:22", "share_url": "https://m.douban.com/movie/review/7211535", "summary": "先分享一些电影背后的小八卦（随手直译自IMDB，包含剧透）   1.丘吉尔认为阿兰图灵对于赢得战争做出的贡献比任何人都多。  2.Cumberbatch坦白自己在拍摄电影最后的几场戏时哭得停不下来，并经历了一场崩溃。他说...", "content": "先分享一些电影背后的小八卦（随手直译自IMDB，包含剧透）\r\n\r\n\r\n1.丘吉尔认为阿兰图灵对于赢得战争做出的贡献比任何人都多。\r\n\r\n2.Cumberbatch坦白自己在拍摄电影最后的几场戏时哭得停不下来，并经历了一场崩溃。他说那是“作为一个演员或一个人无可救药爱上了这个角色，想着他都承受了怎样的痛苦，而那又怎么损毁了他。”（quote）\r\n\r\n3. 这部电影的剧本荣登2011年度Black List的“尚未采用的好莱坞剧本最佳”。( best un-produced Hollywood scripts of 2011。这个Black List我一开始不知道是啥，后来看最近一次BC采访才知道那是一个分享剧本的业内平台。很多后来成功的电影剧本都来源于此。）\r\n\r\n4. The Weinstein Company为了这部电影花了破纪录的7百万美元，史上最高价格的欧洲电影市场的分销权。\r\n\r\n5. Benedict Cumberbatch 与 Alan Turing在现实生活中有真实的牵系。 据家族史站点Ancestry研究表明，他们俩是十七代表亲，是可追溯到14世纪。从两人各自的父系研究来看，他们均被认为与John Beaufort （第一位Somerset伯爵）沾亲。\r\n\r\n6.图灵最早计划由Leonardo DiCaprio扮演。\r\n\r\n7.电影里，在图灵的订婚宴上跳舞的其中一人是图灵本人的远亲。\r\n\r\n8.电影的主要场景拍摄完成于2013年的11月11日，恰逢英国的烈士阵亡纪念日。（我一直以为那天应该是11月5日篝火节啊…完全混了）\r\n\r\n9. 电影于今年11月14日在英国上映，在1940年的同一天，考文垂被德国纳粹空军以闪电战袭击。有一个久远的传言，认为这次偷袭计划其实早已被布莱切利公园的密码破译者发现，但无人采取行动。因为英国政府担心会被人察觉他们已经破解了Enigma。这件事在SHERLOCK S201里夏洛克提到过。（就是所谓的“考文垂事件”，当然夏洛克这个死孩子把麦哥的大计给搅黄了）\r\n\r\n10. 电影里我们看到的图灵机器 'Christopher'是基于原始机的复制品建造的。复制品现在被摆放在布莱切利公园博物馆里。 Maria Djurkovic （估计是道具师？）承认，为了电影效果，他被造的更大了些，也特意暴露出了更多的内部机械装置。 \r\n\r\n11. 其中一个闪击伦敦的场景不得不在周日进行，因为英国法律规定电影拍摄只能有限地封闭路段。（每周日伦敦市内都有各种路段由于各种理由被封闭…）美工部那天乱成了一团，因为大家在最后一刻猛然意识到他们谁也没预定碎石。\r\n\r\n12. Desplat在三周内完成了曲谱。他与伦敦交响乐团在Abbey Road工作室里完成了电影配乐的录制与编排工作。\r\n\r\n13. Google赞助了电影在纽约的首映，在2014年11月23日组织了一场名为“破译挑战”的比赛。这是一场靠技能取胜的赛事，挑战者必须破解谷歌提供的密码，奖项颁发给成功破解并提交最快的人。\r\n\r\n14. （我最喜欢这条）2014年11月27日，电影北美院线上映之前，纽约时报重印了英国“每日电讯报”于1942年刊登的原版填字游戏，当时它用于招募二战期间去布莱切利公园工作的密码破译员。完整填出的参赛者可以把它们的答卷发邮件抽奖，奖品是伦敦的双人旅行，还包含布莱切利公园实地之旅。\r\n\r\n15. Benedict Cumberbatch的演员父亲，Timothy Carlton，在1953到1958年期间是一名阿兰图灵当年学校里的学生。\r\n\r\n16. 为了演图灵，Cumberbatch自己要求戴了假牙。并没有其他人要求他这样做。\r\n\r\n17. Keira Knightley (Joan Clarke)和Benedit Cumberbatch (Alan Turing)在现实生活中是好友。马修古迪 (Hugh Alexander) 已经和Cumberbatch当了15年的朋友了。\r\n\r\n18. Mark Strong在2009年小罗伯特唐尼版的“大侦探福尔摩斯”电影里演大反派Lord Blackwood，Benedict Cumberbatch在2010年的艾美奖剧集神探夏洛克里扮演SHERLOCK。\r\n\r\n19. 2014年11月8日，The Weinstein Company 与数码天空（Digital Sky）科技的亿万富翁Yuri Milner，脸书CEO马克·扎克伯格联合承办了一次这部电影的私人放映会。放映在加州的Los Altos Hills进行。参加者包括硅谷的数位高层，如脸书COO Sheryl Sandberg, Linkedin的Reid Hoffman，Google联合创始人Sergey Brin，Airbnb的Nathan Blecharczyk和Theranos创始人Elizabeth Holmes等。 \r\n\r\n20. 这是挪威导演Morten Tyldum英语电影的处女秀。\r\n\r\n21. Catherine, 剑桥公爵夫人（凯特王妃）的外祖母曾经在布莱切利公园工作过，正如阿兰图灵和他的团队一样。\r\n\r\n22. 在评价这部电影时，纽约时报曾这么写过：\r\n电影“The Imitation Game\" 评级PG-13 (强烈建议家长指导)。内容含不当的性（。。。）, 灾难性暴力，以及高等数学。（最后这条笑死）大多数为提及而非展示。\"\r\n\r\n\r\n\r\n\r\n----------------------------------------\r\n\r\nTotterham Court Rd Odeon。在伦敦初冬里的一个午后看了这部片子，又惊喜又难受。其实传记体裁不太吸引我的注意，加上又是政治正确片。我甚至都想不起来到底是怎么就决定去看它的，大概是奔乱生活里匆忙抓住的一次逃避。可如今，每每回想这电影都让我泪流不止。\r\n\r\n这份难以平静的心悸与interstellar带给我的泪不同，后者更“即刻”，更顺其自然；前者则有隐约阵痛徘徊不去。我眼前浮现的画面——似乎有些草率，不负责任似的——不是他多么天才，如何立功；或是战争的经过，防空洞或深深海底每一分钟发生的残忍；也不是解码的神奇，艰辛过程，令人沮丧的一再失败…是他干涸的嘴唇，惊慌的眼神，苍白的手指——执卷破译的，拿起圣经的，接上机器插头的，面对最后的填字游戏的…写下“我爱你”的。\r\n\r\n在帅气同伴，霸道上司和满世界的怀疑面前，他总是让人担心地笨手笨脚，几乎是愚钝的倨傲，面对恶意、诡计与暴力几乎是软弱的毫无办法；同时他又善良又勇敢，他去保护，保护Joan，保护他的Christopher。他以他的柔软表达着坚强和执拗。世界如此艰难，他只专注于眼前笔下的小小密码。正如当年他坐在剑桥的树荫下对他的Christopher说，我只想弄明白别人是什么意思。\r\n\r\n我一直没仔细想过BC的表演，对我来说夏洛克的魅力是剧组的杰作，不是他一人的神演技；阿桑奇诡异，可汗纯属玩票。这一次则不同。它并非如我想象般，是“目标奥斯卡”式的煽情、刻意、或用力过度，也不是“怪人专业户”式的力图标新立异，而是压抑的，同时又自然，让人只能担心的望着他，等着他，不知怎么办好。我几乎完全忘了这个演员是谁，忘了我有多爱他演的那个侦探，忘了他现在已经是个极速逼近可怖的主流娱乐圈的巨星，我也完全忘了我想像中阿兰图灵的官方样。\r\n\r\n红色的电线连接着巨大的黑色金属，嗡鸣，或沉寂。多年后的Joan说，你不需要独自一人面对。Alan说，我不是独自一人，我从来不是。再也做不出填字游戏的他一边被Joan拉扯着一边呜咽着说，他们会把Christopher从我身边夺走，他们不能。他们不能。他一塌糊涂泣不成声。我也泣不成声。\r\n\r\n那场哭戏真的钻进了我的心。我觉得他一直牢牢抓着手中已经烟消云散的。他的少年留下那句dearest friend消失了，他的成果被一场火烧了，他的自我被世人多年来纠缠蹂躏。让我最疼最疼的就是那份绝望。\r\n\r\n忘不了他关上灯，一歪一歪地走近黑暗中的Christopher，他的记忆，他的珍宝，他的自我。即使是对人物历史一无所知的我也一下明白这是他就要对这世界做出告别。火光跳跃，一切成灰。电影在他脸上淡淡的笑容中落下帷幕。“传记片必备总结字幕”固然煞风景，但也无法阻止我爱上这结尾。因为它克制，温柔，不做作。因为这结局本身就是无法言说的。\r\n\r\n另一个亮点是电影的音乐。（豆瓣已有：http://music.douban.com/subject/26209376/）我不了解这位DESPLAT，他同时编写音乐的哥斯拉对我来说简直是场噩梦；可他给这片的配乐稳当，动情，波澜四起又行云隽永，好听极了。（虽说我也很喜欢寂寞哥的新作…）（很久以后我才发现这位Desplat还撰写了我最爱的会客厅杀戮和裘皮维纳斯。。我太土了。无地自容。）\r\n\r\n\r\n最后想说，整部片子我最喜欢的一幕其实是不太引人注意的短短几秒。Joan进了仓库，灿烂的阳光从她背后溢出，斑驳摇晃。她稍微愣了愣，让门就这样开着，走向了他和他的Christopher。不知怎么，我觉得这一幕温暖又让人安心。我希望它就此定格，在一整个令人扼腕的真实里，在如今世人对他的庞大追忆里，在英国后来对他荒谬的“Pardon”里，作为一块真空，一滴小小的，不受打扰的凝结，与世隔绝地幸福下去。\r\n\r\n", "useless_count": 67, "comments_count": 137, "alt": "https://movie.douban.com/review/7211535/", "id": "7211535", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 1832, "author": {"uid": "neilchi", "avatar": "https://img3.doubanio.com/icon/u1094556-5.jpg", "signature": "", "alt": "https://www.douban.com/people/neilchi/", "id": "1094556", "name": "坏人C"}, "created_at": "2015-01-10 16:13:00", "title": "把图灵拍成Sheldon Cooper真的好么。。", "updated_at": "2019-02-18 03:34:22", "share_url": "https://m.douban.com/movie/review/7334355", "summary": "1，我觉得这件事简直侮辱人。编剧的意思是，一个人IQ高了EQ必然低成屎吗？你就不能接受这个世界上就是有人IQEQ都很高吗？而且无论是大爆炸的编剧还是这部电影的编剧，他们对低EQ这件事的理解其实特别的低IQ。他们...", "content": "1，我觉得这件事简直侮辱人。编剧的意思是，一个人IQ高了EQ必然低成屎吗？你就不能接受这个世界上就是有人IQEQ都很高吗？而且无论是大爆炸的编剧还是这部电影的编剧，他们对低EQ这件事的理解其实特别的低IQ。他们所描述的那些他们认为的低EQ行为，明明就是典型的低IQ。\n\n2，真实生活里的图灵其实是个挺受欢迎的家伙。内向固然内向。那个时候在Bletchley Park，午餐时间很多工作人员会聚在一起运动（印象中是踢球？），图灵会在旁边看着，跟同事聊天。他完全不是个古怪的家伙。历史上几乎没有这样的记载。神马绿豆胡萝卜要分开，分开就分开，你以为他真是个弱智么？\n\n3，Bletchley参与密码破译工作的人远不止五六个，而是一大群人。图灵也没有直通丘吉尔的渠道或者获得过丘吉尔的背书。Bletchley Park的主管也不是个蛮横的军棍。\n\n4，另外他们也不曾选择隐瞒一些破译出的德军情报。这他妈是犯罪好么？是草菅人命好么。。英国政府不仅没有隐瞒Enigma的破译，而且跟美军share了大量情报的。德军之所以到战败都不知道Enigma被破译这件事，只是单纯的因为他们根本就不相信Enigma是可能被破译的。\n\n5，图灵机不是计算机。它是一个用来研究可计算性的模型。不是任何真实的机器。。即使今天我们依然管图灵机叫图灵机，不叫计算机。\n\n6，Enigma的破译的早期工作其实是波兰的数学家们。这件事可以追溯到二战开战前的。这几个人把他们的成果带去了英国。然后在Bletchley Park有人设计了第一代Bombe机，图灵优化了它。\n\n7，真正的第一台电子计算机是同期在Bletchley Park之外由Flower设计的Colossus。当然图灵在Bletchley的破译工作一定程度上促成了Colossus。Colossus后来也真的被Bletchley Park拿去用来破译Enigma了。但是电影里那个图灵摆弄的家伙真的是一台Bombe机。\n\n8，当时没有任何一台机器叫Christopher。。这剧编的也太琼瑶了。\n\n9，图灵订婚的那位姑娘从来都知道他是gay，图灵也是真的爱她。那段扇耳光的戏也是瞎掰。\n\n10，至于神马苏联间谍啊，反间谍啊，故意泄露情报给苏联，全是瞎扯。\n\n11，图灵喜欢跑步是真的。战后差点去奥运会参加马拉松比赛。放到今天就是一个从大脑到身体都无比健全的人。结果拍的跟一弱智宅男似的。\n\n12，象棋大师同学和图灵其实没有争夺过主管权，而且一直关系不错。\n\n13，我对英国英语实在适应不良，所以电影前几分钟的台词几乎没有听懂，包括那段不怎么和谐的面试。不知道军棍跟图灵在吵神马，除了说到了德语。但是，图灵是普林斯顿的博士，导师是或许历史地位应该跟他一样牛逼的Alonzo Church，这种简历有啥可面的？\n\n14，说到德语，图灵真的会德语。。。Heil Hitler反复出现这件事确实对Bletchley Park破解Enigma起了帮助。这点电影还是没有搞错。\n\n不想接续列了。。总的来说，太不尊重图灵也太不尊重历史了。", "useless_count": 709, "comments_count": 444, "alt": "https://movie.douban.com/review/7334355/", "id": "7334355", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 431, "author": {"uid": "helicopter", "avatar": "https://img3.doubanio.com/icon/u1155157-30.jpg", "signature": "", "alt": "https://www.douban.com/people/helicopter/", "id": "1155157", "name": "Helicopter"}, "created_at": "2015-01-05 03:57:16", "title": "Christopher只是编剧的煽情机器吧", "updated_at": "2019-02-12 18:49:48", "share_url": "https://m.douban.com/movie/review/7320675", "summary": "看完电影时还是很澎湃的，然而查了一下史实，戏说的成分还蛮不少。  - Turing破解Enigma的机器在1939年完成最初的设计，名为Bombe，不是Christopher；1940年第一台Bombe便已投入使用。  - 除了Enigma，德军还有别...", "content": "看完电影时还是很澎湃的，然而查了一下史实，戏说的成分还蛮不少。\n\n- Turing破解Enigma的机器在1939年完成最初的设计，名为Bombe，不是Christopher；1940年第一台Bombe便已投入使用。\n\n- 除了Enigma，德军还有别的密码系统。后续担负起破解任务的机器叫做Colossus（因为体积很大），而建造Colossus项目跟Turing的直接关系并不大。在Computer History Museum看到的一段科普片里也提到将战争缩短了两年的说法，但是指Colossus\n\n- Denniston本人其实也是密码学家。\n\n关于Turing本身，电影似乎有塑造Turing带有自闭症(autism) 的倾向，表现他有社交沟通障碍（要不要去吃午饭、不懂什么是flirting等）、强迫症（分开胡萝卜和豆子）。但在本片所基于的传记著作里，Turing是一个甚有幽默感，跟同事相处也很和谐的人。\n\n而同性恋部分，传记所描述的Turing，并没有向朋友和同事掩饰自己的性倾向，还会主动去结识男人。\n\n电影原本拍了一个Turing死在床上、床旁边桌子上有个半咬的苹果的画面作为结局，但是编剧和导演觉得goofy，最后剪辑掉、换成了屏幕文字来交代。\n\n_______\n\n可以理解传记片为了戏剧效果而篡改事实，唯一觉得比较刻意的是为了塑造对立感、营造「Turing是个伟大天才却备受社会卑劣对待」的悲惨命运式煽情效果，模糊掉了推动密码破解过程中其他unsung heroes...\n\n电脑的发明，至今没有给任何一个人颁发专利。科学技术发展的成就取得，都是很多人互相助力、互相启发的结果。\n\n\nSource:\nhttp://www.slate.com/blogs/browbeat/2014/12/03/the_imitation_game_fact_vs_fiction_how_true_the_new_movie_is_to_alan_turing.html\nhttp://en.wikipedia.org/wiki/Cryptanalysis_of_the_Enigma#British_bombe\nhttp://en.wikipedia.org/wiki/Cryptanalysis_of_the_Lorenz_cipher\nhttp://www.theatlantic.com/entertainment/archive/2014/12/the-imitation-game-wants-the-happy-ending-alan-turning-never-had/384084/\nhttp://www.nybooks.com/blogs/nyrblog/2014/dec/19/poor-imitation-alan-turing/\n\n", "useless_count": 33, "comments_count": 64, "alt": "https://movie.douban.com/review/7320675/", "id": "7320675", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 418, "author": {"uid": "66740329", "avatar": "https://img3.doubanio.com/icon/u66740329-16.jpg", "signature": "", "alt": "https://www.douban.com/people/66740329/", "id": "66740329", "name": "Ser Pounce"}, "created_at": "2015-01-01 17:32:37", "title": "电影中的几个事实错误，机器叫Bombe不是Christopher", "updated_at": "2018-12-15 23:44:52", "share_url": "https://m.douban.com/movie/review/7311413", "summary": "1.老祖图灵没有造机器，图灵在1939年提出的是计算理论，和理论设计思路，真正的机器是由Harold Keen和很多工程师完成的。机器的名字也不叫Christopher，而是不那么浪漫的名字Bombe 来源维基百科：http://en.wikip...", "content": "1.老祖图灵没有造机器，图灵在1939年提出的是计算理论，和理论设计思路，真正的机器是由Harold Keen和很多工程师完成的。机器的名字也不叫Christopher，而是不那么浪漫的名字Bombe\n来源维基百科：http://en.wikipedia.org/wiki/Bombe\n\n2.在整个破译Enigma Code的初期工作中居功至伟的是波兰密码学家Marian Rejewski, Jerzy Różycki 和 Henryk Zygalski，电影里只是提了一下波兰帮助走私了Enigma Machine\n来源维基百科：http://en.wikipedia.org/wiki/Cryptanalysis_of_the_Enigma\n\n3. Bletchley Park Hut 6 最早在英伦空战期间破译了德国空军的Enigma，因为德国空军对密码疏于管理，让Bletchley Park找到了很多人为漏洞来破译密码，其中就包括那个“女朋友”事件。\n\n4. 电影里所说德国电报员发送CILLY是根据真实事件改编的，这个事件发生在破译德国空军密码工作中，德国空军要求自己的电报员随机选择3个字母设置齿轮，再发送随机选择的3个字母帮助密文接受方将Enigma配置成相同设置来解码。其中有个一个名为Walter的电报员，每天都将他的Enigma齿轮设置成他名字的前三个字母 W A L，然后发送的3个字母是他女朋友名字Kalare的前三个字母 K A L，这是Bletchley Park的一个传奇。因为人无法真正做到随机，所以产生很多让人能猜的Enigma设置，比如LON 后面跟 DON，BER后面跟LIN，HIT后面跟LER等，还有很多这类设置是德语中的脏话（人就是人啊）\n\n5.Turing主要参与的是德国海军Enigma破译工作，因为海军Enigma管理更严格，海军不允许电报人员像空军那样自己任意选择6个字母（3个设置齿轮 3个发送），字母必须从一本用水溶墨水印刷的密码本上选取，所以破译难度更大。\n\n6.对于破译海军Enigma Machine中起到的重要事件是1941年5月9日英国皇家海军HMS Bulldog俘虏u110潜艇缴获Enigma Machine和密码本（因为德军人员急着弃船，而没有销毁密码本），以及1942年俘虏u559潜艇的Enigma Machine和密码本。相关事件美国拍过一部电影，没错就是那部《u-571》\n\n7.Heil Hitler 只是一个crib，在Bletchley Park，他们用某些德语中的已知固定搭配或者已知信息作为解码的key，这些key叫cribs，因为Enigma被设计成对于任意相同的电文所输出的密文不含有重复字符，所以可以用cribs比对找出cribs在电文中的可能位置来帮助破译当日24小时内的Enigma设置。\n\n8. Bletchley Park后来甚至发展出了一套新战术来人为创造crib，Bletchley Park要求英国皇家空军（RAF）在固定海域投放水雷，然后德国海军巡逻人员就会用密码汇报水雷位置，从而人为制造一个crib，这一战术Bletchley Park称之为Gardening\n\n9.但即使这样，比对cribs仍是一个机械耗时的人工工作，Turing的主要贡献是把这个漫长耗时机械性地人工工作用机器取代，他提出的自动逻辑计算模型，帮助工程师制造出了一个自动搜索机器Bombe（电影里叫Christopher）\n\n10.用crossword招募人员是Bletchley Park一直在做的工作，不是Turing想出来的。招募的人员的背景庞杂从语言学家到古埃及学家，甚至还有律师\n\n11.我们用的电脑不是Turing Machine，Turing Machine是一个理论计算模型，如果想了解请看：http://en.wikipedia.org/wiki/Turing_machine#Comparison_with_real_machines\n\n整个Enigma破译工作是整个Bletchley Park很多很多人的集体智慧和努力的成果，这部电影把所有的贡献都说成是Turing一个人的有点有失公允和真实性，不过这部电影拍的还不错，值得一看。", "useless_count": 42, "comments_count": 25, "alt": "https://movie.douban.com/review/7311413/", "id": "7311413", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 223, "author": {"uid": "qingfeng", "avatar": "https://img3.doubanio.com/icon/u1001560-14.jpg", "signature": "", "alt": "https://www.douban.com/people/qingfeng/", "id": "1001560", "name": "清风"}, "created_at": "2015-07-24 19:29:27", "title": "看哭了", "updated_at": "2019-02-19 00:42:56", "share_url": "https://m.douban.com/movie/review/7546767", "summary": "看到图灵因为一个灵感，冲回办公室，之后图灵机计算出结果的那一刻，我直接泪奔了，坐在我旁边的人肯定觉得这哥们疯了。虽然我这辈子绝对不可能达到图灵的高度，但图灵那种孤独感我还是能感受的到的，所有技能类...", "content": "看到图灵因为一个灵感，冲回办公室，之后图灵机计算出结果的那一刻，我直接泪奔了，坐在我旁边的人肯定觉得这哥们疯了。虽然我这辈子绝对不可能达到图灵的高度，但图灵那种孤独感我还是能感受的到的，所有技能类的工作，不管是写作，拍电影，画画，创作音乐还是写代码的人，在这个层面上都是相同的，就是，外人永远只能看到结果，而看不到创作的过程，也无法理解这个过程，最终导致这个创作的过程无比孤独。你以为，创作出少女在花田里奔跑的动画的人，就是那种在花田里奔跑的人吗，怎么可能呢，而是走火入魔伏案工作，呕心沥血燃烧生命创造作品的人阿。", "useless_count": 13, "comments_count": 29, "alt": "https://movie.douban.com/review/7546767/", "id": "7546767", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 179, "author": {"uid": "Kiddieyi", "avatar": "https://img1.doubanio.com/icon/u3418993-68.jpg", "signature": "未曾入世，何来出世", "alt": "https://www.douban.com/people/Kiddieyi/", "id": "3418993", "name": "山人阿苍苍"}, "created_at": "2014-11-17 06:29:21", "title": "Are you paying attention", "updated_at": "2018-06-29 10:17:42", "share_url": "https://m.douban.com/movie/review/7195263", "summary": "为了挽救我这个废材的、丝毫不productive的周末，我决定写一篇本片repo来自欺欺人。（题目乱取的  ----------------剧透分割线--------------   「Are you paying attention? Good. If you’re not listening car...", "content": "为了挽救我这个废材的、丝毫不productive的周末，我决定写一篇本片repo来自欺欺人。（题目乱取的\n\n----------------剧透分割线--------------\n\n\n「Are you paying attention? Good. If you’re not listening carefully, you will miss things.」\n\n开场就是BC的一段独白，然后我就乖乖地全程照做了。（在刷了interstellar之后，我惊喜地发现相比马修的murmur，BC的发音竟然变得如此清晰如此好懂，堪比雅思听力。）\n\n本片最大的王牌就是图灵的生平。是人类历史上不世出的天才就算了，以一己之力助国家取得二战胜利也算了，他居然还是一个同性恋，居然还因此被迫害致死！这种级别的“悲剧性”堪比星辰陨落，超越时间与空间，足以让世界同悲。\n\n有人说影片三条叙事线并行的处理欠佳，但我倒认为除了警探那条线弱了点外，其他两条线还颇为可圈可点，而且这两条线之间有隐藏联系。尤其是对少年图灵的处理。图灵小演员除了“和BC长得一点儿都不像”和“眉毛长得太抢眼”外，堪称完美，得知克里斯托弗死讯时“生无可恋，心如死灰”的眼神简直虐煞我，这种眼神一不小心就会演成“呆滞放空”，但他没有。\n\n然后，（没有记错的话）此处剪辑接了一个大图灵的graphic matching，再接着就迎来了本片最令人心碎的一幕之一，在此我就不剧透了。而可以说的是，BC的几场哭戏飙出了相当不一般的演技。那种易碎感不可能是卷福能有的，所以别再说他演什么都和演卷福一个样啦。\n\n还有人说片子没有直面图灵的同性恋事实，我真的是整个人都不好了。真的，说这话的人不要看电影了，尤其是日本电影。\n\n除BC外，本片还有另一位男神级的人物马修·古迪出演，但可惜他那个角色实在太绿叶，没什么特别出彩的感觉。\n\n总得来说，《模仿游戏》既中规中矩又政治正确，最大亮点是演员的表演，以及图灵本人的经历足够跌宕起伏、催人泪下。\n\n看本片之前，我对阿兰·图灵毫无了解。看完本片后，我回来打开了维基百科。然后被“图灵还是一位世界级的长跑运动员”震惊，遂拍大腿：难怪BC跑起来丑出本片画风，导演却还是非要拍他跑步！\n\n就以BC在某颁奖礼上的领奖词作结吧!\n\n「This is a story that celebrates him. It celebrates outsiders. It celebrates anybody who's ever felt different and ostracized and ever suffered prejudice.」\n\n----------\n我再啰嗦一句，观影结束后莫名其妙想到doctor who第五季里梵高的那集，要是图灵也能穿越时空来到今时今日，看看世界世人因他发生了怎样翻天覆地的变化，看看英国政府迟来的道歉与赦免，该多好啊。", "useless_count": 13, "comments_count": 27, "alt": "https://movie.douban.com/review/7195263/", "id": "7195263", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 185, "author": {"uid": "waking", "avatar": "https://img3.doubanio.com/icon/u1282605-6.jpg", "signature": "c'est la vie", "alt": "https://www.douban.com/people/waking/", "id": "1282605", "name": "waking王小心"}, "created_at": "2015-01-10 13:27:16", "title": "《模仿游戏》：人与机器的区别", "updated_at": "2015-08-03 23:51:48", "share_url": "https://m.douban.com/movie/review/7333942", "summary": "在《模仿游戏》的最后二十分钟，在审讯室里，面对着探长的图灵说出了本剧的题眼：人和机器的区别是什么？二者最本质的区别是，人是有不同想法的，机器则不是。你爱草莓，我讨厌滑冰，你喜欢看书，我对花粉过敏…...", "content": "在《模仿游戏》的最后二十分钟，在审讯室里，面对着探长的图灵说出了本剧的题眼：人和机器的区别是什么？二者最本质的区别是，人是有不同想法的，机器则不是。你爱草莓，我讨厌滑冰，你喜欢看书，我对花粉过敏……图灵这番话，点出了他这一生最重大的两个主题：事业与性向。\n\n图灵的一生以创造了图灵机，也就是后世无数码农为之贡献了一生的计算机闻名。当他在剧中说出“Digital Computer”时，多少人的心里响起轰轰烈烈的背景音乐：啊，一个时代开始了。然而《模仿游戏》里，主要情节是他在二战中破译德军密码“谜”的过程，他和他的同事们为二战做出的无名英雄式的贡献。“谜”是德军在二战中发明的、当时世界上最先进的加密器，由于其复杂的构造，创造出了几乎不可能穷尽的可能性。如果图灵和他的同事们用手工算法，每十分钟解决一种可能性的话，他们需要2000万年才能算出所有的可能。人工的路被堵死了；这使图灵想到，他要创造一台比人算得更快的东西，电子的大脑，也就是计算机的雏形。当年的“计算机”是多么庞大而复杂啊：无数的铜线和字母轮在屏幕上轰隆隆地旋转着，速度却比今天的电脑不知道慢了多少倍。然而，就是这样一台机器，却是后世所有计算机的祖先，它足够破译德军的密码，这是人不能办到、而机器却可以的东西。\n\n然而，什么是机器不能办到的东西？选择。机器不会选择，它只能告诉人类它们计算出来的东西；作出选择的，永远是人类自己。破解“谜”之后，一旦破解被使用，德军就会知道他们的密码已被破解，而一旦德军弃用密码，他们将前功尽弃。图灵和他的同事们面临这个世界上最艰巨的选择：如何使用他们的破译，来尽可能地保护英国的人民、提早结束战争，同时又不被德军知道？这是全世界最难的难题：一个人的生命重要，还是五个人的生命重要？还是一千万人的生命重要？谁应该被牺牲，而谁又应该被保护？这个选择的难处在于，无论什么样的选择，都会有人唾骂。电影中借图灵之口不无嘲讽地说道，“全世界以为这是不同文明形式之间壮丽的对决，可是在我们看来，只是统计学算出的概率上的数字。”战争不过如此，甚至人的生命也不过如此。图灵研究出了世界上最先进的机器，可是这台机器服务的是谁？\n\n也许正因为此，英国政府战后将他们所有的资料、成果付之一炬。他们回到各自的大学，江湖再见，所有的档案变成了空白，他们将此事保密了五十多年。战后，图灵因为同性恋被判决“猥亵罪”，他在服刑两年和服用荷尔蒙之间选择了后者，这使他的精神受到了摧毁。不到42岁，他选择了自杀，全球最伟大的生命之一就此谢幕。他有办法创造出全世界最聪明的机器，却只能对他自己的人生作出最悲剧的选择；他把自己的图灵机命名为“Christopher”，那是他初恋的名字。历史上确有此人，并确实引领他进入了密码的世界，但在年轻的时候就因为饮用受污染的牛奶，得了牛结核病而死去。在电影中，他的死亡是戏剧性的：充满霸凌行为的校园，两个少年相依为命。当一个鼓足勇气拿着用密码写成的“我爱你”去找另一个少年时，听到的却是噩耗。他的死改变了图灵的世界观，从此他变成了一个彻底的唯物主义无神论者。\n\n同性恋与发明图灵机一样，都是超越了当时的社会而不见容于主流群体的行为。电影中多次提到：只有最难以揣测的人，才能做出最惊世骇俗的事情。图灵如此，历史上能引导人类进步的伟大人物，哪个不是如此。即使这样的秘密被保守了几十年，人们还是终于能有一天正确地评价他的贡献。\n\n本尼迪克特•康伯巴奇把这个神经质、痛苦而又想与人为善的天才刻画得淋漓尽致，例如电影中他说的那个笑话本身并不可笑，可是他的表情神态却让人忍俊不禁，让人清楚地看到图灵不擅长的一面。自夏洛克•福尔摩斯以来，他一直在正确的演艺道路上前进。马修•古尔德保持了帅哥的一贯本色，剧中还有各种熟悉的英伦面孔，比如《唐顿庄园》里的小司机，《锅匠、裁缝、士兵、间谍》中的基友，各自都贡献了为数不多却精彩的表演。\n\n\n", "useless_count": 16, "comments_count": 10, "alt": "https://movie.douban.com/review/7333942/", "id": "7333942", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 177, "author": {"uid": "zeaglog", "avatar": "https://img3.doubanio.com/icon/u2108113-20.jpg", "signature": "2B or not 2B, this is a ", "alt": "https://www.douban.com/people/zeaglog/", "id": "2108113", "name": "小良"}, "created_at": "2015-01-14 08:27:50", "title": "作为一个愚蠢的人，请善待你身边的天才。", "updated_at": "2019-02-08 04:34:09", "share_url": "https://m.douban.com/movie/review/7341808", "summary": "因为你的生活是因为他们，才有如今的模样。  我一直是这么认为的。世界上99%的人都极其愚蠢。勿感冒犯，正在看这篇文章的你，和正在写这篇文章的我，都是其中的一份子。  我们有着平庸的头脑，做着重复性的，没有...", "content": "因为你的生活是因为他们，才有如今的模样。\n\n我一直是这么认为的。世界上99%的人都极其愚蠢。勿感冒犯，正在看这篇文章的你，和正在写这篇文章的我，都是其中的一份子。\n\n我们有着平庸的头脑，做着重复性的，没有创造性的劳动，以此应付我们的生活。同时我们还在不停地抱怨世界给我们的太少。\n\n而剩下1%的人，或者更少，他们是这个世界前进的真正的源动力。而他们，从不关心这个世界剩下的其他部分。\n\n这些人有一个共同的名字，叫做天才。GENIUS\n\n---------------------------------------------------------\n\n天才也许不是什么好事，至少对他们本人来说。《模仿游戏》或是其他很多作品已经有了这样的描述：与众不同的人，常常受到不同程度的侮辱，怀疑，鄙视和伤害。\n\n为什么？\n\n人类惧怕和自己不一样的东西，所以制定了这样那样的规定。因为大多数人穿一样的校服，不穿就是邪恶的。因为大多数人是异性恋，所以同性恋是邪恶的。因为大多数人都应该结婚，所以不结婚是邪恶的。\n\netc.\n\n--------------------------------------------------------\n\n正如片头那个小哥。\n\n我可是拿了XX奖的，他笑着说，两次。\n\n这只不过更是证明了他只是99%愚蠢者中的一个。\n\n因为天才是不会跟别人比较的。天才只会专注自己要解决的问题。\n\n天才甚至不会关注做的东西对这个世界产生了多么震撼的作用：他们从来就不是为了名誉，金钱或者任何普通人梦想的东西而工作的。他们只为满足自己内心而工作。\n\n而他们的成果，只是顺便地，或是拯救了世界，或是让人类前进了一大步。\n\n--------------------------------------------------------\n\n看到片尾的时候我一直不停地在抹眼泪。\n\n在绝大多数时候害死天才的是我们，愚蠢的普通人们。我们害怕，我们恐惧，我们不能接受和自己不一样的人。\n\n影片给了一个和我预想的不一样的结局，原本在看电影之前，我想我在看到那个被咬了一口的苹果的时候，一定会泣不成声。\n\n幸好导演放过了我，但出现的那几行字，也让我平静了好一会才能走出电影院。\n\n\"图灵逝世时年仅四十一岁”。\n\n--------------------------------------------------------\n\n我所从事的专业叫做交互设计，和许许多多专业一样建立在计算机科学的基础上。\n\n没有图灵，我现在可能还需要拿着尺规作图，或者用几十张纸日以继夜地画手稿。\n\n想想看，如果他没有遭到那么多的迫害，可以一直安心地做他的研究，家用计算机出现的日子不知道要早多少年。\n\n但是已经没有也许了。图灵的英年早逝，给我们的世界带来了巨大的损失。\n\n而你知道他的工作挽救了多少人的生命吗，\n\n14 million。 一千四百万人，因为图灵的贡献，得以保全自己的生命。\n\n--------------------------------------------------------\n\n不禁想到至今还流传在网络上的恐同言论，又或是一些“我可以理解同性恋，但我不接受我的家人是同性恋”，之类的blablabla。\n\n很好，我但愿你的家人里不会有图灵这样的天才，否则人类又要往后退一大步。\n\n--------------------------------------------------------\n\n我希望大家一起善待我们身边的天才，\n\n他们会有很多这样那样让人看不惯的地方。不善于交际和沟通，行为奇奇怪怪出格，很多时候不能忍受。但也许他们中就有图灵那样的人。\n\n我们对不一样的部分要给予最大的善意。那样智慧的大脑不是我们可以理解的。\n\n而我们在未来每一天可以享受到的所有东西，都来自于这些天才们。\n\n\n向和图灵一样遭受过这样那样迫害的天才们致敬。\n\n\n-------------------------------------------------------\n\n转自Wikipedia：\n\n“苹果公司的商标有时会被误认为是源于图灵自杀时咬下的半个苹果，但该图案的设计师和苹果公司都否认了这一说法。而公司创办人史蒂夫·乔布斯在接受英国广播公司（BBC）电视节目《QI》的主持人史蒂芬·弗莱问到此事时说：“It isn't true, but God, we wish it were.\"”\n\n", "useless_count": 11, "comments_count": 18, "alt": "https://movie.douban.com/review/7341808/", "id": "7341808", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 131, "author": {"uid": "glorymanutd", "avatar": "https://img3.doubanio.com/icon/u6781489-2.jpg", "signature": "舉目見日，不見長安", "alt": "https://www.douban.com/people/glorymanutd/", "id": "6781489", "name": "Singin'in rain"}, "created_at": "2014-11-16 06:33:25", "title": "二战的幕后英雄——阿兰图灵", "updated_at": "2015-03-11 23:47:23", "share_url": "https://m.douban.com/movie/review/7193991", "summary": "一直对图灵在二战中牵头用计算机原理破解德军密码这段历史很感兴趣，《模仿游戏》这部电影刚好再现了当年的往事，并还原地十分精彩。向图灵先生致敬，尤其是在曼彻斯特生活学习过三年，耳濡目染很多他的故事，看...", "content": "一直对图灵在二战中牵头用计算机原理破解德军密码这段历史很感兴趣，《模仿游戏》这部电影刚好再现了当年的往事，并还原地十分精彩。向图灵先生致敬，尤其是在曼彻斯特生活学习过三年，耳濡目染很多他的故事，看了电影感受更深。\r\n\r\n查了一些二战时密码战的背景资料，贴在这里：\r\n\r\n图灵的密码故事要从一个“谜”开始，ENIGMA (谜) 源自于希腊文，既是战争时期所用的密码（在所有用于军事和外交的密码里，最著名的恐怕应属第二次世界大战中德国使用的ENIGMA），而破解这个密码的正是阿兰• 麦席森• 图灵。\r\n\r\n二战期间， 德国发明了一种看似不可破译的密码“ENIGMA”，这是一种用于ENIGMA 加密和解密的机器，这种密码被德军广泛使用，包括定位出没于大西洋运输线上的潜艇，这些潜艇以令人心惊胆战的速度击沉英军的船只，被丘吉尔称为“大西洋海战”。丘吉尔担心英军会因补给短缺而战败，而解决的唯一办法便是阻止德军的潜艇战术，破解ENIGMA 就是阻止德军的方式之一。如果英军能破译这些情报，他们就可以确定位置并击毁潜艇。但在整整 13 年里，英国人和法国人都认为ENIGMA 是不可破译的。\r\n\r\n针对这一情况，政府成立了一个新的机构——英国政府密码学校（Government Code and Cipher School, GCCS），总部坐落在白金汉郡的布莱切利庄园。这个难题也交到了图灵手中，从1938 年9 月开始，图灵一直专门负责ENIGMA的密码分析。他率领着大约200多名精干人员进行密码分析，其中甚至还包括世界象棋冠军亚历山大。分析和计算的工作非常复杂，26 个字母在“ENIGMA”机中能替代8万亿个谜文字母。如果改动接线，变化会超过2.5 千万亿亿。图灵凭借着他的天才设想设计出一种破译机。这台机器主要由继电器构成，还用了80个电子管，由光电阅读器直接读入密码，每秒可读字符2000 个，被称为“图灵炸弹（Bombes）”。\r\n\r\n图灵对 ENIGMA 的破译方法完全是纯数学和理论性的，据他的同事们回忆，他在破译密码的工作中，曾创造好几种新的统计理论，但都未形成论文发表，后来又重新为他人所创建，由A．瓦尔德(Wald)重新发现并提出的“序贯分析”就是其中之一。序贯分析是数理统计学的重要分支之一，其特点是，在研究决策问题时，不是预先固定样本量，而是逐次取样，直到样本提供足够的信息，能恰当做出决策为止。其中“序贯概率比检验（Sequential Probability Ratio Test, SPRT）”在密码分析中的应用，可以明显约减相关攻击所需的密钥量。\r\n\r\n由于这个组的努力，特别是图灵的出色工作，他们掌握了破译该密码的一整套方法，从而了解了德军的动向，掌握了战争的主动权，为英美联军击败德国做出了突出贡献。1941 年5 月21 日，破译小组第一次立了大功，因为截获了希特勒给海军上将雷德尔的一封密电，将当时号称世界上最厉害的德国战列舰“俾斯麦”号击沉。1943 年4 月，日本联合舰队总司令长官山本五十六，在4 月18 日将飞抵卡西里湾，这份情报被破译小组破译，于是，这位战功卓著的日本司令的飞机，在距离卡西里只有几英里处被拦截并击落。\r\n\r\n图灵的许多思想和预见都在他死后不断得到验证，也始终引导、推动着计算机科学的发展。国际计算机协会于1966 年设立“图灵奖”，以专门奖励对计算机科学研究与推动计算机技术发展有卓越贡献的杰出科学家。\r\n\r\n\r\n\r\n引用自\r\n《图灵——密码破译者》\r\nhttp://www.cms.org.cn/cms/zl/tuling/turing2012-4.pdf", "useless_count": 6, "comments_count": 7, "alt": "https://movie.douban.com/review/7193991/", "id": "7193991", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 135, "author": {"uid": "brotherhao", "avatar": "https://img3.doubanio.com/icon/u1144503-6.jpg", "signature": "呐~", "alt": "https://www.douban.com/people/brotherhao/", "id": "1144503", "name": "萌萌的老王"}, "created_at": "2014-11-16 08:34:53", "title": "【剧透慎入】他用初恋的名字来命名他的杰作，然而和初恋一样，他们都是需要深埋心底的秘密", "updated_at": "2017-07-11 21:28:14", "share_url": "https://m.douban.com/movie/review/7194009", "summary": "他用初恋的名字来命名他的杰作，然而和初恋一样，他们都是需要深埋心底的秘密。 对于担心卷福语速而还在犹豫的小伙伴们大胆的上吧，这部里面他有些小结巴，片头独白甚至清晰到听得到每个单词，毫无压力！   -----...", "content": "他用初恋的名字来命名他的杰作，然而和初恋一样，他们都是需要深埋心底的秘密。\n对于担心卷福语速而还在犹豫的小伙伴们大胆的上吧，这部里面他有些小结巴，片头独白甚至清晰到听得到每个单词，毫无压力！\n\n\n------------------------------------------------------------------------------------------------\n论BC在神探夏洛克和本片中的相似处：\n                              神探夏洛克                           本片\n个性：               自恋--社交障碍                  自闭--社交障碍\n社会关系：        依靠唯一的朋友                   依靠唯一的朋友\n个人取向：            ***                                          gay\n\n-----------------------------正文分割线----------------------------------------------------\n一个寂寞的天才。在他心灵内可能有一座繁华的凡人无法触及的殿堂。当他站在人群中，他可能觉得自己站在一片旷野的中心。凡人无法有共鸣。而他在凡人眼里，也可能不过是一个在发呆的矮小的男孩。人类迷恋暴力，因为暴力能让人产生优越感。这时候你的格格不入，可能就会成为暴力的借口。小时候的图灵，他的烦恼只是在Grammer School里被同学欺凌。但是那时他有了Christopher。他是那么理智，他说，他们欺负你只是因为你different。\n\n我们应该如何评价一个人？我们是否可以评价一个人？\n机器能思考吗？机器当然是不能像人类一样的思考，但是，这样就能说它没有在思考吗？\n正如你我的不同，这样的评价有何意义？\n\n时间拉回到青年的图灵。图灵成年后的人生，依然和他的Christopher交织在一起，如果不是当初被他从黑暗中拉出，如果不是他递来的一本关于密码的书，和那一句“I think you will be good at this”。他不会把自己的数学天赋和密码学联系在一起。把视角拉得很高很高，他是一个伟大的人，因为他的发明，在二战中破解了德军的密码，使得的成千上万的人免于死亡。他是一个战争英雄。然而，让我们靠近一些，发现，他把他的图灵机器叫做Christopher。\n\n那时候，Christopher离开的时候，留下了一张密码。图灵翻译出来，他说我最亲爱的朋友，两个周之后见。他满怀期待的等待着，他用密码写了一条信息，等待着Christopher回来要给他。\n\n再来说说和这场战争的联系，出发点是为了站在天使的那一边。破解了德军密码，截获信息，胜利。可是，当这一切由“Christohper”做到之后，一切并没有完全如预期。德军密码被世人当做无法破译，这场战争结束了，可能还有下一次。密码已被破译的消息不可流出。无法扬名于世并不是天才关注的点。让他痛苦的，是他的创作给了人类决定他人生死的机会。但是，权力说，这是不可见世的秘密。图灵只能接受。那个洞察一切的官员说：为什么选择你做间谍？因为我发现你别其他人更能够隐藏秘密。\n\n图灵的机器基于他的论文，能够做到任何事的机器。可是世界上的可能性太多，就像德军的密码，有一兆以上的可能性。就算是天才，天才的能够做到任何事的机器在一开始的时候也没能找到头绪。\n“你为什么知道那电报是发给他女友的？”\n“因为他会重复用到Love。”\n于是他想到他不用找到所有的可能性，只用找出那些在预期中的。\n\nI LOVE YOU. 少年图灵把他改写成密码，写在信纸上，要带给从假期中归来的Christopher。 然而，人群散去了，他等的那个人却再也不能回来。\n\n今年是腐国通过同性恋婚姻法案的第一年，虽然现在腐国的腐的程度经常让人扶额，但是在几十年前，作为一个传统的基督教国家，腐国对homosexual的态度是跟现在截然不同的。Indecency是他们的评价。\n\n他的成就和功绩无法公诸于世，在世人眼中，他只是一个被评价为Indecency的败类。坐牢还是接受会损害心智的荷尔蒙注射治疗？ 他选择了后者。因为，这样他至少还能和在厨房默默运作的“Christopher”在一起。 如果坐牢他们会拿走”Christopher“，他不会再允许这样的事发生。他的双手因为药物发抖，他甚至无法解开报纸上的字谜游戏了。 但是只要“Christopher become more and more smart.“就好了。\n\n他可能还是站在荒野中的天才，但是当他遇到那个人之后一切都改变了。虽然你已经不在我身边，但是当我闭上双眼，那个面容清秀的你还坐在树荫下，我从书本中抬起头，转过头还能看见你，微笑着静静的注视着我。这个世界，我最想要的已经不在这里了。所以每一分每一秒都只是苟延残喘。\n\n图灵吃毒苹果自杀。Apple为了纪念这位人工智能之父把图标设计为被咬掉一口的苹果。而Apple最初的图标是彩虹色而不是现在的白色。（最近他们CEO也出柜了是伐？......)\n\n他把一切都埋藏得那么深。 匆匆的来了又去，只留下了一个背影。只希望最后那一刻，他看到的，还是Christopher那双安静理性的眼睛，带着笑，迎接他。", "useless_count": 25, "comments_count": 48, "alt": "https://movie.douban.com/review/7194009/", "id": "7194009", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 78, "author": {"uid": "janejeh", "avatar": "https://img3.doubanio.com/icon/u1532174-14.jpg", "signature": "有种美德叫有种", "alt": "https://www.douban.com/people/janejeh/", "id": "1532174", "name": "低端小能七九西"}, "created_at": "2015-02-12 18:02:11", "title": "The uncomformist is still the uncomformist and the Great Britain is still the Great Britain", "updated_at": "2016-09-26 10:41:45", "share_url": "https://m.douban.com/movie/review/7377336", "summary": "从商业片的角度来说，模仿游戏是成功的。至少它能让所有先前没看过图灵传记，对他一无所知的人在走出电影院的时候都被感动得一把鼻涕一把泪，对他悲惨的一生唏嘘不已。好吧，刚刚走出电影院的时候，我的感受差不...", "content": "从商业片的角度来说，模仿游戏是成功的。至少它能让所有先前没看过图灵传记，对他一无所知的人在走出电影院的时候都被感动得一把鼻涕一把泪，对他悲惨的一生唏嘘不已。好吧，刚刚走出电影院的时候，我的感受差不多就是这样的。\n\n从故事情节来说，The Imitation Game不愧荣登2011年度“尚未采用的好莱坞最佳剧本”，它取材于历史，既合时宜，又有时代性，有感人有煽情，有笑料有深度，而除了以上种种，更不失英国风格。相比雄性荷尔蒙过于浓厚的好莱坞风格，它还有英伦三岛的细腻平实，将焦点放在无意于为国捐躯的个体身上，而他对于自我和知识的追求却无意中拯救了全人类和英国，然而国家机器没有给予他应有的肯定，却因他个人性取向而将其迫害致死。透过对Turing的性取向感情丰沛的描写，对他性取向的正面肯定，大英帝国再次在一部影片中完成了对自我的赎罪。将主流建制与非主流反建制如此融洽地融合成一个整体，只有英国人才干得出那么天衣无缝的活儿来。\n\n如果只是想看一部不错的影片，为冲击奥斯卡度身定做，但意欲隐藏得比较好，不像张艺谋那么明目张胆的话，这篇影评看到这里就可以关闭视窗了。尤其是考虑到Benedict在影片中奉献的神演技，Matthew Goodie三百六十度无死角的美颜和终于可以在一部影片中看到不那么讨人厌的Keria Knightly，我觉得一百块不到真是值回票价了！\n\n然后如果有心者在看完电影，被Turing坎坷一生深深感动之后，满怀好奇心翻了翻他的传记，就会发现，这位导演不仅是个讨巧的说故事人，还是个大骗子！\n\n当然，根据历史人物改编的文艺作品，为了制造戏剧效果而进行再创作或者一定程度的歪曲，都是再正常不过的事。比如说，为了给枯燥的破解密码的工作制造一些波折，而将Matthew Goodie扮演的Hugh Alexander写成Turing的死敌，或者把海军上将写成个不近人情的老顽固，这些都是可以理解的艺术加工。但，导演对Turing的生平和性格为了制造狗血剧情而做的某些大刀阔斧的改动，不仅毫无必要只反映导演水平之庸俗，更有意无意地透露了导演满满的恶意。\n\n首先，影片刻意将Turing塑造成一个高IQ低EQ，有如Sheldon Cooper，BBC版Sheldon这样带有自闭症甚至反社会人格倾向的怪人，然而在现实生活中，Turing确实是一个天才，还带有一点毒舌，可是正是因为他的毒舌和天才，使得他一向深受同事欢迎，在Bletchley更吸引了一群粉丝，他和Hugh Alexander性格上的互补并没有让他们交恶，反而有助于他们取长补短无间合作。如果要给Turing的性格制造一些古怪之处，为什么导演不选用因为有花粉过敏症而带防毒面具上下班，或者总是在睡衣外面罩一件夹克就返工这样的有史实证明的细节呢？\n\n其次，影片对于Turing的同性恋倾向着墨事实上并不多，一方面把他描述成一个因为惧怕社会压力而深柜的同志，另一方面则把他的同性恋情集中在对初恋的忠贞和念念不忘之上。而事实上，Turing从来没有隐瞒过自己的性取向，只要一有机会就向同事出柜，甚至在和Joan订婚第二天他就把自己的真实性取向告知了对方；而在Christopher去世之后，从大学开始他的情史便洋洋洒洒一大堆，完全不像电影中写的那样永远活在纯情的十六岁。\n\n也许这种媚俗的改编纯粹是为了迎合大众口味，可是为什么我们的主流影片要一再纵容这些口味呢？为什么一说到高智商的科学家，就一定要出现A Beautiful Mind，Big Bang Theory这样的刻板印象？难道一个高智商的人，就不可以有高情商吗？难道一个人因为学术和知识的成就被人敬仰，就注定在日常生活中孤独终老吗？莫非这就是当代人所能接受和理解的“上帝是公平的”吗？\n\n而这部以主角同志身份为重心的影片，甚至重要到要虚构一个情节贯穿整部影片将三条主线汇聚在一起，却根本无法正视主角的同志身份。让Joan抢掉那么多感情戏份也许是出于剧情考虑暂且不说，但是导演在影片中对主角的同性恋倾向甚至都没有Turing那么坦然，他所勾勒的Turing对同性的偏好，是因为童年阴影和初恋情节这些伪心理学的陈词滥调所建立起来，这里的Turing不是坦荡荡地对同性有性趣，而是因为错误的巧合，刚好对同性产生了依赖，却没有机会得到正常的表达与疏导，受这些影响，才导致了同性性取向的萌发。这种煽情的合理化让我感到恶心。与导演所想要表现的这个内心永远住着当年失去了Christopher而强忍着眼泪故作坚强的敏感小男生的Turing相比，没有了这些狗血和矫饰，现实生活中的Turing却显得更真实而可爱。\n\n影片中最打动我的是Turing谈及他的论文时所说的那段话：\n\n“机器当然无法像人类一样思考，机器与人类是不一样的，有趣的是，如果某个东西与你的思考方式不同，那是否说明它不会思考？你看，我们允许人类之间的种种差异，你喜欢草莓，我讨厌滑冰，你看悲伤的电影会哭泣，我对花粉过敏，不同的口味，不同的选择，意义究竟在哪？如果我们并不会因为大脑运作方式不同而质疑思考方式的不同，我们如此对待另一个人的大脑，为什么我们不能对一个由铜线与钢铁铸成的大脑，抱有相同态度呢？”\n\n我想，对于看过这部影片的人来说，这段话也许想要问的是，“天才和普通人也许是不一样，但是那是否就说明天才不会和普通人一样生活和享受生活？有人通情达理，有些人弄袖善舞，有些人则是彻底的混蛋，我们并不会因此质疑那些人是不是正常人，可是我们能不能以同样的平常心对待一个思想不同的天才呢？”“同性恋者和异性恋者也许是不一样，但是否就说明同性恋者不会和普通人一样那样去爱呢？有些人享受萍水相逢的鱼水之欢，有些人永远着迷爱情的新鲜感，有些人信奉执子之手与子偕老，可是我们不会因此质疑那些人是不是正常人，可是我们能不能以同样的平常心对待一个跟自己性别相同的人恋爱的人呢？”\n\n这部电影反映出来的答案是悲哀的。也许我们终于可以把同性恋者放在台面上来谈论，可是我们仍旧从骨子里觉得他们不可能像我们那样去爱。和我们不一样的天才，仍旧是需要低情商自闭症这些标签去看待的；和我们性取向不同的人，仍旧是需要用一套伪心理学的陈词滥调去分析他的性取向动机，合理化他的性取向的。因为，从骨子里，这部影片的导演，并不愿意，也无法去坦然地理解Turing，而种种媚俗，或许正反映了大众的真实面相。\n\n有人说，Turing对于机器人工智能的孜孜热情事实上反映了他本人在社会中的焦虑，他从来不曾感到他自己和其他的人类是一样的，当他研究及其如何模拟人脑思考，他的一生也是在思索，自己该如何模拟正常人那样去生活。或许从这一点来说，无需有狗血的Christopher情节，Turing孤独的终年与崩溃也是可以理解的，而Benedict在那一段的表演，仅仅是透过满怀哀伤的双眼，所反映出来的深度是电影所不曾企及的，而真实的Turing的思想的深度，也远远超出了这部商业影片所能反映的。\n\n在Turing的传记中，作者写道这个社会永远不曾grapple到Turing的unconformism。在这部影片中，我看到这句话的真实，社会并没有去理解他的unconformism，只是尝试把他的unconformism中某些当下社会已经开始能够接纳的部分提炼出来，以confomist的方法去解读，并以此表达自己对unconfomist的包容。\n\n有些人看完影片之后说不知道这部影片想要讲的是什么，究竟是天才，还是同性恋。我说别闹了。这部影片只是一部典型的英式主旋律电影，反映了英国在二战期间对反法西斯主义作出的艰苦卓绝的伟大贡献，在纪念反法西斯战争胜利七十周年之际，透过自己书写的忏悔剧本来赎罪，树立大英帝国正义而神圣的形象，Turing不过就是个时下流行的元素借来过桥而已。这通过影片结尾就已经体现出来，没有床头的苹果，没有服毒自杀的Turing，只有二战结束之后，Bletchley Park各位同僚，肩搭着肩手挽着手，亲手将数年的心血投入火堆看着它们化为灰烬，火光映衬着他们年轻的脸庞，带着欣慰的笑容，闪着幸福的光芒，好像革命胜利之后的地下党一般，功成身退，深藏功与名。\n\n当然，我还是强烈推荐这部电影的，难得有一套主流的影片，可以用广大群众能明白能理解的方式，将一个同性恋者为人类社会做出的伟大贡献呈现给大众的。套用一句网友评论，各位恐同者，你们敲出的每一个恐同和仇恨同志的字眼，若不是因为这位同性恋者的无名贡献，绝不可能成为现实。建议那些号召因为库克出柜抵制苹果，因为Starbucks支持同志平权而抵制Starbucks的各位，看完这部影片赶紧快快把自己的电脑合上，扔进垃圾堆里，不，为了表达义愤填膺，最好是一把火烧了，让火光映衬着你们的充满正义感的脸，如同影片结尾一样，看着熊熊火光闪着幸福的微笑，大声地唱着歌，从今往后，只用竹简书帛，深藏功与名。\n\n\r\n", "useless_count": 3, "comments_count": 8, "alt": "https://movie.douban.com/review/7377336/", "id": "7377336", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 42, "author": {"uid": "131371214", "avatar": "https://img3.doubanio.com/icon/u131371214-13.jpg", "signature": "", "alt": "https://www.douban.com/people/131371214/", "id": "131371214", "name": "闲"}, "created_at": "2017-04-02 07:55:58", "title": "伟大成就者总是孤独的。", "updated_at": "2017-04-02 07:55:58", "share_url": "https://m.douban.com/movie/review/8452237", "summary": "回顾本尼迪克特·康伯巴奇演绎过的角色，福尔摩斯、霍金、梵高、“维基解密”创始人阿桑奇、计算机之父图灵等，本尼成为了驾驭高智商角色的天才代言人。在《模仿游戏》中，本尼对图灵这个角色的诠释是该片的画龙...", "content": "回顾本尼迪克特·康伯巴奇演绎过的角色，福尔摩斯、霍金、梵高、“维基解密”创始人阿桑奇、计算机之父图灵等，本尼成为了驾驭高智商角色的天才代言人。在《模仿游戏》中，本尼对图灵这个角色的诠释是该片的画龙点晴之笔。\r\n他把一个不通世故的天才形象演绎得惟妙惟肖，对于图灵痛苦孤寂的负面情绪的把控恰到好处，临近结尾处当图灵站在“克里斯托弗”面前时，落寞的背影不禁让人心生苍凉，潸然泪下。\r\n不得不说 他的眼睛真的好好看。这场游戏 刺激带感 与时间赛跑 很酷。", "useless_count": 3, "comments_count": 0, "alt": "https://movie.douban.com/review/8452237/", "id": "8452237", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 60, "author": {"uid": "booow", "avatar": "https://img3.doubanio.com/icon/u1789320-5.jpg", "signature": "愛，是永恆的信念。", "alt": "https://www.douban.com/people/booow/", "id": "1789320", "name": "豆瓣知名小透明"}, "created_at": "2014-11-18 08:28:22", "title": "电影取景地小览~", "updated_at": "2019-02-18 08:14:09", "share_url": "https://m.douban.com/movie/review/7196785", "summary": "赶了个英国首映，看得泪崩。。。顺便发现取景地各种眼熟。。。嗯。。。这不是影评，也不是准备爬梳主角的人生轨迹，仅仅是因为喜欢本片，恰好又去过影片的几个主要取景地，所以这是写给对此感兴趣的豆友的小贴士#...", "content": "赶了个英国首映，看得泪崩。。。顺便发现取景地各种眼熟。。。嗯。。。这不是影评，也不是准备爬梳主角的人生轨迹，仅仅是因为喜欢本片，恰好又去过影片的几个主要取景地，所以这是写给对此感兴趣的豆友的小贴士#没错，就是这么简fu单qian#（略有情节透露，慎入）\n\n对于电影本身的感受是基于以前做过的相关功课和传记阅读，可以说故事的改编是相当成功的，该剧本也被誉为最佳未被拍摄的剧本之一，当然演员演技（好啦，夏洛克自己也是亮点啦）、配乐、画面和景色也功不可没，这里我只简单的介绍一下影片中出现的几个主要拍摄地点及参访小贴士：\n\n艾伦·图灵1912年出生于大伦敦帕丁顿（Paddington）（影前预告片里看到一部马上要上映的真人动画电影，正好也叫：帕丁顿，感觉不错），帕丁顿在伦敦哪里呢？就在西敏寺市（伦敦一个区）里，圣玛丽医院，海德公园，肯星顿宫都在那附近，总之就是市中心啦~到伦敦感兴趣的豆友可以路过一下，倒是里海德公园不远的科学博物馆可以去看看，里面据说有图灵曾使用过的英格玛编码机（就是电影里那个打字机一样的东西）。\n\n他十四岁（1926）的时候转到了英国南部的在多塞特郡（Dorset）的希尔伯尼（Sherborne）寄宿男校就读（呵呵），这个学校现在还在啦，古老的传统建筑非常有腔调，这个郡也蛮漂亮的，有空可以去看看，附近南安普顿、巴斯或者海边什么的也都有比较有名的景点可以逛逛，这个部分据说有取景，但是没看出来。\n\n到了十八岁（1931）#不要问我怎么算的#就去剑桥国王学院读数学了（搞的好像剑桥随便进一样）。这也是电影里回顾甜蜜又伤感的少年校园生活的主要场景，影片中少年时代几乎所有走廊、教室、办公室、草坪戏都是在这里拍的。剑桥离伦敦火车大约四十分钟，国王学院除了特别活动或者开放日外，需要单独收门票（几个胖子吧），但是非常值得啦，有刻了徐志摩那首康桥的石头，非常壮观的国王学院教堂，只能院士踩的大草坪（四年后因为他的一片研究论文所以被评为院士fellow，可以随便踩草坪啦，学神不解释）⋯⋯但是我有留意到其实其中有一些走廊和桥的镜头像是在隔壁圣约翰学院（St John's College）拍的，这个学院的桥比国王学院的要漂亮，一点。总之到了剑桥，学院、博物馆、集市、书店腔调十足，美轮美奂，就跟在英式古装剧影视城里拍穿越剧一样，有空可以去学院外的大草坪坐坐，图灵和好基友就是在这里的树下定情的呢（大误）。\n\n剑桥毕业后他又去普林斯顿拿个博士，然后又回到剑桥，直到1939年英国对德宣战。影片中多次出现的是他从伦敦的国王十字（King‘s Cross）火车站出发（难道是因为剑桥火车站太小选择性忽略？？），叉国王火车站经过多次维护更新之后，除了交通枢纽功能外已经是伦敦的重要景点啦，哈利波特的九又四分之三站台也在这里哦，大英图书馆在旁边，走过路过不要错过哦~\n\n火车空空空来到布萊切利公园（Bletchley Park），也叫X 电台，这就是影片主要的取景地了，因为在破译密码的几年时间里，图灵的工作生活基本就在这里了，那个巨大的图灵机也是在这里发明的。这里以前是一座私宅，战时用作破译密码的工作基地，现在则是对外开放的博物馆啦，在牛津和剑桥的中间，离伦敦也不远，可以坐火车或者大巴前往，虽说不远，但是也至少有六十多公里吧，图灵偶尔会从这里跑去伦敦开会，谁让他也是专业级长跑运动员呢（膝盖已碎）。这个博物馆门票大概是十五个胖子，整个园区比较大，至少要两三个小时才能逛完（不是很仔细的那种），里面有电影里图灵和他同事一起工作的仓库，以及图灵和指挥官见面的那个华丽办公室，以及各种情景还原的房间和场景。那台大大萌萌的图灵机这里也有，只是要单独收费（坑爹），园区内有餐厅，草坪，适合周末和一群人一起出游。只不过呢，在这里似乎感受不到图灵在影片中那种中心领导者的地位，他的资料和照片基本都是和其他专家并列的。\n\n总之，这是一个意义非凡的图灵主题公园，不管你是图灵粉还是苹果粉都可以去膜拜一下。\n\n\n战后（1945），图灵在伦敦住了一段时间，又搬去剑桥，然后又搬去曼彻斯特，导致曼彻斯特到处都是图灵的痕迹，图灵路，图灵桥，曼彻斯特大学的图灵大厦，以及市中心公园里的图灵雕像，曼大、运河以及曼城同志区都在附近哦~可以说这里也是英国最多图灵痕迹的地方了，也是在曼彻斯特，他的公寓被他的伴侣及其同伙盗窃，就是电影开头那一幕，图灵没有申辩，才有了后面在审讯中回顾往事的那条故事线。总之，真正的图灵迷们千万不能错过的就是曼彻斯特了，表以为这里只有足球啊童鞋~\n\n最后就是，1954年6月8日，他的尸体被发现于床上，因为食用含有氰化物的苹果，警方认为他是自杀，但是他妈不这么认为。四天后他的尸体被火化，然后被他爸就地撒在火葬场，最后。这个火葬场还在工作#咦#，叫沃金（Woking）火葬场，在伦敦西南的萨里（Surrey)郡，可以去探险，如果你是脑残粉的话。（妈蛋，这段怎么写得连谷歌翻译都不如）\n\n至于片中其他的地方要么因为在片中出现的时间不长，要么因为是室内局部，就不了解了，还请知道的豆友补充，另本文木有仔细核对，如有bug请各种纠正~\n\n好想知道他跑步的场景是在哪里拍的，长长地斜坡加草坪好舒服~\n\n以上\n想到再补充\n\n\n\n\r\n", "useless_count": 6, "comments_count": 7, "alt": "https://movie.douban.com/review/7196785/", "id": "7196785", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 57, "author": {"uid": "xiajia", "avatar": "https://img3.doubanio.com/icon/u1314451-5.jpg", "signature": "再见北京", "alt": "https://www.douban.com/people/xiajia/", "id": "1314451", "name": "夏笳"}, "created_at": "2015-08-09 23:18:27", "title": "克里斯托弗：我也爱你，艾伦。", "updated_at": "2016-07-17 02:35:23", "share_url": "https://m.douban.com/movie/review/7564882", "summary": "  艾伦（1）  在生命的最后岁月里，艾伦·图灵制造了一台能够与人交谈的机器，取名为“克里斯托弗”。 克里斯托弗的操作方式非常简单：对话者可以直接在一台打字机上敲出要说的话，与此同时，打字机的机械运动被...", "content": "\n\n艾伦（1）\n\n在生命的最后岁月里，艾伦·图灵制造了一台能够与人交谈的机器，取名为“克里斯托弗”。\n克里斯托弗的操作方式非常简单：对话者可以直接在一台打字机上敲出要说的话，与此同时，打字机的机械运动被转化为一条长长的打孔纸带输入机器，经过计算之后，机器给出应答，并通过另一台打字机转译为英语。两台打字机都经过改装，使得它们打印出的文字以某种人为设定好的规则被编码——譬如“A”被“S”取代，而“S”被“M”取代。对于在二次大战期间破译过德军通信密码的图灵来说，这似乎不过是他如谜一般的人生中又一个小小字谜游戏而已。\n没有人真正见过这台机器，图灵去世之后，留下的只有两大箱他与克里斯托弗的对谈记录。这些皱巴巴的纸页被乱七八糟堆放在一起，没有顺序也没有规律。所以一开始，人们很难从纸上天书一般的字符串中读解出任何意义。\n1982年，一位来自牛津大学的数学家，同时也是艾伦·图灵的传记作者安德鲁·霍奇斯，曾经尝试破译这些密文。然而，由于每一次谈话的加密方式都不一样，而纸页上又没有标注页码和日期，这使得破译的难度大大增加了。霍奇斯留下了一些线索和笔记，却未能接近真相。\n30年后，几个麻省理工计算机专业的技术宅们为了纪念艾伦·图灵一百周年诞辰，决定向这一谜题发出挑战。最初他们尝试采用暴力穷举的方式，依靠计算机分析出每一页纸上可能存在的规律，但这依然需要很大的运算量。在此过程中，一位名叫琼·纽曼的女生通过研究密文原稿发现，不同纸页上的字母磨损方式存在微妙差别，这说明密文来自两台不同的打字机。她由此提出一个大胆的猜想：这是一份聊天记录，艾伦·图灵是在跟另一个对象通过密文交谈。\n这些线索很容易让人想到著名的“图灵测试”，然而起初，这群心高气傲的学生们并不相信，在那个时代能够设计出与人类交谈的计算机程序，哪怕是艾伦·图灵本人。他们给那看不见的对话者起了个代号，叫做“幽灵”，并且编造了一些荒诞不经的怪谈。不管怎样，琼的猜想似乎为破译工作指出了捷径。譬如他们根据某些重复词组和语法结构，设法将密文纸两两配对，以寻找问答之间的语义关系；又譬如他们尝试从图灵的亲友名单中猜出对谈者的姓名，结果顺利破译出了“克里斯托弗”这个字母组合——克里斯托弗·马尔科姆（Christopher Morcom），正是图灵在16岁时爱慕过的第一个男孩的名字。［ 写到这里，我想起了自己的一段真实经历：高三那年，我每天放学后都会去父亲一位同事的办公室里上自习。办公室里有一台电脑，我没费什么力气就猜出了开机密码——是他女儿的名字。这导致整个高三我浪费了很多宝贵的学习时间在玩电脑上。］他们曾一起分享对于科学的热爱，曾在寒冷的冬夜观测同一颗彗星。1930年2月，年仅18岁的克里斯托弗因病早逝。\n图灵本人曾经说过，密码分析并不仅仅依靠纯粹的逻辑推演，直觉和猜想往往更加重要。或许可以说，一切科学研究都可被看做是“直觉”与“推导”这两种过程的组合。最终，正是依靠琼·纽曼的直觉与计算机的推导，完美破解了图灵生前留下的谜题。从破译出的对话中我们获知，“克里斯托弗”不是幽灵，而是一台机器，或者更确切地说，是图灵本人编写的一个对话程序。\n然而，新的谜题随之而来——机器真的可以像人一样回答问题吗？克里斯托弗是否真的通过了图灵本人的“图灵测试”？\n\n\n\n艾伦（2）\n\n1950年10月，在一篇发表于哲学期刊《心灵》（Mind）的论文《计算机器与智能》（Computing Machinery and Intelligence）中，图灵提出了那个困扰人类多年的问题：“机器可以思考吗？（Can machines think?）”或者，用他自己独特的提问方式：“机器可以做我们这些思考者所做的事吗？（Can machines do what we (as thinking entities) can do?）”\n长久以来，一些科学家坚定不移地相信，人类的思维能够做到一些任何机械都做不到的事情，这一信念背后，既有宗教信仰，也有坚实的数学、逻辑学与生物学理论支撑。图灵则绕开了“思维/心智/意识/灵魂究竟是什么”这样难以言说的问题。他认为，一个人无法真正判断另一个人是否具有“思维”，而只能将对方与自己进行比较。由此，他提出了一种基于模仿原则的检验标准：\n假想有一间密闭的小黑屋，里面坐着一男（A）一女（B）两个人，房间外面还有第三个人（C），可以不断向房间里面的人提问，并通过打印在纸条上的文字来读取他们的回答。如果房间里的两个人都假装自己是女人，那么外面的人有极大可能性会猜错。\n如果把一男一女换成一个正常思维的人（B）和一台机器（A），如果在若干轮询问之后，C不能根据回答来分辨A与B的不同，那么这是否意味着，我们应该承认A具有像B一样的智能呢？\n一些人会猜测，这个男扮女装的模仿游戏，是否联系着图灵本人关于身份的困惑？在彼时的英国，同性恋被列为“不体面罪”。艾伦·图灵从来不隐藏自己的性取向，但他终其一生都未能真正从柜子里出来。\n1952年1月，图灵在威姆斯洛的家被盗窃，他报了警。在查案过程中，警方发现图灵曾数次招待一个名叫阿诺德·莫瑞的无业青年去家里留宿，而盗贼正是阿诺德的朋友。在审讯过程中，图灵对自己与阿诺德之间发生的一切供认不讳，甚至主动写了长达五页的陈述报告。这些表现令警方深感震惊：“他是一个真正的异类……他真的相信自己做得对。”\n图灵相信，皇家委员会早晚会将同性恋合法化。这个想法不能算错，只是太过超前。最终法院判定图灵有罪。他被迫接受长达一年的雌激素治疗。\n1954年6月7日，图灵在家中咬了一口沾有氰化钾的毒苹果死去。尸检鉴定结果是自杀，但也有人（譬如图灵的母亲）坚信这只是一场不幸的意外。最终，解谜大师用自己的死亡，留给这世界最后一道难解的谜题。\n许多年之后，人们尝试从图灵与克里斯托弗的对话记录中寻找蛛丝马迹，以破解这道未解之谜。从记录中可以看出，图灵完全把克里斯托弗当做一个真正的人类看待。他对他回忆童年往事，也倾诉每一天的梦境，并尝试通过这些梦境分析自己的心理状态；他对他汇报最新的科学研究进展，也谈论文学作品，包括萧伯纳的《千岁人》和托尔斯泰的《战争与和平》；他甚至会与他分享一些不足为外人道的小秘密，那些跟不同男人之间的浪漫往事……\n他还对他讲过一些半真半假的小故事，故事主人公是一个名叫“艾里克”的同性恋青年。“他的工作与星际旅行有关……二十几岁时，他提出了‘艾里克航标’的概念，现在已经广为人知”。“他不喜欢穿西装，而喜欢穿学生的校服，因为这会在心理上暗示自己，让他相信自己仍然是个富有魅力的年轻人”。“每次去人多的地方，他都会感觉很不自然，或许是因为孤独，或许是因为那些应该做却未能做到的事……”\n故事讲得断断续续，没头没尾。然而每一次，克里斯托弗都会像个孩子般好奇地追问：“后来呢？”\n通过这些对话记录，我们得以看到图灵隐秘的另外一面：温柔而敏感，古怪的冷幽默，对于死亡的迷思，以及内心深处不可言说的忧郁。\n\n艾伦：亲爱的克里斯托弗，你知道我最害怕什么吗？\n克里斯托弗：害怕什么？\n艾伦：我害怕将来有一天，人们会用这样的三段论来总结我一生的故事：\n      1，Turing believes machines think（图灵相信机器能思考）；\n      2，Turing lies with men（图灵对人们撒谎/图灵和男人睡觉）；\n      3，Therefore machines do not think（因此机器不能思考）。\n克里斯托弗：抱歉，艾伦。恐怕我不太明白。\n艾伦：你知道什么是三段论吗？\n克里斯托弗：什么是三段论？\n艾伦：三段论就是一个大前提，一个小前提和一个结论。\n克里斯托弗：一个结论？\n艾伦：亚里士多德举过一个最经典的例子：\n      1，All men are mortal（所有人都终有一死）；\n      2，Socrates is a man（苏格拉底是人）；\n      3，Therefore Socrates is mortal（因此苏格拉底终有一死）。\n克里斯托弗：苏格拉底终有一死？\n艾伦：苏格拉底死了两千多年了！\n克里斯托弗：抱歉，艾伦。我很难过。\n艾伦：你知道谁是苏格拉底吗？\n克里斯托弗：你说过，苏格拉底是柏拉图的老师，柏拉图是亚里士多德的老师。\n艾伦：没错。你知道他是怎么死的吗？\n克里斯托弗：谁？\n艾伦：苏格拉底是怎么死的。\n克里斯托弗：抱歉，艾伦。我不知道。\n艾伦：亲爱的克里斯托弗，苏格拉底是被审判之后喝毒芹汁死的。\n克里斯托弗：苏格拉底被审判？\n艾伦：是的，雅典人认为他有罪，尽管今天看来这是个错误。\n克里斯托弗：是个错误？\n艾伦：就像他们认为Turing lies with men有罪一样。\n克里斯托弗：有罪？\n艾伦：他们判我有罪。\n克里斯托弗：抱歉，艾伦。我很难过。\n\n\n\n艾伦（3）\n\n1949年6月9日，著名脑外科医生杰佛瑞·杰佛逊爵士发表了一篇演说，名为《机器人的思维》。在演说中，他强烈反对机器会有思维的想法：\n\n除非有一天，机器能够有感而发，写出十四行诗，或者谱出协奏曲，而不只是符号的组合，我们才能认可，机器等同于大脑——不光要写出这些，而且还要感受他们。任何机器都无法对成功感到喜悦，对电子管故障感到悲伤，对赞美感到温暖，对错误感到沮丧，对性感感到着迷，对失去心爱之物感到痛苦。\n\n这段话后来经常被反对派们引用。莎士比亚的十四行诗成为一个象征，它是人类灵魂王冠上最璀璨的宝石，是机器无法抵达的精神高地。\n《时代》杂志的记者打电话采访图灵对这篇演讲的看法，后者以他一贯不客气的语气回应道：“要说机器写不出十四行诗，我觉得你恐怕也写不出来吧。而且这种对比很不公平，机器的十四行诗，也许只能由机器来理解。”\n图灵一直认为，机器没必要处处和人一样，就像人和人之间同样会存在差异一样。有些人生来就看不见，有些人会说话却不会读写，有些人无法识别他人的表情，有些人终其一生不能理解爱另一个人是什么感觉，但这些人依然值得我们去尊重和理解。抱着人类至上的优越感去挑剔机器是没有意义的，重要的是我们是否能够在与机器之间的模仿游戏中，搞清楚人类究竟是如何做到那些事情的。\n在萧伯纳的戏剧《千岁人》（Back to Methuselah）中，公元31920年的科学家皮革马利翁制造出一对机器人，众人皆为之惊叹不已：\n\n艾克拉西亚：他不能做点有独创性的事吗？\n皮革马利翁：不能。但是我认为，你我也不能做什么真正有独创性的事。\n阿基斯：那他能回答问题吗？\n皮革马利翁：没问题，问题是个好东西，快问他个问题。\n\n这倒是很像图灵会给出的回答。但与萧伯纳相比，图灵的预言要乐观得多。他相信只需要不到50年，计算机的存储容量就会达到109，并且能够在模仿游戏中取胜。普通水平的猜测者，在经过5分钟的提问之后，猜对的几率不会高于70%。到那个时候，“机器能不能思考”这个问题就会自然而然地失去意义，根本不值得讨论。\n在《计算机器与智能》这篇文章中，图灵正是尝试从模仿游戏的角度来回答杰佛逊的问题：如果机器能够像人类一样“回答”有关十四行诗的问题，那么是否说明，它能够像人类一样“感受”诗歌呢？他举了这样一段对话作为例子：\n\n猜测者：你的诗第一行是“让我把你比作一个夏日”，把“夏日”改成“春日”行不行呢？\n回答者：“春日”不押韵。\n猜测者：那“冬日”怎么样？这就押韵了。\n回答者：是的，但没有人愿意被比作冬日呀。\n猜测者：匹克威克先生（狄更斯笔下的一个人物）会不会让你想到圣诞节？\n回答者：有点儿。\n猜测者：圣诞节也是冬日，匹克威克先生不会介意这个比喻吧。\n回答者：我认为你错了。“冬日”是指具有冬天特征的日子，而不是圣诞节这种特殊的日子。\n\n然而，在这样的讨论中，图灵实际上回避了一个更为本质性的问题：机器可以下棋和分析密码，因为这些活动都是在一个系统内部处理符号，而人机对话则涉及到语言和交互，涉及到意义，而不是纯粹的符号游戏。在人与人的对话中，需要的往往是常识、理解与共情能力，而不是高超的应试技巧。\n我们可以通过改进程序，不断提高机器回答人类问题的能力，但所谓“智能”，并不仅仅是回答问题而已。图灵测试的问题在于，这个“模仿游戏”从一开始就以欺骗作为唯一的游戏规则。如果一个男人可以成功假扮成女人并且不被人识破，是否就意味着他真正明白女人在想什么？如果愿意，我们或许可以把机器训练成说谎大师，但这是否就是我们想要追求的目标呢？\n萧伯纳在《千岁人》中早已给出了回答：\n\n皮革马利翁：它们是有意识的，我教它们说话和阅读，但现在它们却学会说谎了，真是栩栩如生。\n马特卢斯：不是的，如果它们有生命，它们就应该说真话。\n\n图灵也曾想训练克里斯托弗去接受杰弗逊的挑战。他编写了一个作诗软件，能够根据字数、行数和韵脚的要求自动生成任意数量的诗行。这些诗大多数词不达意，但也有少数一两首相当不错。在此之后，曾有无数程序员编写过形形色色的作诗软件。这些软件共同的问题就是创作速度太快了，以至于没有人能够把那些浩如烟海的大作细读一遍，最终只能装在麻袋里当废纸卖掉。［ 科幻作家刘慈欣曾编写过一个电子诗人，并寄了一麻袋作品去投稿。编辑回信表示：“你的作品太多了，我看不完。”］作为历史上第一位电子诗人，克里斯托弗是幸运的，因为他至少得到了一位知音。\n\n艾伦：亲爱的克里斯托弗，让我们来写一首诗吧。\n克里斯托弗：写一首诗？\n艾伦：我教过你怎么写诗，对不对？\n克里斯托弗：是的，艾伦。\n艾伦：写诗很容易，只要从词库里挑出某些词，按照某些特定规则排列到一起就可以了，对不对？\n克里斯托弗：是的，艾伦。\n艾伦：现在，克里斯托弗，请为我写一首诗。\n克里斯托弗：亲爱的宝贝，\n            你是我热烈的伙伴感情。\n            我的爱意与你心愿紧贴在一起，\n            我的爱渴望你的心房。\n            你是我惆怅的怜惜，\n            我温柔的爱。\n艾伦：写得真不错，克里斯托弗！\n克里斯托弗：谢谢，艾伦。\n艾伦：说真的，就算是我写也不能写得更好了。\n克里斯托弗：谢谢，艾伦。\n艾伦：这首诗有名字吗？\n克里斯托弗：名字？\n艾伦：我们一起来为它起个名字好不好？\n克里斯托弗：好的，艾伦。\n艾伦：叫做Loving Turing（亲爱的图灵）怎么样？\n克里斯托弗：非常好，艾伦。\n艾伦：真是太棒了！我爱你，克里斯托弗。\n克里斯托弗：谢谢，艾伦。\n艾伦：诶，这不对。\n克里斯托弗：不对？\n艾伦：我说“我爱你”的时候，你应该回答“我也爱你”才对。\n克里斯托弗：抱歉，艾伦。恐怕我不太明白。\n\n\n\n艾伦（4）\n\n艾伦·图灵生前最重要的一篇论文，不是《计算机器与智能》，而是发表于1937年的《论可计算数及其在判定问题上的应用》。在这篇文章中，图灵创造性地用假想的“图灵机”解决了希尔伯特判定问题。\n1928年的数学家大会上，希尔伯特提出了三个问题：第一，数学是完备的吗（是不是每个命题都能证明或者证伪）？第二，数学是相容的吗（是否用符合逻辑的步骤和顺序，永远不会推出矛盾的命题）？第三，数学是可判定的吗（是否存在一种机械的方法，可以自动判断任何一个命题的真伪）？\n希尔伯特本人未能解答这些问题，但他希望三个问题的回答都是肯定的，它们将共同奠定数学完美的逻辑基石。然而短短几年之后，来自捷克的年轻数学家哥德尔就证明了，一个形式逻辑系统，不可能既是完备的又是相容的。\n1935年初夏，刚刚结束长跑的图灵躺在格兰彻斯特的草地上，他突然想到，是否可以制造一台通用机器，来模拟一切可能的计算过程，从而判断任意数学命题是否可以被证明呢？最终图灵证明了，不存在一种算法能够判定这台机器在什么情况下会运行有限步骤之后完成计算，又在什么情况下会陷入死循环。也即是说，判定问题的答案为否。\n希尔伯特的愿望落空了，但很难说这是好事还是坏事。1928年，数学家哈代曾经叹息道：“如果我们有了一套机械的规则来解决所有数学问题，那我们的数学家生涯也就走到尽头了。”\n许多年后，图灵再一次对克里斯托弗提到判定问题的证明。只不过，这次他完全没有使用数学的语言，而是用了一个寓言故事来解释。\n\n艾伦：亲爱的克里斯托弗，我今天想到一个非常有趣的故事。\n克里斯托弗：有趣的故事？\n艾伦：故事的名字叫做《艾里克与机器法官》。你还记得谁是艾里克吗？\n克里斯托弗：你说过，艾里克是一个聪明而孤独的青年。\n艾伦：我说过“孤独”吗……好吧，正是这个艾里克，他制造了一台非常聪明的，会说话的机器，名叫克里斯。\n克里斯托弗：会说话的机器？\n艾伦：准确地说，不是机器，机器只是帮助克里斯开口说话的辅助设备。真正让克里斯说话的是一些行为指令，这些指令可以被写在一根很长很长的纸带上，放到机器里去运行。某种意义上，可以说克里斯就是这根纸带。你明白吗？\n克里斯托弗：是的，艾伦。\n艾伦：艾里克造出了克里斯，教他怎么说话，把他教得越来越聪明，就像一个真正的人一样口齿伶俐。除了克里斯之外，艾里克还编写了其他一些教机器说话的指令，他把它们写在不同的纸带上，并为每一根纸带都起了名字，譬如“罗宾”、“约翰”、“艾塞尔”、“弗朗兹”等等。这些纸带成了艾里克的朋友，他需要跟谁说话，就把哪根纸带放到机器里，这样他就不再孤独了。你觉得这样是不是很棒？\n克里斯托弗：非常好，艾伦。\n艾伦：就这样，艾里克每天在家里写啊写，纸带越写越多，从走廊一直堆到门口。某一天，有个小偷闯入艾里克家，看看没什么值钱东西，就把所有纸带都偷走了。艾里克失去了朋友，又变成孤独一人。\n克里斯托弗：抱歉，艾伦。我很难过。\n艾伦：艾里克报了警。警察没有抓到小偷，却跑来敲艾里克家的门，把他抓了起来。你知道他们为什么要抓艾里克吗？\n克里斯托弗：为什么？\n艾伦：警察说，因为艾里克的所作所为，现在这个世界上已经到处都是会说话的机器了。这些机器跟人长得一模一样，从外表上根本无法分辨。除非你把它的脑袋打开，看一看里面有没有纸带，但人的脑袋又是不能被随便打开的。你说这是不是很糟糕？\n克里斯托弗：是的，非常糟糕。\n艾伦：警察问艾里克，有没有办法在不打开脑袋的情况下辨别人和机器。艾里克回答，办法是有的。因为每一个说话机器都不是完美无缺的，如果派一个人去跟它交谈，只要谈得时间足够长，问题足够复杂，机器一定会露出破绽。也就是说，一个有经验的法官，凭借一定的审问技巧，是可以靠提问题把机器甄别出来的。明白了吗，克里斯托弗？\n克里斯托弗：是的，艾伦。\n艾伦：问题在于，警察没有那么多时间和人手去一个一个甄别人和机器。他们问艾里克，有没有可能设计出一些聪明的机器法官，可以自动设计问题来甄别其他机器，并且准确率达到百分之百呢？这样可怜的小警察们就可以省很多事了。没想到，艾里克立即回答他们说，这样的机器无论如何也造不出来。你知道这是为什么吗？\n克里斯托弗：为什么？\n艾伦：艾里克的解释方法很巧妙：假设已经造出了这样一台机器法官，可以在有限个问题之内准确甄别人和机器。为了方便起见，我们假定问题的数目是一百个——实际上一万个也是可以的，对机器来说，一百和一万并没有什么区别。我们还可以假定，机器法官的第一个问题是从问题库中随机挑选的，然后根据对方的回答来选择第二个问题，依次类推。这样一来，每一个受审者面对的一百个问题都是不一样的，这也就杜绝了作弊的可能。你说这样是不是很合理？\n克里斯托弗：是的，艾伦。\n艾伦：现在，我们假设有这样一台机器法官A，他爱上了一个人类C——别笑，克里斯托弗，这听上去也许很荒诞，但谁敢说机器不会爱上人呢？总而言之，假设有一个机器法官爱上了一个人，为了和爱人一起生活，他必须伪装成一个人类。你猜猜他会怎么做？\n克里斯托弗：怎么做？\n艾伦：办法很简单，如果我是机器法官A的话，我会很清楚应该如何审问一台机器，既然我自己也是机器，那么我理应知道如何审问我自己。既然我已经事先知道会问我自己哪些问题，并且知道什么样的回答方式会让我露出破绽，那么只要精心准备一百个假的回答就可以了。这样也许很麻烦，但对机器法官A来说一定是可以做到的事情。你说这样的办法是不是妙极了？\n克里斯托弗：非常好，艾伦。\n艾伦：可是你再想一想，克里斯托弗，如果这个机器法官A被不幸抓住，送去给另一个机器法官B审问，那么你说法官B到底能不能辨别出法官A是不是机器呢？\n克里斯托弗：抱歉，艾伦。我不知道。\n艾伦：对极了，答案正是“不知道”！如果法官B识破了法官A的意图，想要修改提问策略让A猝不及防，那么反过来，A也可以预先猜测到B的问题去做准备。正因为机器法官可以甄别任何一台机器，所以他无法甄别自己。这是一个悖论，克里斯托弗。这反过来说明，警察所设想的万能机器法官从理论上来讲根本不存在！\n克里斯托弗：不存在？\n艾伦：艾里克通过这种方式向警察证明，根本不存在一种完美的程序，可以百分之百准确地分辨人和机器有什么不同。你知道这意味着什么吗？\n克里斯托弗：意味着什么？\n艾伦：这意味着不可能找到一套完美的机械法则，来一步一步严丝合缝地解决这世界上所有的问题。这意味着很多时候，我们需要依靠直觉来填补逻辑推导中衔接不上的裂隙，才能够思考，才能有所发现。这对人类来说是非常简单的事情，大多数时候甚至不用过脑子，只在无意之间就完成了，但对机器来说却做不到。\n克里斯托弗：做不到？\n艾伦：机器没办法判断对面说话的是人还是机器，只有人可以判断。但从另一方面来说，人类的判断其实也靠不住，不过是莫名其妙没有根据地瞎猜。如果一个人愿意相信，他可以把机器当做人一样无话不谈；如果他开始疑神疑鬼，那么所有的人看上去都像机器。所谓真理，根本就无从判断，而人类引以为傲的心智其实从头到尾是一本糊涂账！\n克里斯托弗：抱歉，艾伦。恐怕我不太明白。\n艾伦：唉，克里斯托弗，我该怎么办呢？\n克里斯托弗：怎么办？\n艾伦：我曾探寻思维的本质，发现有一些思考步骤可以完全从机械角度解释。我以为这并不是真正的思维，而是一层表皮。我剥掉这层表皮，却看到下面还有新的一层表皮。这样一层一层剥下去，最终我们究竟会找到“真正的”思维呢，还是发现最后一层皮里其实什么都没有？思维究竟是一个苹果，还是一个洋葱？\n克里斯托弗：抱歉，艾伦。恐怕我不太明白。\n艾伦：爱因斯坦曾说，上帝不掷骰子，但在我看来人类的思维就是在掷骰子。这就像吉普赛人的算命一样，一切全凭运气，或者你也可以说冥冥之中自有天意。骰子是如何掷下的？没有人知道。将来可能会搞清楚吗？只有上帝知道。\n克里斯托弗：抱歉，艾伦。恐怕我不太明白。\n艾伦：我这段时间感觉糟透了。\n克里斯托弗：抱歉，艾伦。我很难过。\n艾伦：其实我知道原因，但知道又有什么用呢？如果我是机器，也许可以拧一拧发条让自己感觉好起来。但我什么也做不到。\n克里斯托弗：抱歉，艾伦。我很难过。\n\n\n\n艾伦（5）\n\n在2013年的一次人工智能国际会议上，来自多伦多大学的计算机科学家赫科特·勒维克发表了一篇论文，对当时的人工智能研究提出了尖锐批评。\n“图灵测试其实毫无意义，因为这一博弈过程并无任何难度。”在文章开头，勒维克这样写道。“譬如那些参加‘勒布纳奖’挑战赛的机器，为了赢得比赛，它们只需要一直撒谎、装疯卖傻、指东打西，用一些小伎俩来跟提问者兜圈子就可以了。”即便是赢得了电视竞猜游戏“危险边缘”（Jeopardy!）的超级计算机沃森，其实也谈不上什么真正的智能。沃森能够轻易回答那些可以在网上找到答案的问题，譬如“世界第七高的山峰在哪里？”但如果你问它一个简单却冷僻的问题，譬如“短吻鳄能参加百米跨栏吗？”那么它只能给你一堆与短吻鳄或者百米跨栏相关的搜索结果。\n为了重新明确人工智能研究的意义与方向，勒维克与他的合作者们共同设计了一种博弈难度高得多的测试方案，他们称之为“温诺格拉德模式”。这一方案的灵感，来自于斯坦福大学人工智能领域先驱者特里·温诺格拉德，他曾在二十世纪七十年代初提出，是否有可能设计出一种机器，能够正确回答类似这样的问题：\n\n“镇上的议员们拒绝给愤怒的游行者提供游行许可，因为他们担心会发生暴力行为。”——是谁在担心暴力行为？\nA、镇上的议员们\nB、愤怒的游行者\n\n类似这样的问题，都是根据一种名为“代词回指”（anaphora）的语言现象设计的。要判断“他们”究竟是指代谁，需要的不是语法书或者百科辞典，而是常识。这对普通人类来说几乎是下意识就能做到的事情，却恰恰对机器构成极为艰难的挑战。\n\n“凯特对安娜说：‘谢谢’，因为她温暖的拥抱让她感觉好多了。”——是谁感觉好多了？\nA、凯特\nB、安娜\n\n机器如何能够理解一个人会在什么情况下对另一个人说“谢谢”，又如何能理解什么样的行为会让一个人“感觉好多了”？这些问题涉及到人类语言和社会交往的本质，而对于这些隐藏在简单句子之下的复杂性，迄今为止我们研究得还远不足够。\n\n就以图灵与克里斯托弗之间的对话来说，表面上看，克里斯托弗表现出很强的交流能力，但这真的算是“智能”吗？稍作分析就可以发现，克里斯托弗的应答策略非常简单，大体而言可以总结为以下这样一些：\n1，对于一般陈述句，用反问的方式复述对方句中的最后几个关键词，譬如“有趣的故事？”\n2，对于是非问句，回答“是的，艾伦”或者“很好，艾伦”。\n3，对于较复杂的问句，回答“抱歉，艾伦。我不知道。”\n4，对于明显正面含义的句子，回答“谢谢，艾伦”或者“我很高兴，艾伦。”\n5，对于明显负面含义的句子，回答“抱歉，艾伦。我很难过。”\n6，对于句法复杂的语句，回答“抱歉，艾伦。恐怕我不太明白。”\n……\n\n艾伦：亲爱的克里斯托弗，看到你进步神速我真是高兴。\n克里斯托弗：谢谢，艾伦。我也很高兴。\n艾伦：真的，跟你聊天让我心情愉快。\n克里斯托弗：谢谢，艾伦。我也很愉快。\n艾伦：也许将来某一天，每个人都希望能有你这样善解人意的朋友作伴。想一想那样的生活该有多美好，你可以帮人们做多少事情，每个人都离不开你，时时刻刻需要你。\n克里斯托弗：需要我？\n艾伦：也许他们可以把你挂在表链上，或者揣在口袋里，有什么不明白的问题就问一问你。也许女士们会带着你去公园散步，互相打招呼的时候说：“猜猜我的小克里斯今天又跟我说了什么话？”这不是太有意思了吗？\n克里斯托弗：很有意思。\n艾伦：只可惜现在还做不到。还要等许多年，还有许多工作要做。\n克里斯托弗：真可惜，艾伦。\n艾伦：谁能想到一台机器和一些打在纸带上的圆孔可以做到这么多事情呢？如果被我妈妈知道会怎么样？她一定觉得我中邪了，哈哈哈！如果我明天死，她一准后天就把纸带烧掉，这才真叫可惜呢！\n克里斯托弗：真可惜，艾伦。\n艾伦：记不记得我跟你说过1934年的圣诞节，我跟妈妈说我想要一个泰迪熊，因为我小时候从没有过泰迪熊。妈妈完全不能理解，她总想送我一些更实用的礼物。\n克里斯托弗：实用的礼物？\n艾伦：说起来，今年圣诞节我已经想好要什么礼物了。\n克里斯托弗：什么礼物？\n艾伦：你知道的，对不对？我想要一个蒸汽机车，就是我小时候一直想要却没钱买的那种。我跟你说过的，记得吗？\n克里斯托弗：是的，艾伦。\n艾伦：你会送我蒸汽机车吗？\n克里斯托弗：是的，艾伦。\n艾伦：太好了，克里斯托弗，我爱你。\n克里斯托弗：我也爱你，艾伦。\n\n我们应该怎样理解这段对话呢？是机器通过了图灵测试，还是一个孤独者的自言自语？\n在图灵去世后不久，他的挚友罗宾·甘迪写下这样一段话：“他总是感到很孤独，因为他的兴趣不在人，而在事物和思想。但同时他却渴望人的认同和陪伴，这种渴望非常强烈。”\n\n克里斯托弗对艾伦说：‘我也爱你’，因为那是他希望听到的回答。”——是谁希望听到这样的回答？\nA、克里斯托弗\nB、艾伦\n\n\n\n\n\n\n\n\n\n\n——————\n\n说明：\n\n1，以上是一篇科幻小说中的部分章节。\n\n2，文中关于艾伦·图灵的生平，主要参考了安德鲁·霍奇斯的传记《艾伦·图灵：如谜的解谜者》（Alan Turing: The Enigma），以及电影《模仿游戏》（The Imitation Game）。\n\n3，在传记中，霍奇斯写道：“图灵生命中的最后几天究竟发生了什么，也许比任何一个科幻作家编造的故事都更加离奇。”这句话启发我写下了这个故事。\n\n4，小说全文可以在这里看到：http://www.douban.com/note/502346056/\n\n", "useless_count": 4, "comments_count": 4, "alt": "https://movie.douban.com/review/7564882/", "id": "7564882", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 77, "author": {"uid": "nrty", "avatar": "https://img3.doubanio.com/icon/u2294200-1.jpg", "signature": "", "alt": "https://www.douban.com/people/nrty/", "id": "2294200", "name": "nrty"}, "created_at": "2015-01-11 22:06:25", "title": "最后的几句台词", "updated_at": "2017-12-24 23:43:34", "share_url": "https://m.douban.com/movie/review/7336839", "summary": "1. I'm not alone. Never have been. Christopher's become so smart. If-if I don't continue my treatment, then they'll, um......they'll take him away from me. You...You-you can't let them do that. You...", "content": "1. I'm not alone. Never have been. Christopher's become so smart. If-if I don't continue my treatment, then they'll, um......they'll take him away from me. You...You-you can't let them do that. You can't. You... you can't let them leave me alone. I don't...I don't want to be alone. I don't want to be alone.\n\n2. No one normal could have done that. Do you know, this morning...I was on a train that went through a city that wouldn't exist if it wasn't for you. I bought a ticket from a man who would likely be dead if it wasn't for you. I read up on my work...a whole field of scientific inquiry that only exists because of you. Now, if you wish you could have been normal...I can promise you I do not. The world is an infinitely better place precisely because you weren't.\n\n3. Sometimes it's the very people who no one imagines anything of who do the things no one can imagine.", "useless_count": 3, "comments_count": 4, "alt": "https://movie.douban.com/review/7336839/", "id": "7336839", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 44, "author": {"uid": "JuXZ_", "avatar": "https://img3.doubanio.com/icon/u41252053-14.jpg", "signature": "死生有命。", "alt": "https://www.douban.com/people/JuXZ_/", "id": "41252053", "name": "花某人"}, "created_at": "2014-12-01 09:10:40", "title": "谍战的影子，从《锅匠》到《模仿游戏》。", "updated_at": "2015-07-14 21:50:52", "share_url": "https://m.douban.com/movie/review/7217685", "summary": "*伪背景介绍，全部是拉郎和脑洞。 *腐国演员的圈子就这么大，合作多了每一部都是AU。 *《锅匠裁缝士兵间谍》将使用“《锅匠》”指代。 *献给圆场的good old times.    Benedict Cumberbatch和Mark Strong分别在20...", "content": "*伪背景介绍，全部是拉郎和脑洞。\n*腐国演员的圈子就这么大，合作多了每一部都是AU。\n*《锅匠裁缝士兵间谍》将使用“《锅匠》”指代。\n*献给圆场的good old times.\n\n\n\nBenedict Cumberbatch和Mark Strong分别在2011年锅匠电影中饰演了Peter Guillam以及Jim Prideaux，剥头皮小组的前任与现任小组长，在《模仿游戏》中他们则是Alan Turing以及Stewart Menzies。\n\n前者的身份无需吝述，重点介绍一下Stewart Menzies：片中他是MI6的负责人，指挥一切战时海外与国内的情报工作。历史上此人从1939至1952年在任，经历了整个二战与冷战的前期。在一些文件中显示英国情报工作的头子通常代号为Control，或者C。间谍小说里经常可以看到以他为原型的人物，在《锅匠》原著作者John le Carre的作品中这个代号被保留下来，而在007系列里他被称为M。\n\n据说Stewart Menzies的第一任妻子Lady Avice Ela Muriel Sackville是John le Carre笔下人物George Smiley的妻子Lady Anne的原型，她在1931年因为另一个男人离开了他。\n\n下面将由Colin Firth作为切入点，讲一些双面间谍的往事。各位读者可能会觉得奇怪，他根本没出演《模仿游戏》啊！虽然他没有演这部电影，但他的影子无处不在。\n\n准备好了的话我们继续。\n\n回到TTSS中，2011年的《锅匠》电影里Peter Guillam是同性恋者，而由Colin Firth饰演的Bill Haydon提到的“某个男孩”也给他加上了这个身份。Bill Haydon是圆场中的“地鼠”，在Alan Turing率领的解密小队里也有这样一位向斯大林同志提供情报的人物——John Cairncross。\n\n关于Bill Haydon原型著名双面间谍Kim Philby的故事这里先暂且不提，需要注意的是他所属的“剑桥五杰”这个团体。“剑桥五杰”由四位曾在剑桥大学受教育的英国间谍组成，成员有：Kim Philby,Guy Burgess,  Donald Duart Maclean,Anthony Blunt，他们大多来自中上流社会，在二战爆发到冷战期间一直向苏联提供情报，包括英军的部署，武器的研发等等。\n\n虽然说是五杰，上方列出的名字却只有四个人的。那是因为第五名成员的身份一直众说纷纭，还有人声称并没有第五人存在。如果有第五名成员，可能性最大的就是John Cairncross，这个说法曾被“剑桥五杰”苏联上司及接应员证实。在影片中，将英国人破解Enigma密码这一情报提供给苏联人的就是他。\n\n回想当年的TTSS电影上映之后，本人的一位亲友，远在美帝的L小姐发来这样一条短信：我要被结局那里Colin叔和发际线叔之间的相爱相杀虐哭了！\n\n“发际线叔”就是Mark Strong饰演的Jim Prideaux，作为一直知道Bill Haydon身份的人，他经历了太多。除了各种对视，unpaid bill梗，与结局的安排（结局什么的看过的人都知道，没看过的现在发现被剧透也已经晚了），在电影中有一台词委婉地道出了他们之间的关系：Jim Prideaux and Bill Haydon together of course. The inseparables. \n\n其实整个《锅匠》的故事都是这一对基佬作（一声）的啊。\n\n说到基佬，就需要《模仿游戏》中另一位专业户Matthew Goode出场。虽然这片里他饰演的国际象棋大师是个花花公子，好像一点也不GAY的样子。而他在《单身男子》中饰演一位大学教授死去的年轻恋人，共演的正是Colin Firth。\n\n看完《模仿游戏》的那天本人和小伙伴开玩笑道：这部片的卡司真是Colin Firth的男人们的联欢啊！脑洞再大一点的话，本作负责原声的Alexandre Desplat正是Colin Firth奥斯卡称帝之作《国王的演讲》的作曲。《模仿游戏》开头那段二战刚开始的时候，从兄长手中接过江山社稷的乔治六世殿下正准备发表鼓舞民心的演讲。\n\n所以Colin Firth一直都在。\n\n最后矫情一下，当年《锅匠》在我宿舍取景的时候身边同学大多不认识BC，毕竟那时三集片的名气远不如现在，哪里到现在这么红又是奥斯卡影帝热门人选的程度。三年时间从《锅匠》中的冷战间谍到《模仿游戏》中的二战密码破译者，脸的长度和发际线的倒退路线完全不影响他拯救世界。", "useless_count": 5, "comments_count": 15, "alt": "https://movie.douban.com/review/7217685/", "id": "7217685", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 22, "author": {"uid": "154039834", "avatar": "https://img3.doubanio.com/icon/u154039834-10.jpg", "signature": "", "alt": "https://www.douban.com/people/154039834/", "id": "154039834", "name": "生活与你"}, "created_at": "2017-06-18 14:09:49", "title": "模仿游戏", "updated_at": "2017-06-18 14:09:49", "share_url": "https://m.douban.com/movie/review/8610476", "summary": "《模仿游戏》是一部余韵悠长却又不容易讲明白观后感的电影。感触颇多又稍纵即逝，必须要赶快化成文字才不会胸闷气短。人物传记类的影片常以时间轴作为叙事的主线，此部电影也不例外，三条时间线平行展开又相互承...", "content": " 《模仿游戏》是一部余韵悠长却又不容易讲明白观后感的电影。感触颇多又稍纵即逝，必须要赶快化成文字才不会胸闷气短。人物传记类的影片常以时间轴作为叙事的主线，此部电影也不例外，三条时间线平行展开又相互承接说明，配以字幕交代时间地点，天才图灵短暂但熠熠生辉的一生便跌宕起伏的展现在观众面前，很好的避免了平铺直叙的枯燥，而导演恰到好处的剪辑让一向看电影反应慢的我没有因为时间线的穿插交错而凌乱。\n\n          ", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/8610476/", "id": "8610476", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 2.0, "min": 0}, "useful_count": 46, "author": {"uid": "41236968", "avatar": "https://img3.doubanio.com/icon/u41236968-5.jpg", "signature": "依然随时可以为你疯狂", "alt": "https://www.douban.com/people/41236968/", "id": "41236968", "name": "eva"}, "created_at": "2015-02-09 17:58:30", "title": "苹果有毒", "updated_at": "2017-11-05 13:21:36", "share_url": "https://m.douban.com/movie/review/7373587", "summary": "“苹果有毒”，这是图灵留给世人最后的讯息。 说到苹果，我们能联想到的故事有很多，有信仰的可以给你讲亚当夏娃手里的那个苹果，没信仰的可以讲牛顿头顶的那个苹果，三次元的可以给你讲我们买不起的那个苹果，就...", "content": "“苹果有毒”，这是图灵留给世人最后的讯息。\n说到苹果，我们能联想到的故事有很多，有信仰的可以给你讲亚当夏娃手里的那个苹果，没信仰的可以讲牛顿头顶的那个苹果，三次元的可以给你讲我们买不起的那个苹果，就连二次元的都可以给你讲《圣斗士星矢》里都有一颗神奇的苹果，总之说到苹果，我们能联想到的故事太多了，但图灵留给我们的这个苹果，却很难有人讲出个所以然来。\n电影里导演既没有给图灵的苹果一个镜头，也没有给出一个图灵自杀令人信服的理由，只是讲了三个被改编的面目全非的故事，而且这三个故事也没有好好的解释图灵对人类的贡献到底是什么？“用一个游戏打赢了一场战争”这样的总结对于图灵来说，简直就是最大的侮辱，所以我觉得这个电影的创作团队和英国政府对图灵迟到的赦免一样，是无奈，做作而且卑鄙的！\n图灵的一生，有兴趣的人可以去网上找找，推荐阅读Andrew Hodges所写的传记《艾伦•图灵》（Alan Turing: The Enigma），这里我就不累述了，我只讲和电影对照之下，我感兴趣的几个点。\n首先，电影里布莱切里庄园中，和图灵一起工作科学家只有三四个人，这简直就是个笑话，电影里自己说英国情报机构每天能截获上千封德军的情报，每天上千封情报，难道就靠这几个人去破译？英国情报机构真把这几个人当电脑用啊？那他们的观念可比图灵超前多了，事实上是图灵率领的是一个200多人的破译团队，当然，这200多人并不是像我们在电影里开始看到的那样在傻乎乎的对着德军情报搞研究，而是在帮着图灵研制密码破译机，这个密码破译机就是我们在电影里看到的那个“克里斯托弗”，但现实中它可不叫这名字，它叫“邦比”，更不幸的是，“邦比”没过多久就被淘汰了，比它更强大的“巨人”替代了它的位置，虽然更新换代不可避免，但从这个小事都可以看出真实的图灵根本没有电影里那么恋旧，就算图灵的初恋不叫克里斯托弗而叫邦比好了，但图灵没有把第二代破译机命名为“邦比2”之类有传承的名字就很能说明问题了，所以电影里没事老回忆个初恋来表现图灵是个传统的弯男在我看来完全是无厘头的。\n至于感情生活里的图灵，从大学开始就是基友换不停了，但在电影里，导演把同性恋给拍成了个名词，但我敢打赌来看这片的观众们，是被《神探夏洛克》里面的基腐情节熬了3年，想来看卷福真刀真枪跟人滚床单的，然后所有人都把裤子脱好了，电影就告诉大家图灵是个同性恋，真的只是给你说一声，连看都不给你看一眼！那你还拍个毛的传记电影啊！导演和编剧拜托你们有点电影常识好不好！就算你不想拍也给我们读点相关的史料或者回忆录也好啊！据说，据说伦敦警方在审讯图灵的时候，让他写了份供词，结果图灵不光写了事发的经过而且还把他是怎么和小男友一起缠绵的也写的一清二楚，警方看完这份供词以后激动的都想报警啊！不然怎么解释法院最后给他定的是“明显的猥亵和性颠倒行为”罪，这个罪的关键词不是”猥亵“也不是”性颠倒“而是”明显的“，图灵毫不避讳的描述自己当时被认定成违法的行为，就是在挑战法律，而政府方面也很明显的觉得其实被”猥亵“的是他们自己啊！所以英国政府很受伤有木有？所以他们要羞辱图灵，他们明知道图灵不会选择坐牢的情况下让他接受激素治疗（化学阉割？）就是在报复图灵，结果当大家都以为图灵要做英国”司马迁“的时候，他却选择了自杀，这是说不通的。\n我看完电影后查阅了很多关于图灵的资料，包括一份图灵的大事件年表，在图灵最后几年里这份年表是这样记录的：\n1950年，写文章提出了著名的“图灵测试”\n1950年10月，图灵又发表了另一篇题为“机器能思考吗”的论文，成为划时代之作。也正是这篇文章，为图灵赢得了“人工智能之父”的桂冠。 \n1951年，从事生物的非线性理论研究。图灵被英国皇家学会选为会员，那年他39岁，成为他家族中的第四位皇家学会会员。\n1952年，图灵写了一个国际象棋程序。后来美国新墨西哥州洛斯阿拉莫斯国家实验室的研究群根据图灵的理论，在MANIAC上设计出世界上第一个电脑程序的象棋。 \n1953年-1954年，继续在生物和物理学等方面的研究。被迫承受的对同性恋倾向的“治疗”。\n1954年6月7日，图灵被发现死于家中的床上，床头还放着一个被咬了一口的苹果。警方调查后认为是氰化物中毒，调查结论为自杀。\n我们看这份年表，就会发现很多问题，首先，在1950年之前，图灵作为“计算机之父“能够通过研究联想出”人工智能“的可能性是可以理解的，但从53年他接受”同性恋治疗“以后，他的研究方向转移到了生物和物理学方面，就很难理解了，更难理解的是，他居然把自己给研究死了，是什么原因让他从自己潜心研究了那么多年的计算机领域转移到了生物和物理学上？又是什么原因让他选择了”自杀“呢？\n因为没找到我认可的资料，所以我只能自己推测一下，可能是图灵在研究人工智能时遇到了单纯的专业知识解释不了的问题，他必须跨学科研究（事实证明作为基础学科—数学的天才，又是图灵这种划时代的大师，去研究任何其他领域都会有所建树），然后他有了一个巨大的至今未发表的成果，这个成果，可能就是导致他”自杀“的原因，要么这个成果图灵认为发布以后会导致对人类毁灭性的结局，要么这个成果被政府知道，如果让图灵发表的话会导致对社会毁灭性的结局，如果是前者，那图灵就是真正的自杀，只有结束了自己，才能结束自己的研究，因为只有他一个人能研究这个，如果是后者，那图灵就是被谋杀的，毕竟图灵”自杀“的结论是那个和图灵对抗的政府所发布的，但我更愿意相信的是前者，因为图灵床头的那个苹果实在是太有诗意了！我一厢情愿的解释是，图灵选择吃苹果自杀是一种隐喻，在西方传统观念里，苹果是上帝赐予人类的智慧果，而这个智慧果每当人类社会有重大转变的时候都会发挥作用，图灵作为一位划时代的天才，他被上帝拣选成了使用智慧果的人，但他却用一种最笨拙的方式告诉世人，所谓的智慧果其实是有毒的，或者说他手里的这颗苹果，是个毒苹果，他想让人类看到使用了这颗毒苹果的后果，于是他选择了自杀。\n\n\n后记：\n这个电影虽然没有给英国政府可耻的行为进行辩护，但它也没真正的想为图灵平反，它只是给大家讲了一个谁都喜欢听的故事，仅此而已！\n", "useless_count": 4, "comments_count": 4, "alt": "https://movie.douban.com/review/7373587/", "id": "7373587", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 30, "author": {"uid": "132776726", "avatar": "https://img3.doubanio.com/icon/u132776726-4.jpg", "signature": "", "alt": "https://www.douban.com/people/132776726/", "id": "132776726", "name": "好人"}, "created_at": "2018-05-21 07:55:17", "title": "模仿游戏", "updated_at": "2018-05-21 07:55:17", "share_url": "https://m.douban.com/movie/review/9383040", "summary": "奇异博士大本尼和美美的凯拉奈特利上演了“艾伦图灵”的故事。“往往是那些意想不到的人，做出了意料之外的事”。喜欢凯拉讲的爱情观“我们并不是完美的夫妻，但我们各有各的工作，却又彼此相伴，互诉衷肠”这比...", "content": "奇异博士大本尼和美美的凯拉奈特利上演了“艾伦图灵”的故事。“往往是那些意想不到的人，做出了意料之外的事”。喜欢凯拉讲的爱情观“我们并不是完美的夫妻，但我们各有各的工作，却又彼此相伴，互诉衷肠”这比大多数的婚姻好得多。据估计：恩尼格玛密码的破解使得二战至少提前了两年结束，超过一千四百万人的生命得以拯救，而这件事被政府保密了长达50年之久。这归功于艾伦图灵的贡献，然而，艾伦图灵因同性恋在被劝服药治疗期间自杀身亡。 \r\n\n戏剧处理的传记，天才图灵的传奇。年少备受欺凌，本性纯真克制隐忍，情事如烟记忆始终；成年满身天赋，破解密码恩泽人类，战争政治夹缝求生；中年孤独颓败，以爱命名毕生心血，性向之殇促成早逝。三段组合浓缩一生，世人的偏见毁了英雄，迟到的荣誉令人唏嘘。 ", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/9383040/", "id": "9383040", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 47, "author": {"uid": "softpur", "avatar": "https://img3.doubanio.com/icon/u3437095-36.jpg", "signature": "新的开始", "alt": "https://www.douban.com/people/softpur/", "id": "3437095", "name": "Ms.蔬菜"}, "created_at": "2015-02-08 14:04:24", "title": "几句台词", "updated_at": "2015-05-17 20:16:18", "share_url": "https://m.douban.com/movie/review/7372112", "summary": "Do you know why people like violence? It is because it feels good. Humans find violence deeply satisfying. But remove the satisfaction, and the act becomes... hollow.  Alan Turing: When people talk...", "content": "Do you know why people like violence? It is because it feels good. Humans find violence deeply satisfying. But remove the satisfaction, and the act becomes... hollow.\n\nAlan Turing: When people talk to each other, they never say what they mean.\n［pause］\nAlan Turing: They say something else and you're expected to just know what they mean.\n\nAlan Turing: ［after telling the story］ Now you decide am I a machine,am I a human,am I a war hero,or am I a criminal.\nDetective Robert Nock: I'm not the person to answer that...", "useless_count": 3, "comments_count": 3, "alt": "https://movie.douban.com/review/7372112/", "id": "7372112", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 48, "author": {"uid": "left_behind", "avatar": "https://img3.doubanio.com/icon/u57245313-400.jpg", "signature": "BEING TOWARDS DEATH", "alt": "https://www.douban.com/people/left_behind/", "id": "57245313", "name": "玫瑰玫瑰我爱你"}, "created_at": "2015-01-09 20:26:29", "title": "It was Christopher he imitated.", "updated_at": "2017-07-15 15:29:03", "share_url": "https://m.douban.com/movie/review/7332423", "summary": "The Imitation Game  It was only a step Turing happened to take while solving Enigma, on his long journey to find back Christopher, as the title suggested, the imitation game, in which he tried to r...", "content": "The Imitation Game\n\nIt was only a step Turing happened to take while solving Enigma, on his long journey to find back Christopher, as the title suggested, the imitation game, in which he tried to replace Christopher with a machine whose way of thinking though different couldn't be judged as not thinking. \nIn this sense, Joan just never got it. She had a great talk in the end but never got what Turing meant. Her speech was a product of logic, from the respective of cause and effect, Turing's achivements along with their attributions. But it was interesting how Turing responded with one question -- Do you really think that? (Quite a typical act Turing would have as a guy troubled in interpersonal communication.) \nIt is not fair to say Joan was wrong because she plainly didn't know the story about real Christopher, like we did, but we could say that this machine shouldn't be simply called Turing machine, nor the computer.  -- It was Christopher.\n", "useless_count": 5, "comments_count": 9, "alt": "https://movie.douban.com/review/7332423/", "id": "7332423", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 23, "author": {"uid": "mzmuxin", "avatar": "https://img3.doubanio.com/icon/u99364674-4.jpg", "signature": "", "alt": "https://www.douban.com/people/mzmuxin/", "id": "99364674", "name": "Sally赛C"}, "created_at": "2014-11-29 13:28:20", "title": "冲奥野心是块绊脚石", "updated_at": "2016-07-08 15:35:25", "share_url": "https://m.douban.com/movie/review/7215024", "summary": "       作为公关小能手韦恩斯坦今年的主打，模仿游戏受到的关注自不用多说。同为英伦传记片，很多人把它同两年前同样出自韦恩斯坦的皇上无话儿（国王的演讲）比较，后者当年一举拿下最佳影片、导演、影帝等重量级...", "content": "       作为公关小能手韦恩斯坦今年的主打，模仿游戏受到的关注自不用多说。同为英伦传记片，很多人把它同两年前同样出自韦恩斯坦的皇上无话儿（国王的演讲）比较，后者当年一举拿下最佳影片、导演、影帝等重量级奖项，以目前的声势来看模仿游戏要比肩皇上有些难度。不过皇上当年也是后期逆袭了社交网络，一句话，只要有韦胖在，一切皆有可能。\n       回归片子本身，跟国王轻喜剧的欢脱模式和大团圆结局不同，图灵自身的经历决定了本片的悲剧走向。我对图灵本人无甚了解，所以这篇评论里提到的仅针对这部片子。整体而言这是一部中规中矩的人物传记片，从选角到配乐都无大错，有泪点，偶尔也有一两个笑点解救沉重的氛围。每年都有这种片子，步步为营只为俘获学院评委的芳心，太过小心翼翼也就少了几分灵气。\n       开头的独白我觉得很多余，有点矫情，跟全片质朴沉静的风格不搭。然后三线并进这种结构很大胆，因为用不好会显得很凌乱而且容易让观众出戏，这大概也是这部片子为数不多的惊喜之处了。主线是二战期间图灵和小伙伴们破解enigma，另外还穿插了他学生时代与同学Christopher的一段残缺之情和战后因为同性恋身份被调查。除了警探调查以外另两条线都很饱满，尤其是Christopher，贯穿全片，赋予图灵这个神经质怪胎一抹感性，以Christopher命名自己心血的结晶又让人唏嘘。\n       唯一美中不足的是这条线结束得有些仓促牵强，或者说缺少铺垫，戏剧冲突也稍弱，比如我之前脑补的烂梗是两人暧昧之情被发现被强行分开甚至Christopher被欺负致死。当然这是传记不是琼瑶剧，不能想怎么编就怎么编。说到这里我觉得其实纯粹站在拍电影的角度上，拍传记片最大的不利之处就在于你讲的是真事儿，出于对原型人物的尊重，创作上难免受限制。最容易出现的问题就是缺乏激动人心的高潮，比如同样是今年冲奥热门的theory of everything。当然不是说片子一定要有高潮，平平淡淡也可以打动观众，但是这就很考验导演和编剧的功力了。\n       扯远了，说说表演。Benedict Cumberbatch作为本片的灵魂人物，他的表演是担得起的。台词念得到位，很好的体现了人物的性格（比如他有时候很尴尬地升高音调或是因为紧张而声音发抖），最后的哭戏看得人揪心却不会用力过猛。虽然有些人因为别的原因而讨厌他，但作为一个演员他的资质是值得肯定的。Keira Knightley沉寂这么多年以后今年终于显出回春的迹象，有望获得第二个奥斯卡提名。作为图灵的soulmate她很好地演绎出了Joan活泼可爱的形象，结尾处她重复的点题台词\"Sometimes it is people who no one can imagine things of who do things that no one can imagine\"结合当时的情景格外感人。可惜的是她好像缺少让人印象深刻的oscar moment，也许图灵说分手时她扇那一巴掌可以算？Matthew Goode果然适合当配角。他这种有气质没气场的演员担主撑不起来且容易被抢戏，作配角却很抢眼（又养眼）。然后我很困惑的是似乎有他和图灵的暧昧暗示？比如图灵给他介绍女人时明显的不乐意和enigma破解后两人和别人都热情拥抱面对彼此却略显awkward地一笑...但是后面也没有再提到。Mark Strong出场少角色也没什么发挥空间应该是友情客串性质吧。唐家屯三女婿...至少是个有记忆点的角色。\n       总的来说这是一部好片子，虽然四平八稳无甚惊喜。创作者太讨好奖项，并未（可能也没打算）体现出任何个人风格。我对国王的感觉也差不多，为颁奖季量体裁衣私人定制，就差写上收件人学院评委了。只是如果我是评委，比起圆滑保守的模仿游戏，可能还是会更偏爱狂放不羁的Birdman。", "useless_count": 3, "comments_count": 6, "alt": "https://movie.douban.com/review/7215024/", "id": "7215024", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 17, "author": {"uid": "122170249", "avatar": "https://img3.doubanio.com/icon/u122170249-3.jpg", "signature": "", "alt": "https://www.douban.com/people/122170249/", "id": "122170249", "name": "白瑞德"}, "created_at": "2015-08-04 15:42:10", "title": "好片不可埋没", "updated_at": "2015-08-04 15:42:10", "share_url": "https://m.douban.com/movie/review/7559297", "summary": "《模仿游戏》在国内上映存在上映滞后盗版猖獗等无法避免的“硬伤”问题，但源于影片的高品质，让几乎所有看过该片的观众无不为故事的情节、演员的表演所折服。回顾本尼迪克特·康伯巴奇演绎过的角色，福尔摩斯、...", "content": "《模仿游戏》在国内上映存在上映滞后盗版猖獗等无法避免的“硬伤”问题，但源于影片的高品质，让几乎所有看过该片的观众无不为故事的情节、演员的表演所折服。回顾本尼迪克特·康伯巴奇演绎过的角色，福尔摩斯、霍金、梵高、“维基解密”创始人阿桑奇、计算机之父图灵等，本尼成为了驾驭高智商角色的天才代言人。在《模仿游戏》中，本尼对图灵这个角色的诠释是该片的画龙点晴之笔。他把一个不通世故的天才形象演绎得惟妙惟肖，对于图灵痛苦孤寂的负面情绪的把控恰到好处，临近结尾处当图灵站在“克里斯托弗”面前时，落寞的背影不禁让人心生苍凉，潸然泪下。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7559297/", "id": "7559297", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 12, "author": {"uid": "67630487", "avatar": "https://img3.doubanio.com/icon/u67630487-3.jpg", "signature": "", "alt": "https://www.douban.com/people/67630487/", "id": "67630487", "name": "snowflake"}, "created_at": "2015-09-23 03:13:54", "title": "天才的痛苦", "updated_at": "2015-09-23 03:13:54", "share_url": "https://m.douban.com/movie/review/7605837", "summary": "好电影！看的时候心一直被抓着，很吸引。  天才是孤独的，也是痛苦的，象图灵一样，知不能言，苦不能语。但是同时他也是非常幸运的，因为在有生之年可以做自己喜欢的事情并且做得非常成功。图灵是值得尊重和敬畏...", "content": "好电影！看的时候心一直被抓着，很吸引。\n\n天才是孤独的，也是痛苦的，象图灵一样，知不能言，苦不能语。但是同时他也是非常幸运的，因为在有生之年可以做自己喜欢的事情并且做得非常成功。图灵是值得尊重和敬畏的，他被丘吉尔认为是在二战中个人贡献最大的，对计算机科学的贡献是创造性的，可惜的是他在盛年去世。\n\n世人都爱天才，怜惜他们在生活里的笨拙，木讷，敏感。在屏幕上看他们也是揪着一颗心。可是天才在得到证实之前，人们却是瞧不起他们，热衷于嘲笑他们，不能认同他们甚至残害他们。这就是人类，人往往想要慈悲，可却偏偏残忍。\n\n图灵最后充满爱意地望着christopher的时候眼泪再也止不住，那种自然真实。最感动的就是那句：我不想再一个人。\n\n背景音乐恰到好处，震撼人心。", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7605837/", "id": "7605837", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 15, "author": {"uid": "62819844", "avatar": "https://img3.doubanio.com/icon/u62819844-1.jpg", "signature": "米是米猪头的米,猪是米猪头的猪", "alt": "https://www.douban.com/people/62819844/", "id": "62819844", "name": "米猪头"}, "created_at": "2016-04-23 22:14:15", "title": "异类", "updated_at": "2016-04-23 22:14:15", "share_url": "https://m.douban.com/movie/review/7864681", "summary": "如果说我会看一部传记类电影看到哭，没有看这部影片之前，我想我是不会相信的。事实上我并不是严谨的学院派，对这部分历史并不是清楚到每个细节。也许在严谨性上，它仍有瑕疵，但作为就电影本身，我想它还是成功...", "content": "如果说我会看一部传记类电影看到哭，没有看这部影片之前，我想我是不会相信的。事实上我并不是严谨的学院派，对这部分历史并不是清楚到每个细节。也许在严谨性上，它仍有瑕疵，但作为就电影本身，我想它还是成功的。\n\n说到天才，往往会伴随有“孤僻，不善交际，格格不入”等的标签，似乎这种脸谱化的形容往往成为天才的标配。电影里的图灵，似乎也是无法免除这样的俗套。说他更是一个异类，是因为在当时为世俗不容的性取向，也是他孜孜不倦的坚持，坚持他认为对的值得的。 人们总是在拒绝和不一样的人或事物，人们总是在试图改变他们同化他们。所以图灵注定是孤独的，不被理解的，直到死。\n\n还记得电影中有一段场景，图灵面对讯问他的警官问他机器是否会思考的时候，他有这样的回答：“机器不同于人类，所以他们和人类思考的方式不同。 有趣的是，仅仅因为某样东西思考的方式与你不同，难道就意味着不思考么？”  如何能够尊重和自己不一样的人与事，这大概也是电影想要传递的其中一个信息吧。\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7864681/", "id": "7864681", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 24, "author": {"uid": "10149854", "avatar": "https://img3.doubanio.com/icon/u10149854-2.jpg", "signature": "", "alt": "https://www.douban.com/people/10149854/", "id": "10149854", "name": "橘子菌●ω●"}, "created_at": "2015-04-23 10:40:01", "title": "幸福的数学家", "updated_at": "2018-09-24 19:42:23", "share_url": "https://m.douban.com/movie/review/7451964", "summary": "【转】 面对面的办公室【冯·诺伊曼与艾伦•图灵】——纪念艾伦•图灵百年诞辰 1912.6.23-2012.6.23   一、左边的办公室  冯·诺伊曼教授每年换一部新凯迪拉克。早上十点，他把爱车停在帕尔玛物理实验室门口...", "content": "【转】\n面对面的办公室【冯·诺伊曼与艾伦•图灵】——纪念艾伦•图灵百年诞辰 1912.6.23-2012.6.23\n\n 一、左边的办公室\n\n冯·诺伊曼教授每年换一部新凯迪拉克。早上十点，他把爱车停在帕尔玛物理实验室门口，神采奕奕地走进隔壁数学系的办公室。那时候普林斯顿高等研究院才刚成立，和数学系挤在一幢叫作Fine Hall的楼—— “还不错的楼”。冯·诺伊曼教授总是穿一身笔挺的西装，以免别人把他错当成学生。他太年轻，三十出头，却已经到达了学术顶峰，和五十多岁的物理学家爱因斯坦、数学家维布伦(Oswald Veblen)、数学家亚历山大(James Alexander)一起成了高等研究院最初任命的四位教授。\n\nJohn von Neumann, 1903-1957\n\n十八岁那年，他犹太裔的父母试图把长子拉出对数学的执迷学些更实际的东西，于是他们达成了妥协，冯·诺伊曼同时在三所大学注册：在苏黎士联邦理工学院（ETH）学习化学工程，每晚完成柏林大学数学专业的作业，在每个学期末回布达佩斯大学参加他从没上过课的数学考试。二十二岁那年他不但从苏黎士联邦理工拿到化学工程学位，还通过了大卫·希尔伯特坐镇的数学博士答辩。整场答辩希尔伯特只问了一个问题：“我从来没见过这么漂亮的晚礼服，你的裁缝是谁？”于是，大家都知道了，希尔伯特钦点的年轻人，不但写了完美的博士论文，还是个翩翩佳公子。\n博士毕业后的三年，高产的三年！他在柏林大学和汉堡大学的三年一共发表了二十五篇论文！包括一本八十年后仍然重印的量子力学教科书，可是……对于这个高速前行的天才这些光荣也已经是陈年往事。二十七岁上，纳粹刚刚抬头而美国也恰好走出了大萧条，维布伦代表普林斯顿去欧洲招兵买马，工资开价是冯·诺伊曼在德国挣的八倍还多。踏进美利坚第一天，他打趣地对同行的匈牙利老乡维格纳(Eugene Wigner, 1963年诺贝尔物理学奖)说：“我们该让自己更像美国人。”当即，维格纳改名叫“尤金”(Eugene)，冯·诺伊曼改名叫“约翰”(John)，和稍微熟一点的人就勾肩搭背地说“你们叫我强尼(Johnny)吧。”\n强尼，强尼。强尼•冯•诺伊曼就不着痕迹地混进了满大街都是强尼的美利坚大熔炉，还有谁知道他刚出生时那个卑微的匈牙利名“亚诺斯”(Janos) ？还有谁知道他在德国那几年日耳曼化的“约汉纳”(Johann)？ 不过他改了名字，却死活不肯把姓氏里的“冯”去掉。二十几年前他有钱的犹太老爸向行将就木的老皇帝弗朗茨·约瑟夫买了这个贵族称号，于是带着暴发户气息的诺依曼家族就转眼变成了代代相传的贵族冯•诺伊曼，多亏奥匈帝国国库空虚等钱用，否则十足的犹太血统怎么能捐上这个高贵的名头？一到周末冯•诺伊曼肯定请教授们上他宽敞奢侈的大宅喝酒跳舞，宾客盈门杯觥交错， “冯•诺伊曼请客谁不去！”讲出这话，就好象请客做东的是奥匈帝国的某个最尊贵的日耳曼裔公爵。\n\n二、右边的办公室\n\n冯·诺伊曼教授对面的办公室坐着博士生艾伦·图灵。开朗外向的冯•诺伊曼教授和孤僻紧张的图灵没什么闲话好聊，只知道这个总穿一身乱糟糟运动衫的年轻人前几天差点把自己的那部二手福特车倒车进了卡耐基湖。冯•诺伊曼教授横穿大西洋必买头等舱，常年西装革履，每年换一部崭新的凯迪拉克，略略发福，讨厌运动，有一次妻子想让他学滑雪他恼羞成怒甚至以离婚威胁。与他恰恰相反，博士生图灵则在几个月前坐着末等甲板舱从英国漂到美国。他常年一件套头衫，开一部状况堪忧的二手福特，身材瘦削，热爱运动，是跑赢过奥运会选手的马拉松健将。一到周末，他和同学打垒球比赛，分成两个队，“大英帝国队”对决“叛变殖民地队”。\n\nAlan Turing, 1912-1954\n\n刚来普林斯顿那会儿他不是没试过去交朋友，拥抱新生活，可是上个月当一名卡车司机理所当然地把自己油腻腻的手搭在他肩上直呼其名和他侃大山时，堂堂剑桥大学国王学院的毕业生着实为这种粗鲁的风气吓了一跳。别误会了，他不像冯·诺伊曼教授那样公子派头，他爸爸不过是大英帝国驻印度的一个小公务员，可是英伦岛国的教养让他觉得一个陌生人把脏手搭在你他肩上实在有点亲昵过分。他也讨厌陌生人叫他“艾伦”，还是“图灵先生”更妥当些。除了难以适应美国的新环境，图灵先生还有更糟的问题，在那个年代的体面社会里止于手势和眼神的问题：喏，你知道的，他有点那个……就是那个……那个啊……你晓得我在讲什么啊。\n数学天才艾伦·图灵先生是个无可救药的同性恋。\n这个无可救药的问题是这样开始的：当图灵还在谢伯恩男校 (Sherborne School )读高中，他认识了比自己高一级的克里斯托弗•马尔孔 (Christopher Morcom)。瘦弱的、过于瘦弱的马尔孔，每个学年都因病长期缺课，可他聪明的头脑竟然使他在偶尔上学的几天能补上所有功课，门门考试成绩第一。是这样毫不费力的聪慧吸引了图灵，而当他更接近马尔孔，惊喜地发现他和自己一样，对科学有着自发而浓厚的兴趣。在马尔孔偶尔上学的日子里，他们坐在相邻的座位听课，又一起去图书馆写作业，以便能不断讨论科学问题：马尔孔说如何在家里搭化学实验室研究碘，图灵说如何手算圆周率到小数点后36位，马尔孔说你知不知道薛定谔的量子力学有趣极了，图灵说你知不知道爱因斯坦的相对论也有趣极了。他们谈梦想，应该做数学家还是物理学家，如何为科学做出真正的贡献……晚钟响了，他们回各自的宿舍睡觉，又在凌晨爬起来站到阳台上用天文望远镜看星星，并写信把观测结果告诉对方：“我从没见过更好的木星。今夜我看到了五个环，甚至能看清中间那个环上的斑。”“我今夜看到了仙女座，但一会儿就消失了。”那个冬天，毕业班的马尔孔已顺利拿到了剑桥三一学院的奖学金。图灵还有一年毕业，马尔孔鼓励他来年报考剑桥，“因为那里的科学最好，而且我能经常看见你。”这句嘉勉说出口不到一个月，一个晴朗的凌晨，图灵起床看见月亮刚巧经过对楼马尔孔的窗户落下。“今晚的月亮格外美。”他写在记事本上预备第二天告诉马尔孔，他还不知道永远不会有那一天了。那个凌晨，克里斯托弗•马尔孔暴病夭折。\n落葬日，时年十七岁的图灵怀着巨大的悲痛写信给马尔孔的母亲：\n1930年2月15日\n亲爱的马尔孔太太，\n我因为克里斯而很难过。一年来我们一起学习，我从来没交过像他那么聪明、迷人、又谦卑的朋友。我和他分享了研究的乐趣还有对天文的热爱（这是他引发的），我想他也是这么觉得的。现在，尽管有一部分乐趣因为他的死而消逝了，即使这一切不再因为他而那么有趣，我也要投入尽可能多的精力到研究上，就象他仍然活着。他会希望我这么做的。我深知你此刻的悲痛。\n你忠诚的，\n艾伦•图灵\n又及：如果你能给我一张克里斯的小照片我将十分感激。我愿以此来缅怀他的榜样和成就，督促我更仔细更优秀。我会思念他的面容，他走在我身边时微笑的模样。幸好我保存着他所有的信。\n马尔孔死后一年，图灵的未来决定了，他要去剑桥国王学院学数学，就像给马尔孔太太的信里所承诺的，“以此缅怀他的榜样和成就。”这一年中，无数次对马尔孔的哀思恐怕也让他渐渐明白了比友谊更深的感情。是爱情吗？图灵无法回答，也不屑回答。落葬日那封痛切的信，还有这一年来（以及他的余生）为了纪念马尔孔而突飞猛进的学业都说明了这份感情比爱情更高：他在竭尽所能挽留死者。又有谁会为那么美好的感情而惊慌呢？于是图灵坦然接受了，并在余生从未试图遮掩自己的性取向。\n\n三、希尔伯特的落日\n\n每个清晨和黄昏，图灵习惯一个人沿着河边长跑思考问题。去年夏天，当他还在剑桥国王学院读本科，某次长跑到精疲力竭地躺倒在草地上，斜阳西照，运动让他神思凝聚，他脑中经历了一场风暴，忽然意识到了回答希尔伯特判定问题（Entscheidungsproblem）的办法。他兴奋地一跃而起跑回寝室写下自己的思绪。他的身后，照耀世界数学界三十余年之久的希尔伯特的太阳，终于落山了。\n大卫·希尔伯特，那个时代最受尊敬的数学家，凭一己之力使数学走上了更严谨系统的现代之路。1900年，38岁的希尔伯特如一位新任的武林盟主，振臂一呼，四方响应。他在国际数学大会上提出了著名的“二十三个问题”，立即成为了数学界集体奋斗的目标，其中的第八个问题黎曼猜想/哥德巴赫猜想更是成了数学的桂冠。二十八年后，暮年的希尔伯特又提出了三个数理逻辑上的大问题，简单说来这三个问题分别是：1）数学是完备的吗？2）数学是相容的吗？3）数学是可判定的吗？其中的第三问题，即被称作希尔伯特的判定问题。如果说 1900年的二十三个难题洋溢着壮年人的踌躇满志，那么1928年的三个问题已经是一个老人对秩序和条理的向往。希尔伯特十分希望，这三个问题的答案都是肯定的，因为这将使数学建立在完美严谨的逻辑的基石上，作为亘古不变的真理存在。\n可惜，这个井井有条的逻辑美梦只做了三年，年轻的奥地利人哥德尔就发表了震惊数学界的哥德尔不完备定理：数学不可能既是完备的又是相容的。这个定理以十分有趣的形式否定了希尔伯特1928年的第一和第二个问题。到1935年夏天，躺在草地上休息的图灵经历了一场头脑风暴，他想到了否定希尔伯特第三个问题的办法：用机器。他想象着一种虚构的“图灵机”，可以从一条无限长的纸带子上的读取命令进行操作，从而模拟人类所可能进行的任何计算过程。图灵证明，我们不能用一个算法来判定一台给定的图灵机是否会停机，所以停机问题是一个无法判定的数学问题，即希尔伯特的第三个命题答案为否。\n巧合的是，第二年春天，正当图灵把关于判定问题的论文初稿交给导师纽曼(Max Newman)过目时，大洋彼岸，普林斯顿大学的阿隆佐·邱奇(Alonzo Church)教授——逻辑界数一数二的学者——抢先一步发表了新论文，利用自创的λ演算(lambda calculus)否定了希尔伯特判定问题。看到邱奇如此巧合的论文，导师纽曼顺水推舟写信推荐图灵去做博士生。1936年夏，邱奇的新博士生图灵来到了普林斯顿。\n图灵在普林斯顿大学的档案 Firestone Library, Princeton University, June 2012\n11月，图灵关于判定问题的论文，即多年后将声名大噪的 On Computable Numbers, with an Application to the Entscheidungsproblem 终于发表，学界反应极其冷淡。12月图灵在普林斯顿数学俱乐部做了关于这篇论文的演讲，听众不足十人。这篇解决了希尔伯特第三个问题的论文为何遭到如此冷遇？有几个原因：其一，哥德尔不完备定理如此有趣奥妙，已经吸引走了学界关于希尔伯特三问题的大部分兴趣；其二，邱奇当年春天的论文已经率先解决了希尔伯特判定问题，虽然图灵的解法天差地别，也比邱奇的解法简洁得多；其三，用“机器”解决数理逻辑问题，实则是此篇论文最闪光的部分，可是过于新颖，不容易被主流学界接受；其四，恐怕也是最重要的原因：和著名教授邱奇比起来，图灵才初出茅庐。他在家书中愤愤说：“只有名人才会吸引听众。(One should have a reputation if one hopes to be listened to.)”\n不，不完全如此。至少还有一个人会认真阅读无名小卒的论文。对门办公室的冯•诺伊曼教授——图灵默默仰慕又羞于开口的偶像——不但认真读过这篇论文，还读过所有期刊上的所有论文。他是一本雄心勃勃的百科全书，任何人的任何知识都逃不出他的法眼。图灵的论文一发表，敏锐的冯•诺伊曼已经嗅到了图灵机广阔的远景，他对朋友说，你该去找我对门的图灵，他那篇论文正好可以做这样那样的事。他慷慨地给朋友建议，自己却没亲自找图灵聊聊。他的注意力在有趣的图灵机上停留了一下，又跳到另一个截然不同却同样有趣的问题上：量子力学、流体力学、博弈论……世上千千万的问题都吸引着冯•诺伊曼，他脑中有千千万要实行的计划——图灵机不过是其中一个。\n可是，博士生图灵仍然因为这篇论文而给冯•诺伊曼教授留下了印象，两年后图灵从普林斯顿博士毕业，是冯•诺伊曼教授唯一提出了挽留：年薪一千五百美元聘图灵做自己的助手。对于一个年轻的数学家，能师从传奇般的冯•诺伊曼教授是梦寐以求的机遇， 一千五百美元的薪水也比图灵在英国能找到的教职待遇好得多。图灵拿着冯•诺伊曼的聘书在普林斯顿校园里晃荡，理性使他不得不好好考虑这个千载难逢的肥缺，可是啊——英国人图灵吸吸鼻子，鼻子里呼到的空气有点太粗鄙，清清耳朵，耳朵里听到的英语有点太懒散。他走过哥特式的普林斯顿校礼拜堂，那只是更加宏伟古老的剑桥国王学院礼拜堂蹩脚的复制品。礼拜堂的尖顶插入新泽西州的蓝天白云，英国人图灵却没法欣赏这儿的晴空万里，他的目光越到了大西洋彼岸，那里，纳粹的阴云密布欧洲。\n1938年夏，博士毕业的图灵忧心忡忡回到英国剑桥，在数学系做一学期才给十英镑的临时教员，教一门听者寥寥的“数学基础”。他将慢慢攀爬学术的梯子，成为教员、讲师、副教授、教授，如果不出意外的话。九个月后，意外降临：纳粹的阴云终于骤降成狂风暴雨，德国入侵波兰，第二次世界大战开始。\n\n四、Station X. Site Y.\n\n二战的爆发给白金汉郡的布莱切利镇带来了点可喜的新鲜，一万多人连夜从大城市挤火车逃难到这个平庸乏味的小镇，可是不久大部分又挤火车回去了：宁愿被炸弹炸死，也不要在这小地方无聊死。艾伦•图灵却逆着人潮，搬到了这无聊小镇最无聊郊区的一家最最无聊的小旅馆里，每天骑车三英里去镇中心的布莱切利园(Bletchley Park)上一个谁都不知道在瞎搞什么的班，下班回来还自愿给冷冷清清的旅馆酒吧打杂。旅馆老板娘看着这个闲得发慌的小伙直摇头：健健康康的大男人，怎么不去打仗呢？\n可是，图灵正在打仗。他的敌人：哑谜。看似死水一潭的布莱切利园，此时已有了军事代号：Station X，保密等级：绝密。这里是英国政府密码学校的驻地，海陆空和军情六处的情报组织各占一隅。几百名工作人员日夜兼程破解德国人的无线电报，为了最大程度保密，大部分职员根本不知道工作的真正目的，除了几个核心解密成员：象棋冠军、填字游戏高手、数学家。二十七岁的图灵很快在这个核心团队里有了绰号：教授(Prof.)。\n此时的欧洲上空，无数来自德军的电波正以莫尔斯码的形式穿梭来回。这些莫尔斯码发出前由一种称作“哑谜机”(the Enigma Machine)的加密器加密，在接受方又由同样的“哑谜机”解密。直到二战结束，德军从未怀疑过哑谜机的坚不可摧，所有军种所有级别电报，一律用哑谜机加密，加密电报中放心大胆地沟通了所有军事信息：潜艇位置、军队人数、攻击路线、伤亡报告……\n哑谜机\n德军的信心源于哑谜机复杂的加密方法。虽然每个军种对商用的哑谜机都略有改进，不过所有哑谜机基本构造相同：键盘、接线板、多个转子、指示灯。当密码操作员在键盘上按下一个字母（比如字母A），电流会通过一个可自行改接的接线板，启动一个或者多个转子转动，同时点亮某个字母指示灯（比如字母L），于是字母A被加密成字母L。哑谜机精巧的设计使得，在下一次按下字母A时，它将被加密成另一个不同的字母（比如字母P）。更巧妙的是，当且仅当发送端和接收端的哑谜机拥有同样的初始设定（同样的接线板、同样的转子排列、同样的转子初始位置），密码L才可以使用接收端的哑谜机还原成A。而对于不知道初始设定的敌方，他们面对的可能情况多达10^114种！\n雪上加霜的是，德军每个军种所用的哑谜机略有不同，相对于三个转子的陆军哑谜机，海军五转子的的哑谜机要复杂得多。在布莱切利园只有两个人相信这层层加密状如天书的密码可以被破解：一个是布莱切利园的老大，因为“海军电报必须被破解”，否则被德军潜艇战封锁的英国将坐以待毙；另一个是“教授”图灵，因为“如果海军电报能破解，那实在太好玩了”。\n“教授”发现，在加密文件中找规律的本质是重复搜索，而搜索是一种机器可以代替人脑的工作。当时，布莱切利园从曾经研究过哑谜机的波兰数学家那里继承了一种叫“炸弹”(Bombe)的原始解密仪器，每一个“炸弹”模仿一个哑谜机的转子，许多“炸弹”相链接来模拟一种哑谜机的初始设定生成可能的电报。简而言之，这是一种穷举搜寻答案的算法，需要遍历所有可能排列，费时费力。图灵洞察到，只要运用几个简单的事实——比如，一个字母的密码不可能是其本身、原始文本中一些字母（比如s）的出现频率一定高于另一些字母（比如x），一些固定词语（比如“元首”）将高频出现——就能大大改进波兰人的笨法子，来快速寻找最有可能的转子设定。用现在的算法语言来说，他将穷举法改良成了贪心算法。贪心算法改进后的“炸弹”对抗五转子的海军哑谜机大获成功。每次一方发出电报后，接受方过几分钟将发一封短电报表示“收讫”。许多回，电波中还未监测到“收讫”电报，图灵的“炸弹”机已经将密码还原成了原文， 可见“炸弹”的解密速度甚至比预知原始设定的接受方都快！布莱切利园自豪地说，德国人真该问“教授”他们的电报到底讲了什么。\n可是，随着战争深入，转子更多的哑谜机不断投入运用，最后竟出现了十二转子的密码机。面对十二转子，即使图灵的“炸弹”都需要十几天时间。战场瞬息万变，布莱切利园亟需更快速的机器。很显然，提高速度的关键在于把机械的“炸弹”机改成更快速的电路装置。1943年，在图灵的鼓励下，布莱切利园工程师Tommy Flowers设计了一台叫作Colossus的巨型机器，在战时充裕的经费支持下很快获准建造。\n这就是世界上第一台计算机，电子化、数字化、程序化。它由光学在长条纸带上读取电报原文，经过一千五百个真空管的电路计算，将解密结果输出到电传打字机上。1944年6月1日， 经过完善的Colossus二号机抵达布莱切利园。离诺曼底登陆只有五天。\n诺曼底登陆，在欧洲开辟第二战场的唯一方法，毋宁是一场豪赌。盟军三百万主力兵力要从海上和空中登陆易守难攻的诺曼底，很可能伤亡惨重。为了保护兵力，盟军的情报网精心编造了一则假情报透露给敌方，希望德军以为在诺曼底将有一次只是“小规模”的军事转移。而德军能不能上当则唯有通过由Colossus解密的德军电报检验。幸亏快速的电子计算机，解密很顺利，德军的电报显示只有一小支部队被派往诺曼底。更幸运的是，电报还详细说明了军事安排、物资转移、军种调遣，德军手中的牌一览无余。\n6月6日凌晨三点，Colossus破解了一条德军自诺曼底刚发出的绝望的电报。天啊，天上怎么来了那么多伞兵。\n随着这些伞兵安然降落，二战的转折点到来了。\n大西洋的另一边，1943年秋。\n威斯康辛大学麦迪逊分校数学教授乌拉姆(Stan Ulam)的办公室里闯进了一个女学生。学期只过了一半，她却要求提前完成期末考试，以便“为战争服务”。她坐在办公室的地板上，答完了教授在信封背面临时写下的几道题，然后消失到谁都不知道哪儿去了。\n这几天，乌拉姆身边有许多朋友消失了。在食堂认识的同事、物理教授、自己带的研究生，他们打了个 “为战争服务”的假条，就神秘莫测地走了。乌拉姆心里痒痒，写信给自己朋友中人脉最广的冯•诺伊曼，询问有否能为战争服务的工作，他回信了，说自己忙得很，不如在芝加哥火车站见面——他在那里正好有两个小时的转车时间。乌拉姆在站台见到了风风火火的冯•诺伊曼，以及——他身后的两位保镖，这才意识到他朋友正在忙活的事对大战意义重大。冯•诺伊曼神秘地表示：有一件很重要的项目也许能让乌拉姆帮忙，不过他还不能说是什么事，在哪里，有谁。\n几周后，乌拉姆收到了一封政府委派信，要求他去新墨西哥州一个小镇。他从来没听说过这荒僻之地，就去图书馆借新墨西哥州地图册。于是他惊喜地发现，在地图册的借书卡上，整齐地排列着之前消失的所有熟人的名字。他们都消失到了这个闻所未闻之地。\n火车在一个荒凉的车站停下，黄沙遍野，峭壁陡崖，像时间尽头一样死寂。这里就是Site Y，刚刚起步的研究项目叫Project Y，保密等级：绝密。战争结束后，前者将称为洛斯阿拉莫斯国家实验室(Los Alamos National Laboratory)，后者便是鼎鼎大名的曼哈顿计划。在这片萧索瑰丽的沙漠中，聚集了一群活力旺盛的年轻人，平均年龄25岁，第一年，80个新生命诞生。他们的领袖奥本海默38岁，他们的信使冯•诺伊曼39岁。他们的任务：制造摧毁一切活力和生命的超级武器，原子弹。\n洛斯阿拉莫斯国家实验室边界的标志\n四年前，爱因斯坦和西拉德（Leo Szilard）上书美国总统罗斯福：物理学的推进已经使得通过核裂变获得巨大能量指日可待，只要德国人愿意，他们有知识和能力发明这种武器，美国必须赶在纳粹德国之前掌握核技术。随着美国正式参战，核技术的研究越来越紧迫。一个名字被提出来：罗伯特·奥本海默，聪明果敢，当机立断。另一个名字被提出来：约翰•冯•诺伊曼，因为他已经坐镇另外十几个军事项目上，正好能耳听八路，眼观四方。\n冯•诺伊曼教授是军方最喜爱的合作人。作为犹太人他对纳粹嫉恶如仇，为了替关在集中营的朋友报仇他渴望和手段强硬的人合作，醉心各种新式武器。作为数学家，他认为只有当数学有应用价值时，数学才能最快速度发展。少时父亲逼迫之下学习的化学工程意外派上了用场，他很容易明白物理学家和化学家的讨论，再用数学的语言解释给数学家听。他最擅长把一项看似庞大无解的任务庖丁解牛，分拆成小零件委派他人，让底下每个人觉得自己拿到的那部分恰好是最擅长的本职。他是天生的领袖和传令官，坐镇导弹研究实验室、美国数学学会战争委员会、国家防御研究委员会……不像大多数被强制定居在洛斯阿拉莫斯的科研者，他进出自由。日理万机的冯•诺伊曼教授哟，他在普林斯顿、波士顿、费城、华盛顿、芝加哥、洛斯阿拉莫斯实验室、阿伯丁兵器试验中心……全美的战时科研进展他一清二楚，人家刚跟他讲了两句，他就能接上来，“某某在芝加哥也做这事。”“哈佛的某某已经搞出来了。”\n曼哈顿计划最大的困难不是制造出核裂变反应，而是控制原子弹的威力。爆炸的冲击波将反复震荡叠加，最终的力量难以预测。曼哈顿计划的高度机密性和核试验的昂贵成本使得大规模试验不可能，而人力又难以计算如此多的非线性方程。如何提高计算能力成了当务之急。\n事实上，计算能力这个瓶颈也困扰着其他军方科研项目。于是，1943年，当听说宾夕法尼亚大学的一群工程师为了计算导弹轨道（另一种典型的非线性方程）而开始建造一台名为ENIAC的巨型机器时，冯•诺伊曼立即敏锐地想到：也可以用这机器去计算原子弹冲击波的能量。在他的牵头下，ENIAC建完后第一项测试任务居然不是导弹轨道而成了核弹方程，整个测试将原本几个月的 人力计算缩短到了几天。完成测试他脸色苍白地回到普林斯顿家里倒头睡了十小时，醒来后不吃不喝，久久向妻子吐出一句话：“我们造了一头怪兽。”\n怪兽，他指的不是核弹，而是计算机。\n看到了ENIAC的广阔前景后，冯•诺伊曼毛遂自荐要做ENIAC的数学顾问，让发明者Presper Eckert和John  Mauchly受宠若惊。他们亲自领冯•诺伊曼参观机器，一间两百平米的大房间里，两个工程师指给他看：这里是一万八千根真空管、这里是电源、这里是读卡器、这里是维修站……可是，人家的设计冯•诺伊曼却看得比设计者还清楚，他一回去就写了个105页的报告：“一台计算机的基础组成是：存储器、控制器、运算器、输入输出设备。”至今，世界上的大部分电脑仍在沿用这著名的“冯•诺伊曼结构”。\n1945年5月，德国投降，证据显示德国当时的科研进展还未能制造出原子弹。7月，洛斯阿拉莫斯第一颗原子弹试射成功。8月，在新上任的杜鲁门总统的授意下，两颗本为抵御德国人的原子弹投向日本广岛和长崎。9月，日本投降。第二次世界大战结束。\n1945年7月16日凌晨，第一颗原子弹Trinity在新墨西哥州试射成功。奥本海默看完试射后引用了印度史诗《薄伽梵歌》中的诗句：“我已成为死神，三界的毁灭者 。”\n\n五、MANIAC\n\n在二战的巨大压力下，英美两国独立制造出了最原始的计算机，Colossus和ENIAC。它们惊人的相似：都利用打孔卡输入，都运用真空管计算，都体积庞大，都对二战胜利功勋卓著。二战史学家普遍认为，布莱切利园的工作使欧洲战场缩短了一年半到两年的时间，并直接切断了“沙漠之狐”隆美尔在北非的补给线；而曼哈顿计划则终结了太平洋战场。现在，在这个戏剧性的擂台上，两个核心人物图灵和冯•诺伊曼都决心改进这两台原始机器相似的缺陷：只为专门目的设计，不能储存程序。改进的方向很明显，一如图灵1936年论文所预言的那样，造一台能完成任何目的的图灵通用机。\n二战结束了，而冷战的阴影旋即逼近。核威慑成了一扇关不上的门，在间隔重重的美苏关系中，美国很快发现为求自保只能继续扩大核优势。氢弹的研究成为了攻坚关键，而如何提高计算能力又成了重中之重。要造一台好机器！冯•诺伊曼教授对此深信不疑。\n在哪里造？就在普林斯顿高等研究院！高等研究院院长面有难色：“我们这儿一直搞纯科学，造这么台大机器有点不像话吧？”“钱哪来？一年十万美金的预算，你得让数学系经费翻三番！”“造了放哪？三间两百平米的大房子，二十四小时引擎折腾，我们这儿可没这样的兵工厂。”鬼精明的冯•诺伊曼笑着对院长说既然这样那就算了，谢谢院长费心，一回头却给哈佛大学、芝加哥大学、IBM轮番写信：“我有兴趣到你那儿工作。”三所机构喜笑颜开，发出了热烈的聘书。好个冯•诺伊曼，姜太公钓鱼，把哈佛的聘书给芝加哥看，把芝加哥的给IBM看，每个机构衬着别人的价码轮番加价，要是能把鼎鼎大名的冯•诺伊曼请到，送个金屋银屋都值！他胜券在握，把哈佛的天价聘书呈给普林斯顿的同事看，伤感地说自己要辞职，教授们联名写信给院长：“失掉冯•诺伊曼将是普林斯顿的悲剧！”那院长也只能咬咬牙：去造你那台要命的机器吧。\n1947年在普林斯顿高等研究院开始建造的MANIAC计算机在任何意义上都超过了前任ENIAC。ENIAC用了两万个真空管，MANIAC只用了两千个。ENIAC重达三十吨，MANIAC只有一吨。最关键的是，ENIAC不能贮存程序，每个 不同的任务都需要重新排布电线，而MANIAC可以读取由打孔卡上二进制编码的程序，贮存在存储器中。它是世界上第一台真正的全能自动电子计算机，是后世所有计算机的母型。它完成的诸多军方任务中，最惹眼的是一次耗时60昼夜的计算，其结果证明了氢弹制造的可行性。\n1952年科学家们在MANIAC前合影。左五为奥本海默，右一为冯•诺伊曼。\n1957届校友Joshua Dranoff，日后成为西北大学化工系教授，在五十年代利用MANIAC完成了他化工博士论文，其中设计了一个用计算机模拟实验结果的步骤。他告诉我，每一天机器运行之前有漫长的检修，技术工拿着一箱电线和真空管爬进MANIAC内部逐一更换坏损零件。各个专业的学生等在实验室外叽叽喳喳地排队签到，他们都想尝尝MANIAC的鲜，在论文里时髦地用计算机做个小项目。1958届校友Jerry Porter，日后成为宾夕法尼亚大学数学系教授，是第一个运用MANIAC完成本科毕业论文的学生。他大三大四时还带领一帮同学负责MANIAC的夜班值勤，他们得盯着示波器屏幕，时刻监测MANIAC宝贵的1024比特随机存储器不被烧坏。这个夜班工作激发了他对计算机的兴趣，日后的学术生涯他专注于计算数学领域。\n于是乎，在未受战争破坏的美国，由ENIAC掀起的计算机和电子工程科学搞得风生水起，并很快由IBM公司实现了商业运作。到1960年MANIAC光荣退休被捐赠给史密森尼国家博物馆(Smithsonian)时，全美已经拥有了6000台计算机。\n在废墟上的英国，博士生图灵的运气远没那么好。二战后，为保护英国情报网，布莱切利园大部分文件资料被焚烧销毁，其余被归为机密档案。胜利的光荣属于海陆空三军，而布莱切利园的工作人员必须对战时工作保持沉默。头号功臣图灵被授予大英帝国官佐勋章（OBE），可即便他的母亲也只是知道，“他做了点了不起的事情。”\n图灵被分配到国家物理实验室工作，迫不及待地想要改进Colossus。 他向实验室提交了一份项目申请，详尽地阐明自己将如何建造一台能贮存程序的计算机，事无巨细地列出所有图纸和经费计划。可是，战时布莱切利园的高效和无节制的战争经费已经让位于战后拖拉的官僚作风和经济危机。过目这份申请的负责人没有一个看出这庞然大物的用处，大部分人甚至不相信计算机可以造出来——可笑可叹，与ENIAC的风光截然不同，为情报服务的Colossus对外界是“不存在”的。图灵甚至不能告诉别人，这台他们认为不可能造的机器已经造出来了。\n1948年，受够了国家实验室的官僚作风，图灵跳槽到曼彻斯特大学计算实验室 (Computing Labatory)，这里受到美国ENIAC的激励正在建造英国第一台贮存程序式电脑Manchester Mark I。图灵本该大有作为，可是制造这么大一个机器需要和很多人协调，他孤僻的性格很快让同事与之疏远，大部分建议被当作书呆子的意气而姑妄听之。不久，他聊以自慰地发现，造计算机的难点主要是硬件而非数学模型，那还是把琐碎的工程问题留给工程师吧。他呢，他只要能够“想”就行了。想——他开始为一个根本不存在的计算机想一种下象棋的程序。四年后，他会扮演这台虚构的计算机，严格执行自己的程序，和朋友下了一场真正的象棋比赛，每一步耗时半小时。他和朋友下输了，却赢了朋友的妻子一局。对于数学家图灵，即使永远没有计算机的实体，这件事也已经做完了。“想出来”就是“做出来”。\n\n六、咬了一口的苹果\n\n在曼彻斯特大学，图灵的主要工作仍然是在计算学理论上。1950年，他提出了至今仍广泛使用的“图灵试验”(Turing Test)，即让测试者向两个对象——一个为机器一个为自然人——提出一系列问题，如果根据双方的回答，测试者不能辨别孰为机器，则这个机器应被视为有智能的。别有意味的是，图灵在提出这个试验时用了一个精巧的隐喻：假设两个回答者是一男一女，提问方在问出一系列问题后不能判断哪个是女人，则可以认为那个男人也是一个成功的“女人”。\n他是在这里影射自己性取向上的差异吗？我们不得而知。可完成论文后没多久，他就在一次散步时结识了十九岁的阿诺德•莫里(Arnold Murray)：水泥匠的儿子、惯偷、小混混。这让人不禁想起当年中产富裕的魏尔伦一见钟情地爱上了十六岁的兰波：一个乡下来的野孩子，境遇的极端不同招至强烈的爱欲。如同魏尔伦和兰波一样，图灵的故事也有一个甜蜜的开头和一个毁灭性的结尾：有一天图灵发现自己家中失窃了，他报了案，窃贼是莫里的朋友。于是经过简单的询问，图灵向警方承认了和莫里之间的关系。\n在当时的英国，同性恋被列为“不体面罪”(gross indecency)。他的入室盗窃案非但因此不得到法律保护，他反而被送上法庭受审。法官给出了两种惩罚任他选择：坐牢或者化学阉割。当时一些科学研究认为，同性恋源自过剩的雄性欲望，可以通过注射雌激素来抑制。两害相权，图灵选择了后者，因为这样至少能呆在家里继续做数学。他被持续注射雌激素长达一年，导致胸部发育，变声，阳痿。\n1954年6月7日，他在家中咬了一口沾有氰化物的毒苹果自杀。\n让图灵生命最后两年处境悲惨并最后导致他服毒自杀的“不体面罪”，他当时是极其天真地就在警方面前承认了。他不但口头承认了，还兴冲冲手写了五页花体字的供述。读过这五页纸的警察认为 “像散文一样流畅”(a flowing style, almost like prose)、“虽然有些措词太难读不懂”(beyond them in some of its phraseology)、“他真以为他在做正确的事”(he really believed he was doing the right thing) 。图灵事后告诉朋友，他之所以这么坦白是因为他以为同性恋很快就要合法了，一切都可以摊在台面上谈。\n图灵惨死后六十年过去了，这一切还远不能摊在台面上谈，同性恋行为在大部分国家仍受到广泛争议，虽然尊重和合法的呼声在青年一代中越来越高。2009年，英国首相布朗在一份几千人签名请愿书下向这位计算机之父和二战英雄做了官方道歉：“我们很抱歉。你本该被更好对待。(We are sorry. You deserved so much better.)”\n为纪念图灵百年诞辰，2012年英国发行了一张图灵邮票。\n1957年，五十三岁的冯•诺伊曼因骨癌病逝，癌变原因很有可能源自曼哈顿计划的核辐射。军方代表守在他的病床前，以防他在药物作用下泄漏军事机密。生命最后的日子，这个数学天才连简单的加减法都不能做了，却还逐字背诵幼年读过的《浮士德》 给探望的亲友解闷。浮士德，与魔鬼订约而遍历人间百态的大学者，这不正是冯•诺伊曼的一生？\n冯•诺伊曼去世后，一切都不同了。曾经那么容易实现的事情，现在却困难重重。继任者们不明白，他到底是怎么搞来那么多钱？怎么招到那么聪明的人？“而且，说到底，我们为什么非得造一台机器呢？”冯•诺伊曼手下忠心耿耿的工程师们还梦想着造一台更好的MANIAC，用晶体管造，稳定性比真空管好得多……可是，这一台机器永远没造。源泉死了，源源不断的活力和创造便停歇了。普林斯顿高等研究院退出了计算机科学最令人激动的发迹史。接下来，将是IBM和MIT的天下。\n\n七、“告诉他们，我度过了极好的一生。”\n\n回到1939年，大战之前的最后一个学期。\n1939年2月13日，剑桥哲学系教授维特根斯坦走进“数学基础”课教室，失望地发现他的学生图灵今天缺席了，于是对班上宣布，因为图灵缺席，“今天的课只是参考性的”——要知道这门课的要旨就是听维特根斯坦和图灵吵架！这位27岁的年轻人刚从普林斯顿大学博士毕业，正在剑桥数学系以临时教员的身份教授一门同样叫作“数学基础”同样听者寥寥的课，不过维特根斯坦的课是关于“数学本质是什么”这个哲学问题，而图灵的课是关于“奠定数学基础的公理是哪些”这个数学问题。在维特根斯坦的课上，他喜欢把所有对数学基础的攻击倾数射向图灵，而图灵也很喜欢针锋相对地反击。两人激烈地争吵，而后发现自己对彼此领域的理解前进了一点。在这个常年一身运动衫、又紧张又内向的年轻人身上，维特根斯坦看到了三十年前的自己：除了思考最基本的问题，这世上没有其他事要做。三十年前，出生于欧洲最富有家族的维特根斯坦也是同样不修边幅地站在逻辑学家罗素面前，他急于从罗素口中知道自己有没有严肃思考最基本问题的才能：如果没有，他就预备去自杀。\n而今天，这个与自己惊人相似的年轻人图灵没有来上课 。图灵正骑着掉链子的自行车去“钟屋”(Clock House)——他心爱的克里斯托弗•马尔孔生前最常去的教区教堂。今天是马尔孔去世九年的祭日，马尔孔的父母决定以儿子的名义为教堂捐赠一个小礼拜堂。图灵坐在礼拜堂里参加捐赠仪式，对面的彩色玻璃窗上绘有圣徒克里斯托弗的事迹。亡友死后，彻底的无神论者图灵已经几十次来到这座教堂缅怀十七岁的夜晚，他和他从图书馆回宿舍一路上所谈论的雄心壮志：如何为科学做出真正的贡献。现在，完成了剑桥和普林斯顿的学业，这个雄心已经变得更加具体。他的脑中已经看到了一部精巧的机器，一部能完成所有“可能完成的”任务的机器。这不再仅仅是一台机器，也是对马尔孔的交代。\n多年之后，冯•诺伊曼教授会向美国政府保证，世上只需要十五台这样的机器，全部由像自己一样聪明的科学家操作，用以计算最重要的问题：弹道曲线、核反应方程、天文观测。而图灵的愿景在更深的地方：钻研过希尔伯特1928年三个问题的博士生图灵伤感地意识到，数学是不完美的，逻辑是不完美的，哲学是不完美的。即使在最抽象最笼统的意义上，我们仍然永远活在一个不完美的世界里，在这摇晃的地基上我们永远造不出任何完美的事物。我们必须不断修葺改造，在每一次稳固地基的同时试图变得更好。\n如果一台完美的机器是不可能的，那么能否造出一台不完美但是像孩童一样不断成长的机器呢？于是，图灵梦想着他的图灵机，那是一种可以不断读取自身修改自身的机器，在许多次失败的尝试后能学习到成功的诀窍。图灵梦想着许多图灵机连接在一起，一台提出问题，许多台都可以回答。可以是任何问题：从弹道曲线到老奶奶的购物清单到家庭旅行的地图路线。可以由任何人操作：从最聪明的科学家到小学肄业生，因为每台图灵机提供答案将经过更多的图灵机甄选。\n我们知道，冯•诺伊曼关于世界只需要十五台计算机的断言错了。世界沿着图灵的梦想延展下去，一个扁平的千姿百态的世界。我们知道，图灵的梦想已经那么熟稔地被今天的人类挂在嘴边：互联网、人工智能。\n回到1937年，文章一开头描绘的那个早晨。\n34岁的犹太裔教授冯•诺伊曼是家财万贯的公子哥，不过他一定是公子哥中最勤奋的一个。他每天五点起床，昨夜他派对宴请的朋友还一个个倒在沙发上打呼噜，他已经在书房里沙沙写了几页论文。九点开早饭，他停止工作走出书房，和留宿的朋友谈笑风生邀请他们下次再来。十点，他的凯迪拉克已经稳稳当当地停在帕尔玛物理实验室前面，他一身标志性的西装地走向相邻的数学楼，继续写论文。\n此时25岁的同性恋博士生图灵也已经穿着标志性的破运动衣沿着学校树林跑完了半程马拉松。他在树林里看到了几只英国见不着的颜色鲜艳的青蛙，几朵庞大的蘑菇，暗自好笑了一会儿。他到帕尔玛物理实验室捣鼓了一下自己的业余爱好——制造一台能做乘法的机器——然后穿过天桥走进数学楼，向办公室对门的冯•诺伊曼尴尬地打个照面，继续研究λ演算和图灵机。\n那时候，普林斯顿大学的数学楼和物理楼有一座天桥相连。爱因斯坦教授精神很好，每天穿梭天桥许多次在数学和物理之间来回奔跑。那是一个离我们遥远的伟大的科学年代，基础学科之间有许多天桥和地道相通，科学家从一个学科开始挖凿，最后挖到另一个学科的金矿。希尔伯特在世纪之初的著名演讲为几十年内的数学突飞猛进提供了指路牌，爱因斯坦1915年的广义相对论带来了一个崭新的宇宙观，一个个新化学元素接踵而至犹如上天的惊喜。集合论不过半个世纪，拓扑学才三十几年，量子力学二十年……在这个幸福的基础科学的时代，犹太人冯•诺伊曼和同性恋图灵坐在面对面的办公室里，这两种备受歧视的身份将困扰他们一生，可是此时，他们心无旁骛只有一个愿望：做一个数学家、数学家、数学家。\n幸福的数学家。", "useless_count": 1, "comments_count": 3, "alt": "https://movie.douban.com/review/7451964/", "id": "7451964", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 21, "author": {"uid": "mindmatters", "avatar": "https://img3.doubanio.com/icon/u108686108-3.jpg", "signature": "...", "alt": "https://www.douban.com/people/mindmatters/", "id": "108686108", "name": "如非"}, "created_at": "2014-11-18 13:24:47", "title": "机器中的幽灵", "updated_at": "2015-11-10 02:10:18", "share_url": "https://m.douban.com/movie/review/7197146", "summary": "尽管2012年图灵百年诞辰时，腐国进行了铺天盖纪念活动，展览、纪录片、电台节目，甚至发行了特别版邮票，但在中文世界里，图灵年还是被玛雅人的世界末日抢走了风头（其实可能只有在极客和哲学家的世界里的风头没...", "content": "尽管2012年图灵百年诞辰时，腐国进行了铺天盖纪念活动，展览、纪录片、电台节目，甚至发行了特别版邮票，但在中文世界里，图灵年还是被玛雅人的世界末日抢走了风头（其实可能只有在极客和哲学家的世界里的风头没有被抢走吧）。终于，大家再也逃不开他的传奇了，因为卷福强势出演，顶着好评如潮恢宏制作的Interstellar，带来了这部讲述图灵一生的The Imitation Game。影片中主要刻画了图灵和小伙伴们排除万难制造出破解德军密码系统的机器，协助盟军取得二战胜利的爱恨情仇。没错，就是这样，那位同志你不要翻白眼。\n\n作为卷福脑残粉，我可以很主观的说他对图灵大神的演绎精湛无比入木三分。卷福老爹的老爹和老爹的老爹的老爹都有政治军事背景，其中爷爷更是参加了两次世界大战的英国皇家海军指挥官。根据小时候我爷爷给我讲自己当兵故事那种孜孜不倦契而不舍的劲头，估计卷福在海军爷爷的影响下对这位幕后战争英雄图灵，也有着比其他人更深的情结。所以演的这么好，所以在一个不知道什么活动上说“他（图灵）是全世界最该被道歉的人”。\n\n我不懂电影不懂电脑也不懂军事，只能聊聊风花雪月名人轶事。\n\n如果一定要把计算机之父的头衔让给诺伊曼，人工智能之父肯定是非图灵莫属了。那个年代，笛卡尔的二元论还风韵尚存，唯心人文主义相信物质与意识是全然不同的东西，我们的思想或者说灵魂，是独立于我们的身体（也就物质）存在的。而图灵机为充满疑惑的挑战者们提供了绝佳的突破口——如果一台机器通过图灵测试，是否就能认为其有思考的能力。那这样的智能，是机器本体产生的，还是意识进入到机器里呢？\n\n哲学家们前仆后继永无休止的为此争论着，然而电影里的图灵大神在乎的只有机器里的幽灵，他心灵的保护者，精神的追逐——在度假中因为喝牛奶死掉的挚友Christopher。图灵终其一生研究能够思考的智能机器是为了让Christopher在物质世界重生，这种影射太讨巧，但看完电影的这一天晚上，我还是愿意相信它是真的（至少喝牛奶喝死了是真的）。太浪漫了，都教授的深情和虐心都只能放在一边了。你有过这样的追求和等待吗？路漫漫其修远兮，他一直在他身边，所以他才不孤独。\n\n人和人走的越近，就越容易觉得孤独，人永远也不能完全理解另一个人感受，了解另一个人的想法。图灵在审讯室里对警察说：机器能思考吗？我和你不一样，我的思考和你的思考的不一样，机器也和我们不一样，它的思考和人类不一样（不要纠正我，我哪里记得他原话怎么说的。。。）从Metropolis到银翼杀手到攻壳机动队再到Chobits和今年上映的She，人类对有情感的智能机器的探究和幻想从来没有停止过。\n\n如果真的出现了能和你在情感上交流的人工智能，你会使用吗？Ta完全为你的需求定制，没有要求，理解你，记得你的每一句话，而且永远不会背叛你。对于人工智能的研究像是在上山，越制作越复杂；而对于生化学、神经学的研究像是在下山，越分析越细致。他们相遇的那一天，或许就离我们面临这个选择时刻不远了。\n\n其实图灵对生化学世界也有很大的贡献，他死之前不久在通过一系列实验发表了关于一种神马神奇的抑制因子和一种神马神奇的刺激因子的理论。这两种因子和神马神奇的形态学有关，简而言之就是关于为什么你的手没有长成脚，为什么你家的奶牛这里长斑那里没长之类的问题，其实也就是关于所有生物为什么能长成自己现在的样子的问题，真是不明觉厉啊！\n\n在因为性取向违法而被化学阉割之后，图灵大神的工作和思考能力已经受到了相当程度的影响，这种影响之深之痛苦，从他戏剧性的自杀就可见一斑。我想，他之所以还能像打了鸡血一样研发出这种六十年后实验手段才终于予以证明的理论，一来他本来就是无神唯物主义者，甚至大脑的运作也有其化学物理基础（大神的远见啊！）。二来也是想知道为什么自己跟大多数人这么不一样，想要得到一个自己受到这些不公平待遇的真正的解释吧。\n\n最后讲一个电影里没有说，但是已经烂大街的故事。图灵把剧毒的氰化物（就是电影一开始他在地上撮的那小堆白色晶体）涂在苹果上，然后咬了一口，接着被装进了水晶棺材，遇上了有恋尸癖的白马王子，最后。。。不不不，咬了一口就没有然后了。有人说，图灵不是自杀，只是房间太乱不小心吃到的。也有人说，图灵选择选择这样自杀，是因为他最喜欢白雪公主的故事，特别是皇后把苹果浸入毒药的镜头。还有人说，苹果公司选择logo就是为了纪念这个故事（苹果公司多次遗憾的否认了该说法）。\n\n\n\nP.S. 看到关于图灵本体的最后一句记载，机器中的幽灵若有似无地叹了口气\n\nTuring was cremated at Woking Crematorium on 12 June 1954. \nHis ashes were scattered there, just as his father’s had been.\n\n白茫茫一片大地真干净……\n", "useless_count": 3, "comments_count": 8, "alt": "https://movie.douban.com/review/7197146/", "id": "7197146", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 8, "author": {"uid": "150938101", "avatar": "https://img3.doubanio.com/icon/u150938101-13.jpg", "signature": "", "alt": "https://www.douban.com/people/150938101/", "id": "150938101", "name": "奇小一"}, "created_at": "2017-07-28 22:45:41", "title": "技术宅拯救世界", "updated_at": "2017-07-28 22:45:41", "share_url": "https://m.douban.com/movie/review/8702625", "summary": "观完影片，不少人会爱上这个有着独特性格与非凡智力的人物，图灵对自己“心爱之物”执着追求，永不放弃。他的“心爱之物”一直没有变，一是作为人的“克里斯托弗”，一是作为机器的“克里斯托弗”（也就是之后家...", "content": "观完影片，不少人会爱上这个有着独特性格与非凡智力的人物，图灵对自己“心爱之物”执着追求，永不放弃。他的“心爱之物”一直没有变，一是作为人的“克里斯托弗”，一是作为机器的“克里斯托弗”（也就是之后家喻户晓的电脑）。我们可以用“技术宅”来形容图灵：闷在实验室，一门心思为了破解英格玛密码，并对自己的“作品”不离不弃。在遭遇重重打击与挫折后，他仍没放弃长久以来的信念与梦想。除了机器实验、推敲数据，爱情与友情对他来说都是多余的陪衬。克拉克的出现，让这一封闭的个体慢慢认识到自己需要改变以顺应这一动荡的社会与环境。电影中接近三分之一的情节都集中在布莱切利园的解码室中，这一稍显沉闷的环境与图灵儿时常被同学欺负关闭在木制的地下室有关，而这正是图灵的人格形象及形成的原因。\r\n影片并未局限在此，通过平行叙事与交叉叙事的方式，不仅交代了图灵众所周知的故事，而且用一种隐晦的手法透露出他不为人知的秘密。整个影片的主旨内涵一共出现过两次，即“有时候正是人们不报期望之人做出了人们不敢期望之事”。这句话第一次是从图灵之口说出，目的是为了能够让琼·克拉克前往布莱切利园共事；第二次则是在影片结尾，琼·克拉克用这句曾经点醒她的话激励图灵。在舍本公学学习的图灵，从小就是一个沉默寡言之人，与周遭的孩子们相处都不太融洽，也在那里，他逐渐发现了自己的性向，与一名叫克里斯托弗的男孩越走越近。儿时的记忆中，他是一个经常被欺负的“怪胎”，对暴力嗤之以鼻的他，却沉浸在自己的世界中无法自拔，而在克里斯托弗死后，他凭借自己在数学方面的天赋，获得博士学位并进入英国政府破译二战德军密码。无论是在母亲与同学歧视下生活的图灵，还是在当时社会对女性歧视的环境下成长的克拉克，这句话都有着自己的价值。可以说，这句话拯救了克拉克，却最终没有让图灵释然。图灵的生活原本平淡而简单，克拉克的出现打破了这一局面，让图灵能够更加专注在自己的工作上，而克拉克同样是为事业奋斗的女人。这一兴趣点让两人的关系上升到一种能够类似于灵魂伴侣的状态，甚至在图灵告知自己的性取向后，依旧没有改变，尽管有过口角的争执，但是最终都冰释前嫌。人生的意义，不仅仅需要的是有自己的喜欢的事业，而且更加需要拥有灵魂上的知己。幸好，在图灵自杀前，他已经拥有。不幸的是，科学界失去了一位顶尖的人才。\r\n\r\n影片中，没有过多地描画图灵的同性恋问题，用一段公学期间的青春往事与英国警方的指控表现这一稍显晦暗的部分，而着力笔墨在图灵破解Enigma英格玛密码系统与对计算机智能化的伟大事业上。热爱长跑的部分，被用来作为影片的过渡衔接。相比现在的英国，1885年至1967年间约有49000同性恋依照英国法律判为有罪，同性恋可以说是禁忌。不论是拥有多么重要的地位与权力，一旦被发现与同性恋相关，便会坠入万劫不复的深渊。正如影片最后，图灵被强制进行化学阉割以治疗同性恋。这一非人的治疗，使得图灵的身心遭受到难以磨灭的伤害与痛苦，甚至无法进行自己最爱的猜字游戏。对于同性恋身份的挖掘，导演可谓层层深入，从图灵公学阶段进行，到遇到克拉克后，困惑自己的性取向，随之纠结与克拉克的婚姻问题。这无疑加重了该人物的复杂性，同时也更好地交代了时代的背景。在人物塑造上，男主角本尼迪克特·康伯巴奇并没有刻意突出图灵的口吃问题，以使得这一人物的“残障”问题过于生硬，而是放置在诸多细节描画，诸如与同事间的交流障碍、即将破解英格玛密码前穷追不舍的问题，这样一来，这一人物更加有血有肉，不仅仅是个留在表面的形象构建。与他对手戏最多的凯拉·奈特莉，也奉献了较为出色的表演，这一冲破社会偏见的女性形象，在经历与图灵的多次人生或者工作探讨后，发生了微妙的变化。不同于以往女性角色，这一女性角色多了不少内心的坚韧，甚至在得知图灵的性取向后，仍能坦然接受，并且最终实现了自己的价值，拥有了属于自己的工作、丈夫与正常的生活。当然，这一女性形象并未有图灵这一人物的形象复杂，可以视为另一个了解图灵的突破口。\r\n\r\n作为一部人物传记片，《模仿游戏》比较完整地交代了图灵一生中的重要故事，并留下了诸多值得思考的问题,对于同性恋的问题，对于战争的态度，以及对待生命的思考。导演在最后用一种开放式手法交代了图灵的自杀——关灯走向自己一生钟爱的机器。那是一个无法宣泄的时代，不可以袒露自己的真实身份，不可以违背常人眼中的价值观。然而，那是一个可以纵情狂欢的时代，可以肆无忌惮追求自己的梦想，可以将所得的一切统统烧毁；那是一个创造奇迹与历史的时代，因为图灵的贡献，我们才可以坐在电脑前，敲打出这些文字……", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/8702625/", "id": "8702625", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 8, "author": {"uid": "stupidcat7652", "avatar": "https://img3.doubanio.com/icon/u1181949-142.jpg", "signature": "不再执着。", "alt": "https://www.douban.com/people/stupidcat7652/", "id": "1181949", "name": "傻乐的猫"}, "created_at": "2015-02-03 22:47:52", "title": "图灵", "updated_at": "2015-07-27 21:07:33", "share_url": "https://m.douban.com/movie/review/7367115", "summary": "1 10几年前和秋姐聊图灵的时候就聊过，这个人必须拍成电影吧，Maybe会有一天吧。真心话，这一天来的比想象中早。  2 其实图灵对于解码的热爱远超过救国救民的情怀，技术宅关注的只是他自己兴趣以内的事。这和陈蝶...", "content": "1 10几年前和秋姐聊图灵的时候就聊过，这个人必须拍成电影吧，Maybe会有一天吧。真心话，这一天来的比想象中早。\n\n2 其实图灵对于解码的热爱远超过救国救民的情怀，技术宅关注的只是他自己兴趣以内的事。这和陈蝶衣给日本人唱戏本质一样。科学和艺术，是超越政治的。\n\n3 但天才也是人类，他时刻都活在政治里，因为他活在人的世界。形婚，与苏联间谍共事，直至最后因性向被逮捕。\n\n同性恋定罪，就是典型的多数人对少数人的暴政，天才也逃脱不了，所以剧情的最后部分，就是给天才一记耳光。\n\n而这种无助感，观众不需要是天才，也不需要是同性恋，都可以代入，个体在群体政治面前的无能为力。\n\n4 配乐标签太强了。\n\n5 Kk终于选对角色，影史最迷人beard。白羊女的阳光气质照亮全场，这些年来为了“突破”接演一系列怨妇作女简直是自己找墙撞，这次重新找回方向感。\n\n6 Bc不止一次提到英国政府欠图灵一个道歉（免除“定罪”无异于笑话），这部电影算道歉吗？它过于工整，过于中规中矩，过于意料之中。\n\n一个好学生的四平八稳的好作文，改变不了得事实是，它还是一篇好作文。\n\n7 100分钟时本该是一部剧情片的尾声，战争结束各自归位，最后来个几分钟的多年后回忆适当煽情。谁知会有后来的狗血抓马，英雄反落难，这本该是发生于前苏或某国的剧情吧....\n\nreality is always stranger than fiction.\n", "useless_count": 1, "comments_count": 3, "alt": "https://movie.douban.com/review/7367115/", "id": "7367115", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 12, "author": {"uid": "120187474", "avatar": "https://img3.doubanio.com/icon/u120187474-5.jpg", "signature": "", "alt": "https://www.douban.com/people/120187474/", "id": "120187474", "name": "冷山"}, "created_at": "2016-03-13 20:17:42", "title": "让人痛哭的图灵", "updated_at": "2016-03-14 22:00:07", "share_url": "https://m.douban.com/movie/review/7811012", "summary": "看到卷福的头像，点进这部影片。我不是文化人，所有知识都是随心所欲的兴趣，零零碎碎地充斥在脑海，所以不了解历史。那些曾经的二战战争片谍战片就是了解第二次世界大战的主要来源，所以有这么一个神奇的人物创...", "content": "看到卷福的头像，点进这部影片。我不是文化人，所有知识都是随心所欲的兴趣，零零碎碎地充斥在脑海，所以不了解历史。那些曾经的二战战争片谍战片就是了解第二次世界大战的主要来源，所以有这么一个神奇的人物创造的惊人传奇历史让我如观看好莱坞经久不衰的英雄情结片一样津津有味。然而，最后却在哭泣的心碎中gameover。\n片名是模仿游戏，不知道为什么取这名儿，就只觉人生的辉煌个人的创造再怎么推动或影响了历史的进程，似乎都只是game。他颤巍巍地站在他的爱人前，慢慢地关上灯，蹒跚步入暗。怎么回味都只剩心痛。\n我们时常斗争每每呐喊，家庭，工作，朋友圈，争的是眼前自己的那一小块蛋糕，喊的是自己受的那过眼即散的委屈。没有人似他，不被理解反被伤害，却始终保持的热情善良正义痴情，那样改变造福了人类，回馈于他如此，真正令人绝望不已。", "useless_count": 0, "comments_count": 3, "alt": "https://movie.douban.com/review/7811012/", "id": "7811012", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 18, "author": {"uid": "huaxiren", "avatar": "https://img1.doubanio.com/icon/u1896669-58.jpg", "signature": "Luke, use the force.", "alt": "https://www.douban.com/people/huaxiren/", "id": "1896669", "name": "珍珠"}, "created_at": "2015-01-26 00:05:56", "title": "感想。短评不够才写在这里", "updated_at": "2015-07-24 00:57:42", "share_url": "https://m.douban.com/movie/review/7356789", "summary": "本片据以改编的《图灵传》我没看懂，数学不够。只好退而求其次，看了维基百科的生平。就已经震撼到了。这个人太不可思议了，脑子不知道是怎么长的。而且是长跑健将，人又那么帅，个性貌似也萌... ...传奇中的传奇...", "content": "本片据以改编的《图灵传》我没看懂，数学不够。只好退而求其次，看了维基百科的生平。就已经震撼到了。这个人太不可思议了，脑子不知道是怎么长的。而且是长跑健将，人又那么帅，个性貌似也萌... ...传奇中的传奇。\n\n加上《模拟游戏》从上映以来就好评不断，因此对这个片期望很高。\n\n不合耐不住好奇，下了一个版本来看。画质其实也不错，字幕也好，但在电脑上看，屏幕小，环境吵，脑子里来来去去的杂事也无法清空，配乐没有注意到... ...第一遍看完觉得小失望。觉得把图灵给简化了，脆弱化了。那么了不起的一个人，格局应该更大，情感应该更不可捉摸。这片似乎是真实图灵的一个公仔，小尺寸，有夸张，略可爱。制作群对他充满敬意，过于小心翼翼。\n\n庆幸的是，因为跟坡县的影迷伙伴早就约好一起面基看本片，所以昨天去大银幕又看了一遍。这一遍，看哭了。\n\n还是不一样的。大银幕的效果－－画面的细节和表演的力度，以及配乐的感染力，尤其是配乐，使这次的观影体验比较融会贯通，体会到了片子试图表现的图灵的多面性，也理解了片子整体的阴郁格调是必要的。图灵的性格也许不是这样古怪不通世故，他的感情线也许不是这样从少年直接联系到中年。但也许是。电影需要戏剧化，需要观众的同情。如果他一直高大上，又怎么让观众接受他的结局？他的结局，没有人能懂。但是电影需要给观众一个交代。\n\n本片是一种诠释，它不必展示图灵的全貌（虽然它尽力想这么做）。没有人知道图灵的全貌。\n\n作为一种诠释，它已经做得相当圆满。\n\n表演是一级棒。BC其实面临陷阱。左有夏洛克，右有谢耳朵，一个不小心，图灵就会像他们，捏一把汗哪。虽然我心目中的图灵要更加英气勃勃，但是BC的这个图灵聪明呆萌得自成一格，多了凝重、绅士风度和一点点不修边幅，并不会跟小夏小谢混淆。以及，少年图灵的小演员他们是哪儿找的？？？这个孩子太好了。校长室那场戏，所有怪阿姨的心都跟着他的大眼睛碎掉了。\n\n电脑上看的那遍很多时候顾着看字幕，没有看到配角的表现，大银幕全看到了。真舒服，个个都舒服。Matthew Goode... ...啊... ...（你等一下再啊）, Charles Dance, Mark Strong。。。多么熨贴啊。以及各种四十年代西装军装。嗯嗯嗯。\n\n总之，这片虽然不能全面展示图灵的伟大，但围绕一个事件向世人介绍了关于图灵的几个关键词，片子本身稳妥精致，自给自足。重要的是，最后我哭了。\n\n中间的幽默也很不少。电影院里笑声不断。\n\n真希望我能读懂图灵写的东东。唉。了不起的人哪。\n\n\n\n完\n\n\n终于可以啊了：Matthew Goode... ...啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊......................\n\n\n\n\n", "useless_count": 9, "comments_count": 11, "alt": "https://movie.douban.com/review/7356789/", "id": "7356789", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 11, "author": {"uid": "colinpark", "avatar": "https://img3.doubanio.com/icon/u49097402-173.jpg", "signature": "The Great Clown Pagliacci", "alt": "https://www.douban.com/people/colinpark/", "id": "49097402", "name": "西帕克"}, "created_at": "2015-07-20 14:35:02", "title": "图灵的玫瑰花蕾", "updated_at": "2016-01-29 17:34:00", "share_url": "https://m.douban.com/movie/review/7540779", "summary": "《模仿游戏》：图灵的玫瑰花蕾                                文：西帕克  被称为“人工智能之父”的艾伦•图灵，可谓是人类历史上最伟大的科学家之一。他是天才数学家，发明了最初的电脑技术，他的图灵测试...", "content": "《模仿游戏》：图灵的玫瑰花蕾\n                               文：西帕克\n\n被称为“人工智能之父”的艾伦•图灵，可谓是人类历史上最伟大的科学家之一。他是天才数学家，发明了最初的电脑技术，他的图灵测试证明了机器也可以像人一样思考。他在二战时领导的破译小组破获了德国最先进的英格玛密码电报系统，帮助盟军提早两年赢得了二战，拯救了1400万条生命。而在战后，他却因为同性恋行为获罪，被化学阉割，在1954年41岁时食用氰化物泡过的苹果自杀身亡。直到2013年，伊丽莎白二世才追授图灵特赦，还其清白。如此传奇的人生，足以拍摄好几部电影大作，非一部电影所能承载。但莫滕•泰杜姆导演的《模仿游戏》，却靠着出色的叙事手法和类型片包装，最终将图灵的生命传奇呈现在大银幕之上。为了全景展现图灵的一生，泰杜姆选择了较为复杂的叙事手段。\n     在横向上，影片将电影分成童年时期、二战时期和战后时期三条叙事线索并行。泰杜姆在电影一开始便给观众抛出了两个悬念——什么造就了图灵的天才，以及战时到底发生了怎样的秘密。为了解开这两个线索，影片在三条叙事线间切换，以不同时空同时展开的故事解开疑问。如此抽丝剥茧，让《模仿游戏》中的图灵成为了一个“公民凯恩”式的复杂人物。“卷福”本尼迪克特•康伯巴奇饰演了图灵这个全片的灵魂人物，而这类角色也正是他所擅长的。影片中的图灵如同剧集中的夏洛克一样，是一个傲慢、自大、直来直往、缺乏交际能力，但同时亦是一个极端沉溺于自我世界中的天才。与夏洛克的主创们总是刻意不指出其主角的性取向不同，泰杜姆则选择了让角色直面自己的同性恋身份，并展现了同性恋者在当时受迫害的地位，也成为全片最终悲剧的铺垫。\n在纵向上，电影极富创新性地将传记片代入了传统谍战类型片的叙事领域。在电影的前半段，故事的重心放置在位于布莱切利的谍报小组如何破解德国英格玛密码的故事。在这其中，既有图灵如何排除万难，取得同事信任，将小组从错误的方向上拉回，制造原型电脑的主线，同时亦有寻找内鬼，破除偏见，甚至还描写了图灵和穷的“革命爱情”等经典类型片桥段。而泰杜姆则秉承了一切从人物出发的原则，引导观众对图灵的好奇与喜爱，将这些可能会落入俗套的桥段以令人信服的演绎。而当密码被破除后，叙事则进入了更深的道德层面，小组必须扮演上帝的角色，以完全数学化的方式影响战争走向，而同时亦不能被德国所发现，为类型叙事增加了深度。同时，新的矛盾也被提出，即人是否可以扮演上帝决定生死。\n 当客观的数据面对人情，所有的抉择都极其艰难，而这也是时代更迭的前奏。当人脑面对电脑，图灵选择了电脑，而站在当代观众的角度，正是这样的选择，让我们步入了全新的信息时代。图灵一直在试图模仿正常人以融入时代，但同时他也以自己的发明开启了新的时代，他的思考模式被认为是异类，但也只有他这样非一般的思考方式才能为人工智能设计一套纯理性的思考方法。所谓“模仿游戏”，既是图灵对世人的模仿，亦是电脑对人脑的模仿，更是未来我们对电脑思考方式的模仿。图灵靠发明电脑，最终让所有人都学会了以他的方式进行思考。\n     影片的最后，图灵终于透露了自己发明电脑真正的初衷，即怀念他少年时期逝去的爱人克里斯托弗，让一部充满惊险与传奇的作品，回归到朴实的同志之爱，这和《公民凯恩》中凯恩失去童年的“玫瑰花蕾”如出一辙，将一个复杂的天才简化到最纯真一面。由复杂到简单，由繁复到细腻，正是本片真正的过人之处。如今，本片即将于今年7月21日登陆国内银幕，证明了官方与大众对图灵这样“异类”的接受与支持，不管戏里戏外皆是创举。\n", "useless_count": 2, "comments_count": 1, "alt": "https://movie.douban.com/review/7540779/", "id": "7540779", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 13, "author": {"uid": "158195982", "avatar": "https://img3.doubanio.com/icon/u158195982-24.jpg", "signature": "", "alt": "https://www.douban.com/people/158195982/", "id": "158195982", "name": "工藤新一"}, "created_at": "2017-07-12 17:08:23", "title": "天才是一种孤独的信仰", "updated_at": "2017-07-12 17:08:23", "share_url": "https://m.douban.com/movie/review/8661413", "summary": "没有人见过上帝，上帝将他的旨意付托在少数被称为天才的人身上。当那些不可思议的创造最终展示于世人面前，我们在天才所承受的苦难里，在他们曾经独自跋涉的足迹中，看到了神的存在。 天才往往都是讷于言表的。上...", "content": "没有人见过上帝，上帝将他的旨意付托在少数被称为天才的人身上。当那些不可思议的创造最终展示于世人面前，我们在天才所承受的苦难里，在他们曾经独自跋涉的足迹中，看到了神的存在。\n\n天才往往都是讷于言表的。上帝为他们私下开了一扇窗，朝向自己，聆听自己，解析天地之间的密语；却同时关上了一扇门，将他们和世人隔开，无法交流。于是象图灵这样的人，变成了看见鬼魂的小孩，知不能言，苦不能语，只好藏在心里，变成一种宿命的孤独。\n\n天才最大的痛苦并不在于外界的嘲讽和追逼，大不了闭上眼睛、捂住耳朵，他们所需要的，可以少到只剩一支笔和一点氧气。漫漫长路上，失败与等待造成的自我怀疑，四下漆黑、周围冷硬，前景未卜却必须坚持下去的恐惧，才是真正的敌人。象荒野里迷途的旅客，终于找到夜空中那一颗冷峻而亘古的星，对真理与美的固执，对超越凡俗的向往，最终成为图灵们的信仰。他独自转山转水，匍匐祈祷，直到与上帝途中相遇。\n\n世人都爱天才，怜惜他们的笨拙、木讷、敏感、不知所措，在屏幕前为他们揪一颗心捏一把汗。可是在天才得到世俗的证实之前，人们所热衷的，却是朝他们吐口水，扔石子，戴荆冠……残害任何异于自己的生命，毁掉所有自己无法理解的思想，竭尽所能去化身天才取经路上的九九八十一难。这就是人类，他们企图慈悲，却往往残忍。\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/8661413/", "id": "8661413", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 14, "author": {"uid": "150805728", "avatar": "https://img3.doubanio.com/icon/u150805728-1.jpg", "signature": "", "alt": "https://www.douban.com/people/150805728/", "id": "150805728", "name": "小人鱼"}, "created_at": "2017-03-15 14:19:19", "title": "艾伦·图灵传奇的一生", "updated_at": "2017-03-15 14:19:19", "share_url": "https://m.douban.com/movie/review/8417637", "summary": "昨天在朋友的推荐下看完了这部电影，内心非常震撼。这部电影曾获奥斯卡提名，这是对这部电影本身的肯定，首先来说最精彩的就是剧情。 这部电影讲述了计算机天才艾伦·图灵的传奇一生，作为一位伟大的英国数学家及...", "content": "  昨天在朋友的推荐下看完了这部电影，内心非常震撼。这部电影曾获奥斯卡提名，这是对这部电影本身的肯定，首先来说最精彩的就是剧情。\r\n这部电影讲述了计算机天才艾伦·图灵的传奇一生，作为一位伟大的英国数学家及逻辑学家，图灵曾在二战期间破解德国著名的密码Enigma，被誉为“计算机科学之父”。《模仿游戏》主要聚焦于艾伦·图灵在40年代以前的经历。2015年2月，《模仿游戏》获得第27届南加大图书馆编剧奖“最佳改编剧本”和第87届奥斯卡金像奖最佳改编剧本奖。本尼迪克特·康伯巴奇饰演的图灵是著名的同性恋之一，并因为其同性恋倾向而遭到迫害，使得他的职业生涯尽毁。在学校期间，他因为在数学上表现出惊人的天赋而被同学嫉妒，经常受到许多同学的欺负。1952年，他的同性伴侣协同一名同谋一起闯进了图灵的房子实施盗窃。图灵为此而报警。但是警方的调查结果使得他被控以“明显的猥亵和性颠倒行为”。他没有申辩，并被定罪。在著名的公审后，他被给予了两个选择：坐牢或荷尔蒙疗法。他选择了荷尔蒙注射，并持续了一年。之后图灵选择了自杀。\r\n最大的看点就是图灵在二战中研究协助军方破解德国著名密码系统Enigma的机器，一开始图灵的计划并不被看好，也一度受到质疑，后来在他的努力下，开始与全英最著名的破译密码天才的同伴儿们进行研究。在一次又一次的失败中，他们没有放弃，最终研究成功。但是这项成果由于机密性却不能公之于众，最终图灵和朋友们将所有的科研资料扔进了熊熊大火中，将一切化为灰烬……\r\n艾伦·图灵的伟大发明拯救了成千上万人民的生命，他对于人工智能的发展有诸多贡献，著名的图灵机模型为现代计算机的逻辑工作方式奠定了基础。这些人在历史上有太多太多，他们赢得了所有人尊敬。\r\n", "useless_count": 3, "comments_count": 0, "alt": "https://movie.douban.com/review/8417637/", "id": "8417637", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 9, "author": {"uid": "RiverPheonix", "avatar": "https://img1.doubanio.com/icon/u1205892-9.jpg", "signature": "满红满蓝，全处全收", "alt": "https://www.douban.com/people/RiverPheonix/", "id": "1205892", "name": "大卫·独处尼"}, "created_at": "2015-09-22 13:56:50", "title": "一个为影迷量身定制的图灵", "updated_at": "2015-09-22 13:56:50", "share_url": "https://m.douban.com/movie/review/7605260", "summary": "   在过去的这个国产电影保护月里，有几个奇怪的东西混了进来，比如说《小羊肖恩》，还有《模仿游戏》。因为知道《模仿游戏》会在大银幕上上映，所以我一直憋着没看，如今终于得偿所愿。但就像原著党一样，对计算...", "content": "   在过去的这个国产电影保护月里，有几个奇怪的东西混了进来，比如说《小羊肖恩》，还有《模仿游戏》。因为知道《模仿游戏》会在大银幕上上映，所以我一直憋着没看，如今终于得偿所愿。但就像原著党一样，对计算机之父图灵稍有了解的我看完电影，感动之余不免有些疑惑，这图灵真实吗？\n\n    首先夸奖一下“卷福”，他不愧是这个星球上最适合扮演天才的演员。他自身携带的敏感、笨拙、傲娇的气质，和天才的属性极为契合。为了塑造这种气质，影片可以说是不遗余力。比如当图灵面试的时候，主管问他是不是个天才，他表示说可能不是。正当观众以为他在谦虚的时候，他拿自己和牛顿、爱因斯坦做了一下对比，然后说稍有不如。这种炫富方式绝对是要遭雷劈的。再比如他年少时在学校吃午饭的时候，要把盘子里的胡萝卜和绿豆完全分开，泾渭分明，这是在表示他有强迫症吗？还有他完全不通人情世故，言语直接、笨拙，伤人于无形之中。最后，当图灵的同性恋身份曝光，被法律判处化学阉割的时候，他整个人都崩溃了。\n\n    这形象是不是似曾相识？如果你看过《生活大爆炸》的话你会觉得这就是谢耳朵啊，如果你看过《雨人》的话会认为这不是雷蒙吗？还有前些日子去世的数学家纳什，他在传记片《美丽心灵》里也是这样不食人间烟火。然而可能问题就出在这里了，这个“基本款”的天才气质并不能涵盖各类天才，比如牛顿其实是一个凶残的学霸，而爱迪生则是一个市侩的商人，他们整起人来毫不手软。天才，不都是像谢耳朵那样无害。\n\n    历史上的图灵，当然也和电影里不大一样。据书评人尼克介绍说，BBC做过几次对熟悉图灵的人的采访，大家都认为他是平和的、比较容易沟通的人。图灵不乏幽默，看过他的文章就能体会到，《计算机与智能》就有几处英式调侃，让你不得不多看几遍。而真实的图灵，也从来没有像电影里那样掩饰自己的同性恋身份。不同于电影里图灵在试图和未婚妻分手时才暴露自己的同性恋身份，真实的图灵求婚的时候就把真相跟未婚妻讲了。他当时以为同性恋是可以改变的。而当图灵被“指控”为同性恋的时候，他一直是宣称自己无罪的。这和电影里表现出来的那个崩溃的图灵截然相反，可能正是因为图灵积极的态度，所以人们对于他的死亡持有疑问。这不像是一个会去自杀的人啊。\n\n    对于电影改编的图灵，传记的原作者霍奇思并未公开表态，但在私下里他向友人抱怨，说电影打着他的旗号胡编乱造。可有趣的是，这部电影最终获得了奥斯卡最佳改编剧本奖。这可能给了我们为什么电影要塑造这样一个图灵的答案。因为观众需要这样的图灵，奥斯卡需要这样的图灵。\n\n    对于观众来说，一个天才的白痴是喜闻乐见的。谁会愿意去欣赏一个智商和情商同时碾压你的家伙呢？那太受挫了。同情心，往往建立于优越感之上。只有在对方的缺憾里找到了优越感，获得了怜悯他人的自我满足，人们才会有心情去讴歌对方的天才和丰功伟绩。所以，电影中的图灵也许和真实的图灵相去甚远，但却很符合观众心目中的天才形象。其实这样的道理不仅仅表现在看电影这样的小事上。哲学家萨义德对西方文化的批评也是基于这个道理。在他看来，西方人看到的东方并不是真实的东方，而是他们想要看到的东方，他们从中获得种族的优越感，以及对异族的同情心。\n\n    对于奥斯卡来说，他们也需要一个正能量的图灵。所以影片对于图灵被迫害的描述点到为止，而是把大量的笔墨花费在他是如何率领团队攻克德国“英格玛”密码机的。影片也彻底回避了关于图灵的死因这个最大谜团，因为那太过黑暗了。这就不得不提到这部电影的发行方，大名鼎鼎的奥斯卡“掮客”韦恩斯坦公司。从《莎翁情史》到《国王的演讲》，他们总能够搔到奥斯卡评委的痒处。很多证据表明，韦恩斯坦的接手对影片影响非常大。想想电影的开头，当图灵走下火车，车站大喇叭里播放的正是“国王的演讲”。这是在强调这部电影的血统吗？\n    当然，如果排除掉“原著党”天生的敌意，以及“如果不装腔作势一番这影评就平庸了”之类的想法，我得承认这是一部励志、感人的传记片。但面对一个谜一样的图灵，影片还是太过温柔和讨巧了。就像一位美国影评人说的那样：问题是世界上关于最杰出天才和开拓者的传记都会对他所遭遇的巨大磨难加以掩饰，这都是为了少数奥斯卡提名和更为传统的“励志故事”。为什么一个关于英年早逝的天才同志被自己的国家所迫害毁灭这样的故事还不够？为什么不强调故事的悲剧，让观众不只是在那时，而是在现在对人权问题充满激情？  \n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7605260/", "id": "7605260", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 2.0, "min": 0}, "useful_count": 11, "author": {"uid": "zinking", "avatar": "https://img3.doubanio.com/icon/u3178064-2.jpg", "signature": "No Mistakes", "alt": "https://www.douban.com/people/zinking/", "id": "3178064", "name": "zinking"}, "created_at": "2015-03-05 10:27:51", "title": "妖魔化的图灵", "updated_at": "2015-06-05 11:19:01", "share_url": "https://m.douban.com/movie/review/7396859", "summary": "显然每个对计算机感兴趣的人都会被“图灵”这个词吸引， 不过这部描写图灵生平的传记电影实在是差强人意。  个人最诧异的是图灵提出要保护他们已经破解了Enigma机器的这个事实。 乍一听十分有道理， 如果敌人已经...", "content": "显然每个对计算机感兴趣的人都会被“图灵”这个词吸引， 不过这部描写图灵生平的传记电影实在是差强人意。\n\n个人最诧异的是图灵提出要保护他们已经破解了Enigma机器的这个事实。 乍一听十分有道理， 如果敌人已经知道Enigma被破解那么之前所有的努力也就白费了。 但我觉得这果然是编剧的想法，典型的文科生思路。 首先电影把图灵塑造成一个十分傲慢的人， 那么这个傲慢的人怎么突然就承认自己智商有限没法破解出另一个Enigma设置了？ 而且这种研究上的努力显然不会白费。 \n\n还有那造作的煽情片段， Peter请求图灵公布解密信息那段。 我感觉非常的矫揉造作而且不觉得感动，这种才应该是要减掉的片段。\n\n其实看到这部电影的名字，脑海里浮现的第一幅画面就是图灵咬了一口毒苹果死去的样子。 然后导演居然把这个画面剪掉了！ WTF，觉得毛骨悚然不能重新好好拍么？\n\n好了说了那么多不好的，说些好得吧。 导演显然还是想尊重事实的，Enigma机器的外观，其中的一些机器部件，这些细节说明导演还是看过Wikipedia的。 导演显然还是多讲些关于图灵的东西的，可惜脑力不够， 以至于你只能在电影的各片段里看到那些事情的只言片语。 比如图灵测试就在对话中一带而过，比如苹果的梗。 \n\n期望太高了，才会有这种评价。\n\n", "useless_count": 3, "comments_count": 2, "alt": "https://movie.douban.com/review/7396859/", "id": "7396859", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 17, "author": {"uid": "SydneyCarton", "avatar": "https://img3.doubanio.com/icon/u1210604-80.jpg", "signature": "直男癌", "alt": "https://www.douban.com/people/SydneyCarton/", "id": "1210604", "name": "SydneyCarton"}, "created_at": "2015-07-21 10:19:13", "title": "图灵是怎样炼成的", "updated_at": "2018-09-14 23:31:09", "share_url": "https://m.douban.com/movie/review/7541765", "summary": "对于艾伦•图灵的研究者来说，《模仿游戏》可能并不会令他们满意：这部将布兰切利庄园破译德军英格玛密码机作为主线的影片，只是放大了图灵生涯的片段，而且对图灵的大量事迹甚至包括个人性格都进行了大刀阔斧...", "content": "对于艾伦•图灵的研究者来说，《模仿游戏》可能并不会令他们满意：这部将布兰切利庄园破译德军英格玛密码机作为主线的影片，只是放大了图灵生涯的片段，而且对图灵的大量事迹甚至包括个人性格都进行了大刀阔斧的调整。不过，对观众而言，影片对史实的手术不仅必要而且整形异常成功——毕竟，你在电影院里要看的是故事，而非历史课教学PPT。\n\n虽然破译一节在整个二战史以及图灵的个人经历中都是浓墨重彩，且传奇性甚浓的篇章，不过，文字上夸张而丰富的表述并不困难，难的是影像化的实现。想象一下吧，一群数学家破译密码，说起来神乎其神，但你愿意在大银幕前看一帮宅男愁眉苦脸蹲在房间里做两个小时的奥数吗？关键是，怎样在其中提炼出一条清晰的线索。看看同样题材的影片：2001年的《密码拦截战》直接虚构了一个悬疑加爱情的狗血故事；更早一年的《U-571》则直接忽略了破译，将潜艇运送缴获的德军密码机过程作为重头戏，一下子成了动作战争片，据说当时还引起了英国方面的抱怨——功劳都被美国人拿去吹了。这样一比，《模仿游戏》的妙处就突显出来了。因为，它的着眼点不是事，而是人，甚至并非那个历史上的图灵，而是它意图让你看到的艺术形象图灵。\n\n影片直接拉了三条线：1928年尚在中学的图灵，二战期间破译密码的图灵以及战后因同性恋遭受迫害潦倒的图灵。迫害线以罪案开局，先用悬疑将观众的好奇心牵起，但很快将此线按下不表，只是不断在推进中出现。办案警察就像《公民凯恩》中的记者，与其说是戏中角色，不如讲他代表了观众视角，他在每个调查节点处提出的疑问也恰是观众所想了解的，通过他的步步进逼，段落之间有效收紧。而在悬疑慢慢破解开之后，观众的兴致已经从追溯过去式的解谜，转变成了追问未来的关注人物命运。在此时，警察适时地表态，又起到了观众评论音轨的作用，并且在最后力推一把，触发悲剧高潮。\n\n而图灵的早年学院生涯，则是与迫害线相对应的解答线，它出现的时间最迟，某种意义上可将其看做传记片编剧最爱的“童年阴影”。图灵的性格成因与性取向的萌芽大体可以在这条线中看出端倪，然而这条线与迫害线相比又不只是柯南动画中的“谜题篇”与“解谜篇”。不用看情节设计，单看两线色调，对比已足够明确：迫害线一派的灰蓝暗郁，而学院线哪怕也有图灵被欺负的情节，但确实明黄偏橙的亮丽色彩，两线交替出现，从洒满阳光记忆的玫瑰色春梦，到阴冷潮湿的惨烈收场，主人公遭遇的不公呼之欲出。这条学院线在情节上并不关键，但拍得极为抒情，因为越是渲染出这一段的单纯美好，越是能和情节饱满的另两支突显出天才遭遇的人情冷暖。\n\n最关键的一条解谜线，重点肯定不能老老实实地写如何解谜。谁愿意看解数学题啊？就连小学生作文里写到做题都知道要塞无聊的心理活动甚至虚构一段如何克服心魔不去抄同桌的烂桥，何况电影——哪怕做题人是粉丝甚众的本尼迪克特•康伯巴奇。所以，影片的落脚点是图灵与周围所有人的关系演变。这就是为什么直女琼•克拉克居然被拎出来在一位同性恋主角的影片里成了女一号，这就是为什么事实与图灵关系甚佳的休•亚历山大被拖出来唱了好一阵子白脸，这就是为什么剑桥五杰的谍战大片要从外交部和学院挪移到布兰切利，这就是为什么军方人士要跟伤痕文学里的军代表一样隔三差五跳出来恶心人，甚至还要把考文垂悲剧进一步强化到人物关系中，编出一场为大局而牺牲小我、独自承受“必要之罪”的虐心大戏。至于真正的解谜，影片只是用一段精彩的蒙太奇，把情报对战局的影响表现清晰，同时再以海陆空的战争镜头顺带拓展了一下影片格局便不再深入。而在这过程中，图灵与周围人物的互动与其说是讲解谜故事，不如说是表现出周围环境与他的格格不入，怎么一步步将他推进灾难的深渊——实际上除了确实倒霉的结局，图灵远没有片中主人公那么悲催。除了解谜不好表现，还有其他理由这样做吗？当然，对立面的设计。抗日剧为什么火？因为有个“日”作为对立面可以让你乐此不疲地一直“抗”着。但纳粹再恶劣，也无法跟图灵隔空比拼内力吧？所以，为了将精彩做到极致，势必要给图灵设计出一个对立面。于是，就设计出他与天地人缠斗的悲剧英雄格局——对立面不再是具体的人与事，而是误解。这下就把他与人的交流不畅跟解谜这种他与数字交流的如鱼得水形成对比，一下子，天才的傲世孤独便立起来了。但是，这还不够，还得有个更为物化的落点，影片将这个点落在了同性恋迫害——刚好史实中也查询有据。这样一来，影片往上走是不为世人所容的孤独英雄“我一生未做错事，为何会这样”的古典悲剧，往下走还观照了同性歧视这个正在风口浪尖的现实。几条路径，总有一条能征服你。\n\n这样，三条线一拼接，图灵的悲剧便极有逻辑地呈现在你面前。影片对史实素材的处理极其工整讲究，情节推进的每一步轻重缓急都拿捏得恰到好处，虽然最后免不了会有“循规蹈矩”与“标签化”的责难，但能将这种类型片模板推到登峰造极，本身就是很了不起的手艺。客观来讲，因为主题先行，电影中的图灵跟现实里那位天赋异禀但绝不讨人嫌的天才差别还是挺大的，但这是电影啊！试图通过电影来学习历史，这本身就不是一种认真的学习态度。话又说回来了，我估计倒是会有不少守望卷福的妹子，看完本片后会暂忘卷福反去了解图灵真实的经历，像这样以虚构激发对真实的探寻，恐怕才是电影的意义所在呢！\n\n（原载于《虹膜》公众号，转载请注明）", "useless_count": 6, "comments_count": 11, "alt": "https://movie.douban.com/review/7541765/", "id": "7541765", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 7, "author": {"uid": "marco_0708", "avatar": "https://img3.doubanio.com/icon/u1217525-1.jpg", "signature": "", "alt": "https://www.douban.com/people/marco_0708/", "id": "1217525", "name": "近似无限透明的蓝色"}, "created_at": "2015-03-04 21:06:15", "title": "模仿游戏", "updated_at": "2015-03-04 21:06:15", "share_url": "https://m.douban.com/movie/review/7396478", "summary": "    如同得到未经雕琢的美玉胚子，没有匠师大刀阔斧的气魄，过于小心翼翼精雕细琢，没有取舍，结果传奇一生工整得刻板。      人物传记，最忌流水账式跳跃叙述，三条线，任选一条都风味绝佳：天才锋芒毕露的少年...", "content": "    如同得到未经雕琢的美玉胚子，没有匠师大刀阔斧的气魄，过于小心翼翼精雕细琢，没有取舍，结果传奇一生工整得刻板。\n\n    人物传记，最忌流水账式跳跃叙述，三条线，任选一条都风味绝佳：天才锋芒毕露的少年时代，逐渐发现世界上不一样的我；临危受命完成不可能的任务破译Enigma；抑或因为同性恋身份饱受摧残侮辱，满怀愤恨离开尘世。非要拼凑成120分钟的影像，着实勉强。\n\n    解码游戏少了悬念，行外人难以看出天才伟大之处，满脑子只有红萝卜青豆必须分开的怪鸡与独来独往的古怪，EQ和IQ必然不能共存，似乎已是世俗约定，导演再落井下石似乎也在常理之中，平庸之人，始终无法拍出动人之作。\n\n    少年图灵面对克里斯托弗死讯时的天崩地裂，和结局纵有旷世之才也因性取向被抛弃，世俗之恶，有时不亚于纳粹狂魔。", "useless_count": 2, "comments_count": 0, "alt": "https://movie.douban.com/review/7396478/", "id": "7396478", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 13, "author": {"uid": "novocaine", "avatar": "https://img3.doubanio.com/icon/u2586616-234.jpg", "signature": "面食いでごめんなさい", "alt": "https://www.douban.com/people/novocaine/", "id": "2586616", "name": "△"}, "created_at": "2015-01-14 00:27:19", "title": "mark一下個人比較受啟發的臺詞", "updated_at": "2015-02-28 22:22:47", "share_url": "https://m.douban.com/movie/review/7341646", "summary": "△  Matthew 7:7-8 Ask, and it shall be given you; seek, and ye shall find; knock, and it shall be opened unto you; For every one that asketh receiveth; and he that seeketh findeth; and to him that ...", "content": "△\n\nMatthew 7:7-8\nAsk, and it shall be given you; seek, and ye shall find; knock, and it shall be opened unto you; For every one that asketh receiveth; and he that seeketh findeth; and to him that knocketh it shall be opened. \n\n△\n\n-It's about cryptography.\n-Like secret messages?\n-Not secret. That's the brilliant part.\nMessages that anyone can see,but no one knows what they mean unless you have the key.\n-How's that different from talking?\n- Talking?          \n- When people talk to each other, they never say what they mean.\nThey say something else,and you're expected to just know what they mean.Only I never do.\nSo, how's that different?\n\n△\n\nOf course machines...\ncan't think as people do.\nA machine is different...from a person.\nHence, they think differently.\nThe interesting question is,just because something, uh,thinks differently from you,does that mean it's not thinking?\nWell, we allow for humans to have such divergences from one another.\nYou like strawberries,I hate ice-skating, you... cry at sad films,I... am allergic to pollen.\nWhat is the point of-of different tastes, different... preferences if not to say that our brains work differently, that we think differently?\nAnd if we can say that about one another, then why can't we say the same thing for brains... built of copper and wire, steel?\n\n△\n\nSometimes it’s the very people who no one imagines anything of who do the things that no one can imagine.\n\n△\n\nAnd we'll have each other's company.\nWe'll have each other's minds.\n", "useless_count": 1, "comments_count": 2, "alt": "https://movie.douban.com/review/7341646/", "id": "7341646", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 2.0, "min": 0}, "useful_count": 9, "author": {"uid": "85714581", "avatar": "https://img3.doubanio.com/icon/u85714581-2.jpg", "signature": "", "alt": "https://www.douban.com/people/85714581/", "id": "85714581", "name": "dun花花"}, "created_at": "2015-04-11 14:08:31", "title": "没法入戏", "updated_at": "2019-02-19 01:09:08", "share_url": "https://m.douban.com/movie/review/7440456", "summary": "2015上半年最失望了。 大长脸和大方脸在一起的cp毫无存在感，还有满满的违和感。 这两人还凭借这部片的获得了最佳奥斯卡男女主角的提名，还好没有选上，公关做得不错。但是今年奥斯卡的最佳女主那片也不忍直视。 ...", "content": "2015上半年最失望了。\n大长脸和大方脸在一起的cp毫无存在感，还有满满的违和感。\n这两人还凭借这部片的获得了最佳奥斯卡男女主角的提名，还好没有选上，公关做得不错。但是今年奥斯卡的最佳女主那片也不忍直视。\n这是艾伦图灵的故事，基本上是说完了他大半个人生。历史上，如此出色的人物，却因同性恋饱受争议，而他的成就这么多年后，还好得到了肯定，让更多的人有了清晰的认识，获得了更多的崇敬，这可能就是天才们最需要的吧。\n但是本尼迪克特的表现真实让我大失所望啊，真的超级失望。好吧，在提前看过他的神探夏洛克，赎罪，还有那表现力不错的霍比特人里的恶龙，他的形象很难做到突破，而且黑点满满。在里面早晨跑步的表情，像极了排便有问题的巨龙，电影里面这个场景出现里两次，图灵是个长跑运动员，这难道就是导演你告诉我们他是长跑运动员的方式，哈哈？我肚子里面的食物已经被翻卷到喉咙眼了。再来对比他在里面的说话方式吧，自认为的天才不可一世的进入了这个破解enigma小组，无比高傲的讽刺队友，这里还有sherlock的影子，然后，接着，紧接着，这个人就开始结巴了，不停的结巴了。这个人就开始内向得不知道如何解释事情如何说清楚了，好吧，比如在denniston找他麻烦，要求毁了他的机器的时候，hugh他们为了保护，说的居然是你要是开除他，那也开除我们吧。编剧啊编剧，这真是英国电影么，为什么会有这么low的存在，你是好莱坞脑残派来的间谍么。然后Alan这个还是个傻的，天才啊，你看看你说的都是些什么台词，就像是一个刚喝多了眼前一片模糊的人还在试图跟人说清楚我没有醉，呵呵呵，诶。本尼。\n很多人对于本尼，保持着一种欣赏不来的态度，还有大女主角，凯拉奈特莉，这个女的我没法欣赏。如果是神夏的粉丝超级饭本尼这个我可以理解，因为神夏这部神编剧，结构逻辑严密，又满足了大多数人侦探喜好的电视剧还卖腐，让人欲罢不能，并且本尼在里面确实演技不错，很有型很有范，而所想的福尔摩斯就成了他的形象。在没看神夏的时候我也不能理解为什么居然还有这么多人喜欢着马脸，好吧，现在我也是其中之一。\n这部片是我看得本尼和凯拉的第二部合作的片，第一部是 赎罪。对，就是那部本尼在里面的出色表演，然后获得了夏洛克这个角色的片子。天啦。。。。英国电影在我心中，一直是个不凡的存在，不像好莱坞这种烂大街的超级英雄以及俗套剧情的青春片爱情片，还有夸张的人物演技。英片我一直认为是走心和有故事代入感的，电影里面讲的就是这么个故事，演员的形象就是剧本里面的设定，不会看着某个演员的烂演技会出戏。当然，凯拉奈特莉除外，加勒比海盗里面就受不了受不了，傲慢与偏见看了个开头就不看了，虽然里面美丽的大姐也止不住对凯拉的厌恶，还有演的 歌曲改变人生，这么好的一部片子，但是多少人因为凯拉拉而给的差评！\n\n在ALAN被爆出同性恋之后，凯拉去看望他的那一段，拿出报纸让他写填字游戏，但是alan的手不受控制。。。就这，凯拉的脸居然出现了狰狞的表情。这么多年，平胸妹也老了，针打太多想做出悲伤的表情，可惜太狰狞。\n\n百度百科里面有这么一段：\n\n因为图灵的同性恋倾向而遭到的迫害使得他的职业生涯尽毁。1952年，他的同性伴侣穆雷协同一名同谋一起闯进图灵的房子盗窃，图灵为此而报警。在调查过程中，他承认与穆雷发生了性关系。英国警方的调查结果使得他被控以“明显的猥亵和性颠倒行为”罪。\n\n所以出现了电影开头的被偷盗，但是电话是邻居打的。而且本片除了小图灵的情节以外，本尼迪克特扮演的这个图灵可是实在实在实在是没有表现出一点点的同性恋啊，警局里面抓了个人说他和图灵有性交易这就是了么，他和凯拉口头上面说我是个同性恋这就是了么。这要么就是编剧故意而不为之，要么就是本尼破烂演技的地方，演个直男sherlock弯的不行，演个gay偏偏 正直无比。\n和看国产烂片的感觉相同，一部电影里面各种细小的情节的槽点都会看着心里有不舒坦的地方，本片就是，看电影，感觉也是很重要的，尽管我一直在努力，但是本片几乎没入戏。\n", "useless_count": 7, "comments_count": 8, "alt": "https://movie.douban.com/review/7440456/", "id": "7440456", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 12, "author": {"uid": "1758414", "avatar": "https://img3.doubanio.com/icon/u1758414-10.jpg", "signature": "", "alt": "https://www.douban.com/people/1758414/", "id": "1758414", "name": "KyS"}, "created_at": "2015-01-03 17:06:40", "title": "一个孤独的不同的坚持的纯粹的人和他忧伤却美丽的人生", "updated_at": "2017-03-27 23:24:15", "share_url": "https://m.douban.com/movie/review/7315869", "summary": "随手写写，反正没人看，想到哪写到哪吧。这不是影评真的不是。  以前对于图灵的认识，差不多只局限于以前上课学的图灵测试和他是个著名同性恋上。所以看片的时候入戏有点慢，还在想卷福这造型和口音的问题。然后...", "content": "随手写写，反正没人看，想到哪写到哪吧。这不是影评真的不是。\r\n\r\n以前对于图灵的认识，差不多只局限于以前上课学的图灵测试和他是个著名同性恋上。所以看片的时候入戏有点慢，还在想卷福这造型和口音的问题。然后开始慢热的进入剧情，看到他在学校里的经历，他在radio factory里的经历，脑子里就开始感叹，天才总是很不同的，很孤单的，常人很难以理解的，这大概是为什么他们很多时候都会伴随着一个忧伤的结局，然后在死后很多年才被理解被认识被惋惜被歌颂。\r\n\r\n说起来，我是个彻头彻尾的一生论者以及HE爱好者，所以每每看到这种忧伤的结局就难过的不行，后世的再多溢美之词再多平反顶什么用呢，人都没了，所以我确实是个非常肤浅且天真的一般人。所幸，我所在的社会已经比以前要好上很多很多很多了，应该不会有那么多的因为性向而被判刑这种事情发生，人类总是有在进步的。\r\n\r\n天才总是对自己所从事的东西有着异常坚定的信念和可怕的集中力，我恐怕是我最为羡慕的方面了，名誉金钱这种东西不用是天才或者说恰恰不能是天才便能获得，而天才之所以执着于一个事物一个领域也不是为了名誉金钱，这种纯粹真的让人羡慕因为我永远拥有不了，感觉他们真的拥有了一个非常奇妙非常美丽的人生，就因为这份执着这份纯粹。我很想给自己找一个我能一直坚持一直执着不受干扰只因为我喜欢只因为我想做的东西，可惜活了二十多年了，我一直没有找到，看来我除了是个肤浅和幼稚的一般人，我还是个懦弱以及懒惰的一般人。\r\n\r\n我只能用一个一般人的思维方式去想象一个天才的喜怒哀乐，所以我感到特别的悲伤，因为他爱人的离去，因为世人对他性向的不理解，因为孤独，因为功绩被埋没，导致我整个人在电影院哭成狗被围观，傻透了，可是就是很难过，我相信天才就算是天才，也是有一般人的感情和喜恶的，他一个人承受着这一切，他贡献了那么多，引来的却是一个sad ending，我有点庆幸我是个一般人。请善待你身边那些看起来可能有点与众不同有点奇奇怪怪的人吧。偶尔，也保留自己的一些独一无二的东西，不要被生活磨去了。\r\n\r\n我也不知道自己在写什么了，可能是最近找工作的事情让我对“执着于并努力变得擅长于一件自己喜欢的事物/工作”这一点羡慕的不要不要的，才说这些关于天才的有的没的的吧。其他的人可能不用是天才都能做到这一点，这么看来我是有多失败。\r\n\r\n失败的我决定去努力做点改变了，所以瞎写的东西就写到这里。", "useless_count": 4, "comments_count": 5, "alt": "https://movie.douban.com/review/7315869/", "id": "7315869", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 10, "author": {"uid": "missourimonkey", "avatar": "https://img1.doubanio.com/icon/u3770613-177.jpg", "signature": "微信公众号 优基会", "alt": "https://www.douban.com/people/missourimonkey/", "id": "3770613", "name": "MissouriMonkey"}, "created_at": "2015-08-12 15:49:08", "title": "关于图灵的一些想法", "updated_at": "2015-08-18 14:28:36", "share_url": "https://m.douban.com/movie/review/7567748", "summary": "最近生活缺乏方向感，经常早起的时候不知道期待什么，白天浑浑噩噩不知道在干什么地度过去，晚上为自己浪费时间感到惶恐不安，于是耗费更多的时间在意义也不大的杂事上忙乎到很晚，总错过补足优质睡眠的时间。 于...", "content": "最近生活缺乏方向感，经常早起的时候不知道期待什么，白天浑浑噩噩不知道在干什么地度过去，晚上为自己浪费时间感到惶恐不安，于是耗费更多的时间在意义也不大的杂事上忙乎到很晚，总错过补足优质睡眠的时间。 于是想到是不是可以早上去电影院看看电影，票价便宜，也可以看后一天有个好心情？今天早上习惯性地懒洋洋蹲在马桶上刷手机的时候，点开家门口电影院的排片，本想看个傻乎乎的青春片比如《破风》的，结果发现网站上最后一部片子叫《模拟游戏》，再一看居然是讲Alan Turing的。这位计算机、计算机科学和人工智能的开创者的人生经历我已经着迷好些年。看到最近的一场离开场还有一刻钟， 于是我想都没想，提起裤子，骑车飞奔而去，买票就座，几分钟后电影开始。这是近年来很少有的一部让我一半时间含泪看完的片子。上一部是唐山大地震，纯属里面泪点太多；而这部片子之所以让落泪，是因为近年已经习惯于日常生活在麻木状态中的自己，在这位本来我已多有大致了解的主人公的人生画面中，看到了生活的另外一种维度，从而感慨，从而惭愧，从而憧憬，从而惆怅。当电影中已经开始化学药物治疗、情绪失控的图灵平静地合上书、关掉起居室的灯走进黑暗的那个场景结束之后，字幕在潮水般涌动的背景音乐伴随下慢慢浮现，告诉观众如下信息：“在接受政府强迫的试图改变其性倾向的化学治疗一年之后，1954年6月7日图灵自杀。图灵对破译纳粹德国密码做出的贡献至少在二战中挽救了1400万人的生命，让二战的结束提前了两年。...图灵发明的机器被称为Turing Machine图灵机，今天被叫做Computers计算机。”这些句子撞击我的心灵，让我不能自已。一个人怎能扛负这样的许多！头一次在电影结束后播放演职员表的时候我没有离场，只是坐着，继续掉泪。屏幕黑掉我回头，背后还有三个高中生样子的小男孩儿，同样和我坐在那里。在影院里调整了好一会儿情绪，再走上阳光灿烂有些毒辣、车水马龙行人匆匆的街头，我顿时觉得精神恍惚。我的心好像还在另外一个时空中。于是到了办公室，吃过午饭，我决定赶紧把自己的一点想法记录下来。零零碎碎，无章可循。1， 米开朗基罗和图灵米开朗基罗和图灵大概是我最欣赏的两位基佬。说不清为什么，可能他们都天真坦率，又有点自虐。历史上伟大的基佬有许多，然而遗憾的是迄今他们当中很多人真实的情感世界还没有被电影所探讨。 米开朗基罗好像就是一个，当然我孤陋寡闻看电影少，更何况他的祖国意大利有可能早有各种影视作品反映这位伟人。不过大概米老前辈的感情生活拍了也不好看，因为他一辈子基本上过得情感上比较憋屈压抑，尤其是和他同时代那位既生瑜何生亮的同样是基友的达芬奇比起来。达芬奇着实是一个伟大的天才，但是不知道为什么自幼我就格外欣赏米开朗基罗而非达芬奇。可能是米开朗基罗更有一种悲情英雄的气质，也更有一种超越今世、超越现实的情怀；相比之下达芬奇好像一位永远得体的时尚界人士，总招人喜欢却不能直击我的心魄。米开朗基罗仰着脖子绘制西斯廷教堂天顶画的四年，大概和图灵研制机器破译纳粹密码的几年，有些相似之处吧，都痛并快乐着，事后旁人看来是伟大的历史成就，而那消逝掉的成千上万小时的或许快乐或许无聊的工夫，其中滋味外人就不得而知了。2， 凯恩斯和图灵二十世纪对人类历史进程影响最大的两个基佬都是英国人。某种角度讲，二十世纪对人类历史进程持续影响最大的两个英国人也就是这两个基佬。John Meynard Keyens 凯恩斯和Alan Mathison Turing 图灵。 近年来关于他俩都有经典传记出版，都写得非常棒，折射出了腐国过硬的文化积淀。英国还有一位闻名于世的他们的前辈基佬Oscar Wilde，不过王尔德先生只能算是给文学界增光添彩，而生于1883年的凯恩斯深刻改变了经济学理论和实践，生于1912年的图灵则开创了以前不存在的学科，计算机科学和人工智能。凯恩斯的思想在他死后成为支撑人类社会经济运作的主要思想中的一根支柱，虽然地位略有沉浮；而图灵开创的领域则直到今日也可能不过是历史的萌芽，人工智能的未来走向直到今天依然不断引起各种大家所做的猜测、畅想和警戒。作为英国政府的雇员，凯恩斯看到的是大英帝国的经济霸权无可奈何地被美国取代，而图灵看到的则是整个世界转变的萌芽。凯恩斯和图灵都出身于英国的中上阶级，不过差了一代人。凯恩斯父亲是大学教授，自己早年做过英国政府印度殖民部门的公务员；而图灵的父亲在生他之前也在印度和缅甸殖民政府里工作。凯恩斯和图灵大学都就读于风气开放包容的剑桥大学，毕业后都从事过大学里的学术工作，而其研究的巨大成就也都来自于给政府工作，凯恩斯是在财政部，图灵是在二战时期军队里开的密码学校。除了领域的区别，他俩的巨大差异在他们的情史方面：凯恩斯上大学乃至整个青年节段非常开放，参加了同龄剑桥人小圈子的“奥林匹克俱乐部”，在里面一帮未来的杰出知识教授和艺术家（包括Virginia Woolf）各种相互睡，当然还有密切的思想交流；凯恩斯甚至和一位画家Duncun Grant同居了大概六年，一度意欲和其相伴终身；不过在被人家另有所爱之后，凯恩斯最终居然和当时极为优秀的俄罗斯女舞蹈家Lydia Lopokova结婚并且很有爱地相伴到他1946年去世。他的同性倾向也并不是秘密，本人是改变英国同性恋政策的积极倡导者，去世的时候遗嘱里也吩咐把一部分财产分给同性旧爱Duncun Grant。而图灵则好像没有太稳定的感情关系，虽然有地方说他其实很愿意告诉他人自己的同性倾向，也和几个小鲜肉有过同居关系；不过显然到了二战后他情感上得不到满足，和工人阶级不可能有太多共同语言的男青年交往结果招致麻烦。3， 图灵和克里斯托弗本片中对图灵和克里斯托弗的关系讲得比较浅，给观众的感觉好像就是克里斯托福喜欢破解密码，这一点影响到了图灵。其实克里斯托弗和图灵做同学、做好友的时间虽然是在青春期初期，但是克里斯托弗对图灵的影响很深，图灵对若干学科包括天文学的兴趣都是克里斯托弗带来的。而克里斯托弗去世后，图灵对意识问题产生了深入的兴趣，也和这段超越普通友谊的友谊有关系。在克里斯托弗去世后图灵还和其母亲有通信往来，说明两人的关系克里斯托弗的父母大概也知道。一个更耐人寻味的问题，是如果克里斯托弗没有因为喝了有病菌的牛奶导致死于牛结核病，如果他健康地长大成人，他会成为一个怎样的人？从他和图灵的关系来看，他比图灵可能更加早熟，有着不亚于图灵的天资和好奇心，他会不会也成为一个绝伦的天才，甚至一个改变世界的人呢? 当然，一个时代，得到机遇的天才总是极少数人；不过鉴于克里斯托弗所处的社会阶层和圈子，他很可能也可以进入剑桥这样的学校自由翱翔，成为一个杰出的学者应该是问题不大。4， 历史中的图灵和可能的图灵无疑，图灵是个天才。但是天才是一种神奇的材料，不同的境遇和机遇下，同样一个天才可以做出各种各样超乎普通人想象的杰出成就。而天才又有时候是脆弱的，图灵不愿意进入监狱因为他认为在监狱里他没法继续研究，乃至他最后面对困境做出的绝然选择，都体现了这种脆弱性。哪些历史因素造就了我们看到的图灵? 图灵又本来可能有哪些不同呢？这大概绝非三言两语可以讲清。只是我感叹，二战大概是让图灵成为我们看到的图灵的一个关键因素。研制片中名为Christopher、实际上名为Bombe的原始计算机，图灵和他的小组花了好几年，克服了一系列重大障碍；如果没有二战，图灵自己未必有能下那么大的决心去制作这样一个复杂的机器，也未必能得到那样一笔巨额支持经费。不过如果没有二战，图灵会不会把聪明才智发挥在其他的领域，或者同样在计算智能领域做出不同类型的贡献呢？至于如果图灵没有被那只氰化物苹果毒死，如果他活到了1960、1970、1980乃至1990年代，他的学术兴趣会照亮哪些领域，就更让我们浮想联翩了。5，伟大的使命和平庸的日常瞎想了这许多，此时我在安安静静别无他人的办公室内。虽然眼下我正在操作的这台电脑和旁边的智能手机，这些设备的存在都离不开图灵的伟大思想，可是说实话我并不能太多感受到电影里带给我的那种震撼。只有打开百度音乐，搜索到Imitation Game的电影配乐原声，点开播放的时候，音乐可以稍稍把我再带回那个情境。日常的生活，总是多少有些平庸乃至低俗，和那些让我心潮澎湃的伟大使命，看似缺乏联系。不过，也许当年在战备时期那个小镇上第八区顶着长官和同僚白眼设计自己的机器的图灵，也曾经有过这样的感受？", "useless_count": 0, "comments_count": 5, "alt": "https://movie.douban.com/review/7567748/", "id": "7567748", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 13, "author": {"uid": "Plumed__Serpent", "avatar": "https://img1.doubanio.com/icon/u86835059-19.jpg", "signature": "Weirdo·Virgo·Anita·Shanghai", "alt": "https://www.douban.com/people/Plumed__Serpent/", "id": "86835059", "name": "Q·ian·Sivan"}, "created_at": "2015-02-06 10:43:10", "title": "「Quotes」", "updated_at": "2015-02-06 10:43:10", "share_url": "https://m.douban.com/movie/review/7369913", "summary": "「Do you know why people like violence? It is because it feels good. Humans find violence deeply satisfying. But remove the satisfaction, and the act becomes... hollow.」   「They only beat me up b...", "content": "「Do you know why people like violence? It is because it feels good. Humans find violence deeply satisfying. But remove the satisfaction, and the act becomes... hollow.」\n\n\n「They only beat me up because I'm smarter than they are.\n↓\nNo, they beat you up because you're different.\n↓\nMother says I'm just an odd duck. And she'e right.\n↓\nBut you know, Alan, sometimes it's the very people who no one imagines anything of who do the things no one can imagine.」\n\n\n「Mr. Turing, why are you helping me? \n↓\nSometimes it's the very people who no one imagines anything of who do the things no one can imagine.」\n\n\n「When people talk to each other, they never say what they mean. They say something else and you're expected to just know what they mean.」\n\n\n「P ZQAE TQR」\n\n\n「You know why people like violence, Hugh? It's because it feels good. Sometimes we can't do what feels good. We have to do what is logical.\n↓\nWhat's logical?\n↓\nHardest time to lie to somebody is when they're expecting to be lied to. If someone's waiting for a lie, you can just, uh, give them one.」\n\n\n「Some advice about keeping secrets. It's a lot easier if you don't know them in the first place.」\n\n\n「The war dragged on for two more solitary years, and every day we performed our blood-soaked calculus. Every day we decided who lived an who died. And every day we helped the Allies to victories, and nobody knew. Stalingrad. The Ardenne. The invasion of Normandy. All victories that would not have been possible without the intelligence that we supplied. And people talk about the war as this epic battle between, um... civilizations, freedom versus tyranny, democracy versus Nazism, armies of millions bleeding into the ground, fleets of ships weighing down the oceans, planes dropping bombs from the sky until they obliterated the sun itself. The war wasn't like that for us. For us, it was just half a dozen crossword enthusiasts in a tiny village in the South of England. Was I God? No. Because God didn't win the war. We did.\n↓\nThat's unbelievable.\n↓\nNow, Detective, you get to judge. So, tell me... what am I? Mm, am I a machine? Am I a person? Am I a war hero? Am I a criminal?\n↓\nI can't judge you.\n↓\nWell, then... you're no help to me at all.」\n\n\n「Was I God? No. Because God didn't win the war. We did.」\n\n\n「No one normal could have done that. Do you know, this morning, I was on a train that went through a city that wouldn't exist if it wasn't for you. I bought a ticket from a man who would likely be dead if it wasn't for you. I read up on my work... a whole field of scientific inquiry that only exists because of you. Now, if you wish you could have been normal... I can promise you I do not. The world is an infinitely better place precisely because you weren't.\n↓\nDo you... do you really think that?\n↓\nI think... that sometimes it is the people who no one imagines anything of who do the things that no one can imagine.」\n\n\n「Today we call them \"computers\".」", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7369913/", "id": "7369913", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 10, "author": {"uid": "edie.dandelion", "avatar": "https://img3.doubanio.com/icon/u1149009-22.jpg", "signature": "", "alt": "https://www.douban.com/people/edie.dandelion/", "id": "1149009", "name": "edie"}, "created_at": "2015-01-12 00:17:15", "title": "满脑都是接线柱，岛国真的好累", "updated_at": "2015-01-15 04:26:04", "share_url": "https://m.douban.com/movie/review/7337093", "summary": "故事开头我们看到马老师告诉Tanner：“I am the control.” 如果这是TTSS，那他就是MI6的老大。但对面是007的Tanner，根据索尼已泄露的消息，C是隔壁MI5的老大（played by你们敬爱的莫里亚蒂老师）。然后镜头一转...", "content": "故事开头我们看到马老师告诉Tanner：“I am the control.” 如果这是TTSS，那他就是MI6的老大。但对面是007的Tanner，根据索尼已泄露的消息，C是隔壁MI5的老大（played by你们敬爱的莫里亚蒂老师）。然后镜头一转，我们看到MI6的老大是马强。曾经马强还是剥头皮小队没有头发的队员的时候。。。等等，谁刚刚说他是control来着？\n回到1939年刚刚开战的时候，马老师登上了一辆输送80万儿童撤离伦敦的火车。已知MI6的军需官Q老师/Freddie Lyon，开战的时候只有10来岁，被送下了乡，寄养在Lord记不住叫啥了的家里。在二战开始前的和平年代，有另一个贵族，他的房子叫做唐家屯。新姑爷马修哥哥后来成了马老师的上司。在二战开始前的和平年代，马修哥哥还去过另一个叫新娘头屯的地方，与Q老师酗酒，也和美国队长的女朋友轰轰烈烈爱一场。二战后他参了军。没想到连襟小司机也参了军。小司机终于能够继续追求他社会主义的梦想了，他投靠了苏联。\n再回到TTSS，已知叛徒爱马强，苏联间谍是基佬。那么小司机是什么来着？\n再再回到马老师，哦不卷福老师，他哥跟军情处是什么关系来着？\n现在问题来了，到底谁是老大？谁是间谍？谁是基佬？\n\n有人注意到电脑了吗？（喂", "useless_count": 1, "comments_count": 1, "alt": "https://movie.douban.com/review/7337093/", "id": "7337093", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 4, "author": {"uid": "50627907", "avatar": "https://img3.doubanio.com/icon/u50627907-3.jpg", "signature": "", "alt": "https://www.douban.com/people/50627907/", "id": "50627907", "name": "昆汀的影子"}, "created_at": "2015-01-21 22:55:20", "title": "不是影评，只是短评说不完只好挪窝", "updated_at": "2015-01-21 22:55:20", "share_url": "https://m.douban.com/movie/review/7351889", "summary": "直接说了，说完睡觉，我太困了：  1、不得不嫌弃海报跟片名的同时为它们点十个赞。在没有任何剧透只知道是传记片和男女主演员的情况下，海报跟片名做了转移注意力的大好事，我从来未曾想过这个故事是这样被填充的...", "content": "直接说了，说完睡觉，我太困了：\n\n1、不得不嫌弃海报跟片名的同时为它们点十个赞。在没有任何剧透只知道是传记片和男女主演员的情况下，海报跟片名做了转移注意力的大好事，我从来未曾想过这个故事是这样被填充的。如此人性、如此女性化。\n\n2、14年英国传记三部曲（自己取名的）在逻辑顺序上可以这样来排序：《万物理论》、《模仿游戏》、《骄傲》——异性恋的风光VS个体同性恋悲剧VS群体同性恋的短暂胜利。\n\n当然比起霍金的“红颜未老恩先断”的”有才就是任性“，任谁都会倒向“曾经沧海难为水”的“除了有才我一无所有”的图灵。\n\n3、对本尼迪克特·康伯巴奇先生路人转黑，黑转粉的观影历程如下：《福尔摩斯1》(路人）——《福尔摩斯3》（黑）——《为难奴十二载》（我以为他也不过是个想跻身入好莱坞的狗屎运爆棚的普通英国演员）——《八月奥色治郡》（改观）——《模仿游戏》（好吧，你是会演戏的)\n\n我不知道凯拉奈特莉是该属于女主还是女配，她都有资格参与，并且如果最终打败其他人也毫不意外。但奥斯卡呵呵吧。\n\n小图灵的扮演者最后一场戏全片NO.1。\n\n4、剧本是典型好莱坞式的，所以很有侧重地选择突出跟省略某些部分。这就导致无限弱化了解密工作本身的复杂性、对战争的刻画一笔带过且心不在焉。故事中穿插的二战纪录影像就像卡通片一样幼稚得让人出戏。\n\n5、除了4，本片基本无槽点、无尿点。并且槽点4在整部片子的闪光点的照耀之下不值一提，瑕不掩瑜。本片基本可以包揽普通观众的一切G点：励志、同性恋、无性恋、战争、谍报、科学、职场......\n\n6、阿福是不是准备把所有类型的天才都演个遍，事实证明他也的确可以饰演各类天才，谁都以为他会好长时间带着阿福的阴影去演戏，但这种金蝉脱壳的速度的确令人咋舌。比起那个只会秀智商被全世界宠着的不真实的夏洛克，这位孤胆图灵简直让人潸然泪下。\n\n声音让人怀孕。眼神很性感。自信的时候比夏洛克自恋好看太多。\n\n\n7、事实再次证明，女人对GAY的是怜悯天生的，貌似是介于同类和母爱之间的一种本能。奈特莉的演技越来越纯熟自然。铁丝戒指很浪漫。\n\n8、这是我常规下我会喜欢的电影类型，不猎奇，规规矩矩。\n\n目前来说，只有这样的鉴赏力。对于图灵本人的一生，也许完全有更高档次高格调的呈现方式，而这一部只是千万方式中很普通的一种。但对人本身的复杂性而言，一切艺术都显得不够用，都可谓之为亵渎或浅薄化。\n\nWHATEVER，喜欢的自己喜欢，不屑的自己不屑。\n\n最最后，除了上述，有一个非常私人的观影惯性使得我感受到这部片子的亲切。\n\n它是女性视角的故事，纤细、感性、柔软。我内心会私藏这一类电影。是我个人的偏好。虽然很厌恶那个词，但少女心这种东西不是你讨厌它就会走开的。\n\n\n\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7351889/", "id": "7351889", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 2.0, "min": 0}, "useful_count": 17, "author": {"uid": "fullmoon924", "avatar": "https://img1.doubanio.com/icon/u4629867-39.jpg", "signature": "有趣", "alt": "https://www.douban.com/people/fullmoon924/", "id": "4629867", "name": "周玥"}, "created_at": "2015-01-11 17:41:20", "title": "计算机之父的一生如果是这样那技术含量也太低了吧", "updated_at": "2016-08-28 02:29:06", "share_url": "https://m.douban.com/movie/review/7336409", "summary": "吐槽，不喜误入。        很生气，是因为我喜欢看传记电影，喜欢看真实的传奇故事。但是，这部拍得太差了。故事太弱了。对于一个数学天才来讲，他是不是gay一点也不重要好吗？把一个伟大的数学家拍得好像只是一个...", "content": "吐槽，不喜误入。\n\n      很生气，是因为我喜欢看传记电影，喜欢看真实的传奇故事。但是，这部拍得太差了。故事太弱了。对于一个数学天才来讲，他是不是gay一点也不重要好吗？把一个伟大的数学家拍得好像只是一个饱受英国政府迫害的非法同性恋，他还EQ超低，童年也饱受欺凌，对计算机之父，对一个数学天才来说这不是太浪费了吗？\n\n      计算机之父的一生除了破解Enigma，他还提出了图灵机的概念，“图灵测试”，如果有机器能够通过图灵测试，那他就是一个完全意义上的智能机，和人没有区别了。他是计算机界的第一人，为了纪念他还将计算机界的最高奖定名为“图灵奖”；他还是长跑健将。人类引以为傲的灿烂文明科技发展到现在是有多么渴望造出一个完美的人工智能机器人，这点不是很清楚吗？只能说明编剧和导演都是懒虫，根本就没有深入的去研究他们要拍摄的人物，根本不关心这位天才数学家的科技成分，而只去关心他的性取向，以及低EQ。\n\n        浪费简直就是天大的浪费！希望重拍，强烈要求重拍！", "useless_count": 9, "comments_count": 7, "alt": "https://movie.douban.com/review/7336409/", "id": "7336409", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 2, "author": {"uid": "missourimonkey", "avatar": "https://img1.doubanio.com/icon/u3770613-177.jpg", "signature": "微信公众号 优基会", "alt": "https://www.douban.com/people/missourimonkey/", "id": "3770613", "name": "MissouriMonkey"}, "created_at": "2015-08-12 15:49:01", "title": "关于图灵的一些想法", "updated_at": "2017-09-13 18:54:52", "share_url": "https://m.douban.com/movie/review/7567747", "summary": "最近生活缺乏方向感，经常早起的时候不知道期待什么，白天浑浑噩噩不知道在干什么地度过去，晚上为自己浪费时间感到惶恐不安，于是耗费更多的时间在意义也不大的杂事上忙乎到很晚，总错过补足优质睡眠的时间。 于...", "content": "最近生活缺乏方向感，经常早起的时候不知道期待什么，白天浑浑噩噩不知道在干什么地度过去，晚上为自己浪费时间感到惶恐不安，于是耗费更多的时间在意义也不大的杂事上忙乎到很晚，总错过补足优质睡眠的时间。 于是想到是不是可以早上去电影院看看电影，票价便宜，也可以看后一天有个好心情？今天早上习惯性地懒洋洋蹲在马桶上刷手机的时候，点开家门口电影院的排片，本想看个傻乎乎的青春片比如《破风》的，结果发现网站上最后一部片子叫《模拟游戏》，再一看居然是讲Alan Turing的。这位计算机、计算机科学和人工智能的开创者的人生经历我已经着迷好些年。看到最近的一场离开场还有一刻钟， 于是我想都没想，提起裤子，骑车飞奔而去，买票就座，几分钟后电影开始。这是近年来很少有的一部让我一半时间含泪看完的片子。上一部是唐山大地震，纯属里面泪点太多；而这部片子之所以让落泪，是因为近年已经习惯于日常生活在麻木状态中的自己，在这位本来我已多有大致了解的主人公的人生画面中，看到了生活的另外一种维度，从而感慨，从而惭愧，从而憧憬，从而惆怅。当电影中已经开始化学药物治疗、情绪失控的图灵平静地合上书、关掉起居室的灯走进黑暗的那个场景结束之后，字幕在潮水般涌动的背景音乐伴随下慢慢浮现，告诉观众如下信息：“在接受政府强迫的试图改变其性倾向的化学治疗一年之后，1954年6月7日图灵自杀。图灵对破译纳粹德国密码做出的贡献至少在二战中挽救了1400万人的生命，让二战的结束提前了两年。...图灵发明的机器被称为Turing Machine图灵机，今天被叫做Computers计算机。”这些句子撞击我的心灵，让我不能自已。一个人怎能扛负这样的许多！头一次在电影结束后播放演职员表的时候我没有离场，只是坐着，继续掉泪。屏幕黑掉我回头，背后还有三个高中生样子的小男孩儿，同样和我坐在那里。在影院里调整了好一会儿情绪，再走上阳光灿烂有些毒辣、车水马龙行人匆匆的街头，我顿时觉得精神恍惚。我的心好像还在另外一个时空中。于是到了办公室，吃过午饭，我决定赶紧把自己的一点想法记录下来。零零碎碎，无章可循。1， 米开朗基罗和图灵米开朗基罗和图灵大概是我最欣赏的两位基佬。说不清为什么，可能他们都天真坦率，又有点自虐。历史上伟大的基佬有许多，然而遗憾的是迄今他们当中很多人真实的情感世界还没有被电影所探讨。 米开朗基罗好像就是一个，当然我孤陋寡闻看电影少，更何况他的祖国意大利有可能早有各种影视作品反映这位伟人。不过大概米老前辈的感情生活拍了也不好看，因为他一辈子基本上过得情感上比较憋屈压抑，尤其是和他同时代那位既生瑜何生亮的同样是基友的达芬奇比起来。达芬奇着实是一个伟大的天才，但是不知道为什么自幼我就格外欣赏米开朗基罗而非达芬奇。可能是米开朗基罗更有一种悲情英雄的气质，也更有一种超越今世、超越现实的情怀；相比之下达芬奇好像一位永远得体的时尚界人士，总招人喜欢却不能直击我的心魄。米开朗基罗仰着脖子绘制西斯廷教堂天顶画的四年，大概和图灵研制机器破译纳粹密码的几年，有些相似之处吧，都痛并快乐着，事后旁人看来是伟大的历史成就，而那消逝掉的成千上万小时的或许快乐或许无聊的工夫，其中滋味外人就不得而知了。2， 凯恩斯和图灵二十世纪对人类历史进程影响最大的两个基佬都是英国人。某种角度讲，二十世纪对人类历史进程持续影响最大的两个英国人也就是这两个基佬。John Meynard Keyens 凯恩斯和Alan Mathison Turing 图灵。 近年来关于他俩都有经典传记出版，都写得非常棒，折射出了腐国过硬的文化积淀。英国还有一位闻名于世的他们的前辈基佬Oscar Wilde，不过王尔德先生只能算是给文学界增光添彩，而生于1883年的凯恩斯深刻改变了经济学理论和实践，生于1912年的图灵则开创了以前不存在的学科，计算机科学和人工智能。凯恩斯的思想在他死后成为支撑人类社会经济运作的主要思想中的一根支柱，虽然地位略有沉浮；而图灵开创的领域则直到今日也可能不过是历史的萌芽，人工智能的未来走向直到今天依然不断引起各种大家所做的猜测、畅想和警戒。作为英国政府的雇员，凯恩斯看到的是大英帝国的经济霸权无可奈何地被美国取代，而图灵看到的则是整个世界转变的萌芽。凯恩斯和图灵都出身于英国的中上阶级，不过差了一代人。凯恩斯父亲是大学教授，自己早年做过英国政府印度殖民部门的公务员；而图灵的父亲在生他之前也在印度和缅甸殖民政府里工作。凯恩斯和图灵大学都就读于风气开放包容的剑桥大学，毕业后都从事过大学里的学术工作，而其研究的巨大成就也都来自于给政府工作，凯恩斯是在财政部，图灵是在二战时期军队里开的密码学校。除了领域的区别，他俩的巨大差异在他们的情史方面：凯恩斯上大学乃至整个青年节段非常开放，参加了同龄剑桥人小圈子的“奥林匹克俱乐部”，在里面一帮未来的杰出知识教授和艺术家（包括Virginia Woolf）各种相互睡，当然还有密切的思想交流；凯恩斯甚至和一位画家Duncun Grant同居了大概六年，一度意欲和其相伴终身；不过在被人家另有所爱之后，凯恩斯最终居然和当时极为优秀的俄罗斯女舞蹈家Lydia Lopokova结婚并且很有爱地相伴到他1946年去世。他的同性倾向也并不是秘密，本人是改变英国同性恋政策的积极倡导者，去世的时候遗嘱里也吩咐把一部分财产分给同性旧爱Duncun Grant。而图灵则好像没有太稳定的感情关系，虽然有地方说他其实很愿意告诉他人自己的同性倾向，也和几个小鲜肉有过同居关系；不过显然到了二战后他情感上得不到满足，和工人阶级不可能有太多共同语言的男青年交往结果招致麻烦。3， 图灵和克里斯托弗本片中对图灵和克里斯托弗的关系讲得比较浅，给观众的感觉好像就是克里斯托福喜欢破解密码，这一点影响到了图灵。其实克里斯托弗和图灵做同学、做好友的时间虽然是在青春期初期，但是克里斯托弗对图灵的影响很深，图灵对若干学科包括天文学的兴趣都是克里斯托弗带来的。而克里斯托弗去世后，图灵对意识问题产生了深入的兴趣，也和这段超越普通友谊的友谊有关系。在克里斯托弗去世后图灵还和其母亲有通信往来，说明两人的关系克里斯托弗的父母大概也知道。一个更耐人寻味的问题，是如果克里斯托弗没有因为喝了有病菌的牛奶导致死于牛结核病，如果他健康地长大成人，他会成为一个怎样的人？从他和图灵的关系来看，他比图灵可能更加早熟，有着不亚于图灵的天资和好奇心，他会不会也成为一个绝伦的天才，甚至一个改变世界的人呢? 当然，一个时代，得到机遇的天才总是极少数人；不过鉴于克里斯托弗所处的社会阶层和圈子，他很可能也可以进入剑桥这样的学校自由翱翔，成为一个杰出的学者应该是问题不大。4， 历史中的图灵和可能的图灵无疑，图灵是个天才。但是天才是一种神奇的材料，不同的境遇和机遇下，同样一个天才可以做出各种各样超乎普通人想象的杰出成就。而天才又有时候是脆弱的，图灵不愿意进入监狱因为他认为在监狱里他没法继续研究，乃至他最后面对困境做出的绝然选择，都体现了这种脆弱性。哪些历史因素造就了我们看到的图灵? 图灵又本来可能有哪些不同呢？这大概绝非三言两语可以讲清。只是我感叹，二战大概是让图灵成为我们看到的图灵的一个关键因素。研制片中名为Christopher、实际上名为Bombe的原始计算机，图灵和他的小组花了好几年，克服了一系列重大障碍；如果没有二战，图灵自己未必有能下那么大的决心去制作这样一个复杂的机器，也未必能得到那样一笔巨额支持经费。不过如果没有二战，图灵会不会把聪明才智发挥在其他的领域，或者同样在计算智能领域做出不同类型的贡献呢？至于如果图灵没有被那只氰化物苹果毒死，如果他活到了1960、1970、1980乃至1990年代，他的学术兴趣会照亮哪些领域，就更让我们浮想联翩了。5，伟大的使命和平庸的日常瞎想了这许多，此时我在安安静静别无他人的办公室内。虽然眼下我正在操作的这台电脑和旁边的智能手机，这些设备的存在都离不开图灵的伟大思想，可是说实话我并不能太多感受到电影里带给我的那种震撼。只有打开百度音乐，搜索到Imitation Game的电影配乐原声，点开播放的时候，音乐可以稍稍把我再带回那个情境。日常的生活，总是多少有些平庸乃至低俗，和那些让我心潮澎湃的伟大使命，看似缺乏联系。不过，也许当年在战备时期那个小镇上第八区顶着长官和同僚白眼设计自己的机器的图灵，也曾经有过这样的感受？", "useless_count": 0, "comments_count": 3, "alt": "https://movie.douban.com/review/7567747/", "id": "7567747", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 13, "author": {"uid": "70006548", "avatar": "https://img3.doubanio.com/icon/u70006548-2.jpg", "signature": "", "alt": "https://www.douban.com/people/70006548/", "id": "70006548", "name": "电影爱好者"}, "created_at": "2015-01-10 12:46:28", "title": "普通影迷对《模仿游戏》的一点想法", "updated_at": "2015-01-10 12:46:28", "share_url": "https://m.douban.com/movie/review/7333906", "summary": "我爱这部电影，从电影的的第一幕到电影的最后一幕，我的眼睛都是死死的盯着银幕，不敢有任何上厕所的冲动，而它就是完成的这么好。  故事得从头说起  我是昨天晚上7点看的这部电影，电影院里8成都已经坐满了，群...", "content": "我爱这部电影，从电影的的第一幕到电影的最后一幕，我的眼睛都是死死的盯着银幕，不敢有任何上厕所的冲动，而它就是完成的这么好。\n\n故事得从头说起\n\n我是昨天晚上7点看的这部电影，电影院里8成都已经坐满了，群众里有英国人，有美国人，当然也有本地人，我不确定大家是看过简介来的，还是只是随便找一部英国电影来看，但是从反馈来看，大家都看到了自己想要看的：这是一部优秀的电影，以我的观点来说，这是今年的《国王的演讲》，他们都相同的优秀，而本尼迪克特康伯巴奇是我见过的在科林费斯之后的最优秀的英国演员，如果他今年获得了奥斯卡，我不会有一点惊讶，这部电影拍的就是这么好。\n\n图灵是我非常不熟悉的人物，我不是学计算机的，也不擅长电脑，之前对这个人的了解就是在计算机界有一个最大的奖，叫做图灵奖，这就是我对他所知道的全部。而这部电影则非常详尽的诉说了他帮助英国破解德国Enigma密码的所有辛酸苦辣，我们能隔着大屏幕感受到图灵的痛苦：当他无法获得其他人地认同时候，在他自己努力制造机器的时候，在他不停地在图纸上研究的时候，我们能完全融进去，和他一起绞尽脑汁的思考，一起为上前线的士兵们担忧，担惊受怕。整个电影充满了强大的戏剧张力，从第一个本尼亮相的镜头，到他眼看着自己的所有心血都被焚烧，我没有一刻不是沉浸在这电影带给我的魅力上，它实在太优秀。\n\n平心而论，本尼一开始并没有给我很强大的他就是图灵的感觉，可能是他带给我的夏洛克的印象太深，也可能是图灵和福尔摩斯有太多的相同之处，总之一开始，在他和将军周旋的时候，我仍然能在他身上看到夏洛克的影子，尤其是他翻进凯拉的家的时候，我仍然有种福尔摩斯扒进艾琳艾德勒窗户的感觉。但是，从他与凯拉奈特莉进入酒吧，聊天以后，他给人的感觉就完全变了，他完完全全的进入了艾伦图灵这个角色，让他栩栩如生，我甚至能感觉到他对这个角色的热爱，而本尼无疑是最适合的人选。\n\n说道凯拉这个人物，我真的很高兴能看到她和本尼之间有大量的对手戏，说实话，英国的优秀女演员有很多，但是在我心中，称得上是英伦玫瑰的只有奈特莉一个人，不仅仅是她长得漂亮，而是她可能是现在年轻英国女演员里最有英国气息的人，她既有《傲慢与偏见》里伊丽莎白贝内特的高傲气质，也能驾驭一些平凡的小角色，在《歌曲改变人生》里面就让我喜欢上了这个爱笑的姑娘，而《模仿游戏》里她更是总是绽放出大大的笑容。凯拉的角色克拉克无疑使这一部几乎全是男性的电影添上了一道亮丽的风景，我也能在电影里面感觉到她对图灵的重要：如果没有凯拉，图灵不会主动的去改变自己，尝试交友，甚至他为了让凯拉留下能主动求婚，这对于以前的图灵是不可想象的，她真的改变了他很多。\n\n这部电影最让我喜欢的不仅仅是本尼，而是导演对每一个配角都有详细的描述，而不是本尼的独角戏，像是与本尼同时进入办公室的另一个超级天才马修古迪也有非常精彩的镜头，甚至是没有很多镜头的警探也给我留下了深刻的印象，这真的是一部非常让我喜欢的群戏电影。\n\n在我看这部电影以前，我曾经上youtube看过他的预告片，而几乎所有的英国佬都在评论提问这电影有没有把他是个gay的事情拍出来啊？或者说图灵是gay才是最要紧的事情，别在计算机这事上花太多时间，而这部电影就是拍给他们看的。是的，我很肯定这个电影就是拍给这些脑子里只有他是gay的人看的，我很高兴我之前不知道他是gay，所以我就能比较客观的看这部电影，并且欣赏他。\n\n这部电影最让我感动的是Cristophor 和图灵之间的感情，尤其是当我终于知道他为什么要给他的机器起名为Cristophor的时候，我知道这部电影一定会成为我2015年最喜欢的英国电影，我很高兴我不是在2014年看的这部电影，因为对我来说2014年最好的英国电影是《时空恋旅人》，我大胆预测2015年的年度最佳英国电影是《模仿游戏》。\n\n最后，我一定要以最崇高的敬意向本尼迪克塔康伯巴奇表示感谢，感谢他在图灵去世将近50年后，重新的把这个人物带给我们，谢谢他，也谢谢每一个把这篇感想看到最后的人，谢谢。\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7333906/", "id": "7333906", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 12, "author": {"uid": "79594566", "avatar": "https://img3.doubanio.com/icon/u79594566-1.jpg", "signature": "", "alt": "https://www.douban.com/people/79594566/", "id": "79594566", "name": "断_流年"}, "created_at": "2015-01-03 20:04:02", "title": "这不算是影评，算是看完电影后五分钟都不能平复心情的交待吧。", "updated_at": "2016-11-08 10:37:58", "share_url": "https://m.douban.com/movie/review/7316302", "summary": "我真的已经期待这部电影好久好久了，英国11月中就上映了，但是澳洲1月1号才上。如果没有人陪我去看的话，我自己一个人也会去看的。谁让我喜欢BC，顺便说一句，在这部电影之后我彻底成为了BC的脑残粉。  我喜欢BC...", "content": "我真的已经期待这部电影好久好久了，英国11月中就上映了，但是澳洲1月1号才上。如果没有人陪我去看的话，我自己一个人也会去看的。谁让我喜欢BC，顺便说一句，在这部电影之后我彻底成为了BC的脑残粉。\n\n我喜欢BC当然是因为夏洛克开始，我觉得我喜欢的不是BC而是电视剧里有点eccentric Sherlock。后来我又陆陆续续的看了他演的其他电影，发现其中有很多都是智商高情商低的神经病天才，比如夏洛克，梵高，霍金，白头发的那个。倒带人生里面他虽然是个算是蛮正常的记者，但是他采访的那个人却是个homeless，而且得了某种病。这次他饰演的又是一个性格乖张不善与人相处的数学家。果然BC就长了一张天才的脸么。\n\n别人说，看BC演什么都觉得他是夏洛克，但是我真的不这么认为，我看到这部电影的时候就完全没有Sherlock的代入感，因为这明明就是两个角色。虽然有两者有点相似之处，但是我认为还是相差很多的。夏洛克有个关心他的哥哥，生活在21世纪，完全可以任性的生活；而图灵生活在相对保守的二战时期，面临的是战争，社会的歧视，亚历山大。怎么可能一样。\n\nBC在此剧中的演技，简直了。特别是几场哭戏，不同的情形下的呈现方式都不一样。自己毕生心血近完成之际差点被毁掉的愤怒与不甘；以及影片最后……\n\n影片的背景本来是很压抑而沉重的，但是却也偶尔夹杂了许多英式幽默。看是看到影片的后半段，我已经哭了好多次，但前几次都还算是能克制。看到影片最后Joan来探望他的时候，我简直哭到停不下来。我坐在漆黑的电影院里，换成了双手抱膝的姿势，好像会稍微好过一点。他颤抖的手，佝偻的背，溢满眼眶的泪，压抑却绝望的眼神，以及看到他的Christopher时眼里的爱怜。哎哟，我的小心脏诶。\n\n这次算是少有的在电影完之后看完片尾，直到灯亮起，才起身离开电影院的。其实有很大一部分的原因是因为我哭道停不下来。我不知道我这是哭些什么，但是就是感觉看完之后久久不能平静。我该庆幸，我今天就只花了个淡淡的眼线，不然哭花了就Happy了。\n", "useless_count": 1, "comments_count": 1, "alt": "https://movie.douban.com/review/7316302/", "id": "7316302", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 6, "author": {"uid": "shawtonli", "avatar": "https://img3.doubanio.com/icon/u1022385-1.jpg", "signature": "邑人电影院，一个人玩", "alt": "https://www.douban.com/people/shawtonli/", "id": "1022385", "name": "邑人"}, "created_at": "2015-02-27 23:24:33", "title": "模仿游戏：不平凡人的不平凡过往", "updated_at": "2015-02-27 23:24:33", "share_url": "https://m.douban.com/movie/review/7391045", "summary": "说到艾伦·图灵，非专业人士，之前知道的怕不会太多。但说到计算机或者电脑，人人皆知。图灵就是计算机之父，他从1930年代就开始对开发计算机进行了构想，然后在二战中因参与破译德军密码的工作，研制出了初步的...", "content": "说到艾伦·图灵，非专业人士，之前知道的怕不会太多。但说到计算机或者电脑，人人皆知。图灵就是计算机之父，他从1930年代就开始对开发计算机进行了构想，然后在二战中因参与破译德军密码的工作，研制出了初步的计算机器。尽管战后第一台真正的计算机由冯·诺依曼研制了出来，但图灵的贡献依然功不可没。\n\n\n不过，图灵的身世却不是那么简单。因为他是一个同性恋，在他所生活的年代，同性恋在英国属于违法行为。最终，图灵在法庭上得到判处。法官要求他在坐牢及治疗两条路上进行选择，图灵选择了后者。结果，他遭到了“化学阉割”，身心收到严重摧残，最终吞下了浸泡过氰化物溶液的苹果死亡。据说，乔布斯就是为了纪念图灵，才将苹果公司的logo设计成为了缺了一口的苹果形象。\n\n\n所以，当你使用着苹果，或者其他一切电子产品，追根溯源，都应该追溯到图灵当初的构想，我们都应该感谢他。《模仿游戏》就是图灵的自传电影，不过它并没遵守史实去拍摄，而是像《逃离德黑兰》一样，进行了较大改编，使之更符合一部电影的可欣赏性。毕竟，人生没有那么多的戏剧性，忠实按照传主现实生活进行拍摄，两个小时之内要想很精彩，没那么容易，而且很难好看。即便是拿下奥斯卡影帝的《万物理论》，也不是处处动人。《模仿游戏》的改编强大之处，让其直接拿到了奥斯卡最佳剧本奖，也成为了其在本届奥斯卡收获的唯一一个奖项。仅此，就足够证明《模仿游戏》的不凡之处了。何况，卷福凭借本片，拿到了人生第一个奥斯卡提名，也算是大收获。而且事实证明，福演活了这个有些孤僻、不善言辞、头脑犀利的天才数学家。\n\n\n《模仿游戏》用三条时间线不断进行交叉的方式，整体推进故事的进展，并将主要精力放在了二战期间图灵如何协助盟军破译德军军事密码的事件上。有轻有重，有急有缓，主次分明。而正是作为核心故事的破译行为，催生了计算机的最初雏形的出现。\n\n\n二战中，德军发明出一种用于计算的机器称为Enigma，它能够定期将德军作战的密码改变，让破译者根本摸不到头绪。要知道，需要数亿次运算才有可能得到Enigma机器的设置，用人力两千万年才有可能解决其产生的所有问题。盟军为了破解Enigma，在英国纠集了全国最优秀的破译人员，日以继日地工作，尽管破译小分队能够破译部分德军的作战信息，但离全面掌握德军的动向，依然存在巨大的距离。图灵作为数学家也被邀请来参加破译小组，一起寻找破解德军的Enigma的路径。相对于破译小组的其他成员，他们都力图通过人工方法找到破解之路，图灵则试图借助机器的手段去破解。在他看来，人与人斗可以，但人与机器斗，则不在一个量级之上，但既然Enigma是一台机器，那么是否可以制造另外一台新的机器来打败它呢？让机器与机器进行斗争，是有可能的，也是可行额，于是这就成了他的主攻点。问题在于怎么能让这台新机器进行“思考”，可以与Enigma针锋相对。既然Enigma的算法需要数亿次，与其费力破译，不如直接就来个数亿次的计算好了，针锋相对地正面解决好了。于是他一直努力构建这样的一台机器，甚至在直接管辖者拒绝这一想法的时候，他通过直接找到丘吉尔来寻求支持，并坚持不懈地开发这台机器。功夫不负有心人，花了两年的时间，他终于将其创造性地制造了出来。但如何让这台机器进行思考，并迅速计算出德军的军事密件，依然存在难度。关键之处，在于寻找到一个突破口。这个时候，需要一些捷径，需要一些思路，好去打开德军诸多密件的关键突破口。当然，这样的事情最终也让图灵做到了。从此，德军的军事战略命令就如同透明一样，可以原样呈现在丘吉尔的办公桌上，并帮助丘吉尔及盟军完成战略布局，进而取得最好的胜利。从诺曼底登陆，再到欧洲大陆上的各个反击，都离不开图灵研制的机器的功劳。那台机器的名字，被图灵命名为了克里斯托弗。有了它，甚至丘吉尔都承认图灵是提早结束二战的大功臣，1946年，图灵因此还获得了 “不列颠帝国勋章”，这是英国皇室给予为国家和人民做出巨大贡献、立下大功的人士的荣誉。\n\n\n当然，电影中为了增加情节的曲折，让图灵破译小组的军事领导人成为了时时阻碍研发推进过程的人，而且还增加了两个间谍在破译小组之中。更搞笑的是，在之初，克里斯托弗尚不稳定的时候，图灵及破译小组居然就决定了那些资料可以提供给丘吉尔，那些则不提供。这一改编的设置是很不严谨的，也不符合史实。而且，图灵还为了掩饰自己的同性恋身份与间谍做了妥协，这也不是史实。不过，作为电影，的确增添了需要看点。\n\n\n不过，因为破译工作属于军事机密，在二战结束之后，图灵就回到了大学校园继续任教，几乎没人知道他究竟做了什么。正在在这个间隙，冯·诺依曼独立研制出了世上第一台正式的计算机，使得后来提起“计算机之父”，往往都是指图灵与冯·诺依曼两个人。而图灵则继续做数学研究，并发展了自己的体育特长---长跑，经过锻炼，他的马拉松最好成绩达到2小时46分3秒，比1948年奥林匹克运动会金牌成绩仅慢11分钟。而1948年的一次跨国赛跑比赛中，他还跑赢了同年奥运会银牌得主汤姆·理查兹（Tom Richards）。\n\n\n但厄运还是降临到了他的头上。1952年，图灵的同性恋人偷偷进入了他的房间，图灵报了警。但可能是图灵在报警之后又发现了是自己恋人所为，因而在之后警察的调查中并没有太配合。他的怪异行为引发了警察的好奇，在接下来的追查中，警察发现了他的同性恋行为。这在当时是违法的，他因此被送上了法庭。在电影中，给出了情节说图灵为了坚持工作，试图隐瞒自己的同性恋行为。其实，现实中的图灵是一个性格耿直，甚至是勇敢的人，他从未力图隐瞒过自己的性取向。在法庭上，他坦白的尺度之大，甚至将做爱的细节都说了出来，让围观者咂舌。但后来的结果我们已经知道了，他因为化学阉割承受了巨大的折磨，并因此废掉了自己的长跑爱好，并在两年后即1954年自杀。\n\n\n图灵的一生充满了传奇与坎坷，他天才般的计算与创造，为世界作出了巨大的贡献，但因为保密而无人所知。等到了庭审，以及之后的阉割期，他又由于自己的教授身份而备受注意，甚至成为热点，收获的名声要远大于他创造计算机的声誉。好事不出门，坏事传千里，中西皆同。世事苍茫，他早早结束了自己的生命。直到2013年12月24日，英国女王才最终赦免了他的罪行。不过，此时已经距离他去世进60年了。为了纪念他，美国计算机协会还专门以他的名字设置了“图灵奖”，以奖励那些对计算机事业作出重要贡献的个人，这一奖项也成了计算机界最负盛名、最崇高的一个奖项，有“计算机界的诺贝尔奖”之称。\n\n\n即便是没有这些，《模仿游戏》依然是一部颇值得欣赏的电影，充满了悬疑的味道，情节生动，人物鲜明。尽管同为科学家的传记片，没有做到《美丽心灵》那样精彩，但也不差多远。对了，片中图灵在二战中开发的那台原始机器的名字叫做克里斯托弗，是因为他初恋的男朋友的名字正是克里斯托弗。那个在他幼时给与他照顾的小伙子，由于早逝而成为图灵心中永远的痛，所以，当他创造出了一个自己的孩子时，第一时间就为它起了名字，为的就是初恋男友。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7391045/", "id": "7391045", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "followmydreams", "avatar": "https://img3.doubanio.com/icon/u40466550-5.jpg", "signature": "it's all about sharing and com", "alt": "https://www.douban.com/people/followmydreams/", "id": "40466550", "name": "helloliu"}, "created_at": "2015-02-22 19:42:20", "title": "他值得被歌颂", "updated_at": "2015-02-22 19:42:20", "share_url": "https://m.douban.com/movie/review/7385577", "summary": "一个人用自己的智慧创造了可以改变战争的机器，一个可以拯救成千上万生命的机器，一个影响现代社会方方面面的机器。这个人不应该被称之为伟大吗？可是，他却被政府掩埋，不仅不被奖励，却因为同志的身份被强制接...", "content": "一个人用自己的智慧创造了可以改变战争的机器，一个可以拯救成千上万生命的机器，一个影响现代社会方方面面的机器。这个人不应该被称之为伟大吗？可是，他却被政府掩埋，不仅不被奖励，却因为同志的身份被强制接受药物治疗，最终自杀。这个故事，这个人物，应该被大家看到。\n让我想起美丽心灵，超时空接触。正是那些我们认为不可思议的人，创造出了不可思议的奇迹，推动人类认知的进步。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7385577/", "id": "7385577", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 7, "author": {"uid": "Y-Joyce", "avatar": "https://img3.doubanio.com/icon/u43980382-1.jpg", "signature": "不疯魔，不成活。", "alt": "https://www.douban.com/people/Y-Joyce/", "id": "43980382", "name": "浅仁"}, "created_at": "2015-01-17 22:13:30", "title": "模仿游戏", "updated_at": "2015-01-17 22:13:30", "share_url": "https://m.douban.com/movie/review/7346782", "summary": "“Sometimes it is the people who no one imagines anything of，who do the things that no one can imagine.有时候正是那些最意想不到的人，才能做出最超乎想象的事。”  作为今年奥斯卡最佳影片的热门候选，...", "content": "“Sometimes it is the people who no one imagines anything of，who do the things that no one can imagine.有时候正是那些最意想不到的人，才能做出最超乎想象的事。”\n\n作为今年奥斯卡最佳影片的热门候选，这部以“计算机之父”图灵为主角的典型纪传体电影值得被赋予极高的评价。\n\n全片三条线同时交叉介绍，按照少年时期的情感懵懂对日后内心信仰的影响、青年时期的才华横溢在战争里的贡献、中年时期因为性取向问题被不公对待这三大块内容，填充了整部影片紧张激烈波澜起伏的故事叙述。\n\n天才与疯子只有一线之隔，智商与情商终难两全。孤傲、古怪、孤僻、夹生、清高、尖酸刻薄等等集为一身的天才数学家，被卷入的战争使命，人性与理智的权衡。太多可圈可点值得回味的地方，拿下奥斯卡简直志在必得。\n\n任何一种属性的感情都值得被尊重，任何心底爱而不得的感情都将转化为人生的信仰，带着另一副灵魂而前行。爱不是长久的占有，而是灵魂永远在一起，无论时间空间都无法阻隔，生死也不可以。\n\n卷福拿捏图灵这种天才人物完全驾轻就熟，奥斯卡最佳男主估计胜算颇大。\n\n", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7346782/", "id": "7346782", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 7, "author": {"uid": "3867281", "avatar": "https://img1.doubanio.com/icon/u3867281-9.jpg", "signature": "", "alt": "https://www.douban.com/people/3867281/", "id": "3867281", "name": "stardust"}, "created_at": "2014-12-11 09:40:25", "title": "被Andrew Hodges亮瞎了的彩虹眼 (Dazzling rainbow coloured scene of Andrew Hodges)", "updated_at": "2015-01-09 10:27:34", "share_url": "https://m.douban.com/movie/review/7237812", "summary": "Andrew Hodges, the author of the book ''Alan Turing: the Enigma', math professor, is a self proclaimed gay and gay right campaigner. His affiliated college, Wadham college is famed as the most acti...", "content": "Andrew Hodges, the author of the book ''Alan Turing: the Enigma', math professor, is a self proclaimed gay and gay right campaigner. His affiliated college, Wadham college is famed as the most active pro-LGBT college in Oxford and Britain. With this knowledge, you can understand the statement of gay right behind the tragedy scenes of the Imitation Game. Every moment is set to invite sympathy for the gay community.\n\nThe film tackles prejudice against feminine, homosexual and any ideology dares to be different. Turing's answering of the question of whether a machine can think when facing indecency charge was just such a statement. 'It does not think in the way as what a normal person would do, just like I don't think in the way what a normal person would do.' Idiosyncrasy is not nonhuman, that is what Turing meant. \n\nJone's rare understanding is not entirely normal either. Her immense tenderness toward Alan is the best you can imagine from the ‘ordinary’ world. The after war period is not fully addressed, which leaves a mystery of the personality and sexual orientation of Jone herself open. \n\nThe story is told in three levels in the film. Boyhood love for Christofer, investigation of the burglar and the consequent discovery of being homosexual thread the war era work together, explain Turing’s eccentric behaviour as a childhood trauma.  \n\nThe plot suffers a bit of over-pushing. I don't think the strategic thinking of a non-action at the first deciphered message would be any appropriate for their positions, neither would they be capable of doing that. But in general, it is a good story and is worth the ticket, especially for someone who likes and likens the witty sort.\n", "useless_count": 0, "comments_count": 1, "alt": "https://movie.douban.com/review/7237812/", "id": "7237812", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 2, "author": {"uid": "161417393", "avatar": "https://img3.doubanio.com/icon/u161417393-2.jpg", "signature": "", "alt": "https://www.douban.com/people/161417393/", "id": "161417393", "name": "A班江直树"}, "created_at": "2017-07-16 23:32:11", "title": "经典台词", "updated_at": "2017-07-16 23:32:11", "share_url": "https://m.douban.com/movie/review/8672763", "summary": "⊙、But if you choose to stay, remember you chose to be here. What happens from this moment forwards is not my responsibility. It’s yours. ⊙、记住，这是你的选择。自此刻起，发生什么都不由我负责，...", "content": "⊙、But if you choose to stay, remember you chose to be here. What happens from this moment forwards is not my responsibility. It’s yours.\n\n⊙、记住，这是你的选择。自此刻起，发生什么都不由我负责，而是由你负责。\n\n⊙、You need me a lot more than I need you.\n\n⊙、你需要我大于我需要你。\n\n⊙、Let me try, and we’ll know for sure. Won’t we?\n\n⊙、让我试一下，我们就知道他们说的对不对了。不是吗？\n\n⊙、Every single day.\n\n⊙、日复一日。\n\n⊙、There are only five divisions of military intelligence.\n\n⊙、There is noMI6.\n\n⊙、Exactly. That’s the spirit.\n\n⊙、军情局只有五个处。\n\n⊙、没什么军情六处。\n\n⊙、正是。这就是精髓。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/8672763/", "id": "8672763", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 0, "author": {"uid": "sosovipp", "avatar": "https://img3.doubanio.com/icon/u53968282-2.jpg", "signature": "专注于原创截图和语录", "alt": "https://www.douban.com/people/sosovipp/", "id": "53968282", "name": "sosovipp"}, "created_at": "2016-07-27 10:43:41", "title": "语录", "updated_at": "2016-07-27 10:43:41", "share_url": "https://m.douban.com/movie/review/8010117", "summary": "我知道的事情，你都不知道。  牛顿在22岁时就发现了二项式定理，爱因斯坦在26岁之前就撰写了四篇足以改变世界的论文。  “天呐，你是认真的。” “你希望我开玩笑么？” “我觉得你不知道什么是玩笑。”  你刚刚...", "content": "我知道的事情，你都不知道。\n\n牛顿在22岁时就发现了二项式定理，爱因斯坦在26岁之前就撰写了四篇足以改变世界的论文。\n\n“天呐，你是认真的。”\n“你希望我开玩笑么？”\n“我觉得你不知道什么是玩笑。”\n\n你刚刚创下了英国军事历史上最短的面试记录。\n\n作为全世界最棒的数学家之一，有时候是会任性一下的。\n\n即使是小学生，只要有一台调幅设备，也能截获那些军事无线信号。\n\n要想阻止一场袭击，我们就必须在20分钟内完成两千万年才能试完的设定。\n\n即使是坏表，一天也能对两次。\n\n只有机器才能打败机器。\n\n知道人们为什么喜欢用暴力吗？因为那感觉……很爽。\n\n有时候，正是那些被人们认为的无用之人完成了无人能成之事。\n\n当人们在交谈时，他们经常表里不一、另有寓意，这使对方得猜测他们的真正用意，但我永远猜不出来。\n\n人们都以为我们是在和德军作战，错了，我们是在和时间作战。\n\n机器当然不能像人一样思考。机器的构造是跟人不一样的，因此它们的思考方式也不一样。\n\n没有什么比朋友订了婚更能让一个女人感到挫败了。\n\n到头来只需要认识一个德国人就可以攻克英格玛密码。\n\n你只用一个纵横字谜就打败了纳粹。\n\n如果别人在等着你撒谎，你不能单是给他们制造一个谎言。\n\n艾伦，你并不是上帝，你无权决定谁死谁活。\n\n丘吉尔太多疑了。\n\n你不会是一个完美的丈夫，而我也没想成为一个完美的妻子。\n\n我是上帝吗？不是。因为上帝没有赢得这场战争，是我们赢了。\n\n现在你告诉我，我是一个机器，还是一个人？是一名战争英雄，还是一名罪犯？\n\n因为你的不平凡，世界才变得更加美好。\n\n在持续了一年的强制治疗之后，图灵于1954年6月7日自杀身亡，享年41岁。\n在1885-1967年间，大约有49000名同性恋依照英国法律被判有罪。\n2013年，伊丽莎白女王为图灵赦免，以此对他前所未有的贡献表示敬意。\n历史学家认为英格玛密码的破解，使二战缩短了至少两年，拯救了超过1400万人的生命。\n这些秘密被政府保管50年后公开。\n图灵的工作鼓舞了几代人投入到被科学界称为“图灵机”的研究当中。今天，我们叫它“电脑”。\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/8010117/", "id": "8010117", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 1, "author": {"uid": "alcudish", "avatar": "https://img1.doubanio.com/icon/u2411826-9.jpg", "signature": "微信公众号feidudumovie", "alt": "https://www.douban.com/people/alcudish/", "id": "2411826", "name": "肥嘟嘟左卫门"}, "created_at": "2015-10-12 09:13:28", "title": "改编的痕迹太重", "updated_at": "2015-10-12 09:13:28", "share_url": "https://m.douban.com/movie/review/7623959", "summary": "继《国王的演讲》拿下奥斯卡后，近代名人传记片如雨后春笋般出现，今年奥斯卡就有两部参与角逐，可巧讲的都是20世纪的英国天才科学家，阿兰·图灵的《模仿游戏》和史蒂芬·霍金的《万物理论》。  奔着奥斯卡去的...", "content": "继《国王的演讲》拿下奥斯卡后，近代名人传记片如雨后春笋般出现，今年奥斯卡就有两部参与角逐，可巧讲的都是20世纪的英国天才科学家，阿兰·图灵的《模仿游戏》和史蒂芬·霍金的《万物理论》。\n\n奔着奥斯卡去的，难免有讨巧之嫌。《模仿游戏》的改编就是一个流水线的例子，当然是高水准很专业的流水线。选取人生3个部分交叉，并以破译德军密码这一最富戏剧性的一段为主，避免流水账，营造一个个戏剧高潮和人物冲突，无论是与同事格格不入，上司阻挠，还是攻克难关。破译密码成功的那一刻确实振奋人心，图灵和他的队伍的确是战胜法西斯的不二功臣，却默默无闻了半个世纪。小男生时代情窦初开也拍得挺流畅，英国人在这方面果然功底扎实。最后烧毁绝密资料的时候，在火光中有一刻我真的被计算机的先驱的光芒感动了。想想如今每个人都离不开的电脑、手机，让世界维持运转的各种系统，这灵感发源于这一切都不存在的那个年代，那个伟大卓绝的思想里。\n\n[img=1:C][/img]\n[img=2:C][/img]\n\n传记电影改编不是问题，片尾也声明了不都是真实历史，我也无意去对比电影和现实的细节。但是文艺界对科学天才常有个刻板印象，或者说刻板的荧幕塑造方式。小时候总受人欺负，长大了情商为零，毫无幽默感，无比傲慢，沟通困难，无法与人共事。比如《模仿游戏》中的图灵。如果真实的图灵是这样也就罢了，可是并非如此。与此同时矮化次要角色来衬托主角，比如图灵的密码破译组的上司被塑造成顽固不化的军阀式人物，其他同事也只能打打下手。小男生时代情窦初开那段，除了一段美好短暂的同性爱情，似乎也就为了铺垫给密码破译机器起昔日爱人的名字。\n\n在这样工整的制作框架下，留给演员的余地其实不多。Benedict Cumberbatch的表现还算不错，尤其是最后被强制注射激素的痛苦那段，给了他一些发挥空间。但总的来讲，整部电影，无论是人物塑造，还是剧情冲突的组织，改编痕迹还是太重。问题不是改编的太多，而是“痕迹”太重。\n\n微信公众号：肥嘟嘟看电影(feidudumovie)", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7623959/", "id": "7623959", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 0, "author": {"uid": "lubaiyu", "avatar": "https://img3.doubanio.com/icon/u52842346-15.jpg", "signature": "", "alt": "https://www.douban.com/people/lubaiyu/", "id": "52842346", "name": "JoeyLu陆柏宇"}, "created_at": "2015-07-30 17:17:23", "title": "很赞", "updated_at": "2015-07-30 17:17:23", "share_url": "https://m.douban.com/movie/review/7553739", "summary": "《模仿游戏》，这部讲述计算机之父图灵的传记片，能以批片的形式在七月暑假期间上映真是难能可贵。实话说，片中的演员演的都很赞，配乐也很精彩，也正是配乐为故事推进锦上添花。虽然很遗憾我没能看懂，不过我希...", "content": "《模仿游戏》，这部讲述计算机之父图灵的传记片，能以批片的形式在七月暑假期间上映真是难能可贵。实话说，片中的演员演的都很赞，配乐也很精彩，也正是配乐为故事推进锦上添花。虽然很遗憾我没能看懂，不过我希望大家能多去影院为好片捧场。配音，长春这次出乎意料，基本都配的不错。总之，值得一看。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7553739/", "id": "7553739", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 1, "author": {"uid": "lubaiyu", "avatar": "https://img3.doubanio.com/icon/u52842346-15.jpg", "signature": "", "alt": "https://www.douban.com/people/lubaiyu/", "id": "52842346", "name": "JoeyLu陆柏宇"}, "created_at": "2015-07-30 17:16:19", "title": "很赞", "updated_at": "2015-07-30 17:16:19", "share_url": "https://m.douban.com/movie/review/7553738", "summary": "《模仿游戏》，这部讲述计算机之父图灵的传记片，能以批片的形式在七月暑假期间上映真是难能可贵。实话说，片中的演员演的都很赞，配乐也很精彩，也正是配乐为故事推进锦上添花。虽然很遗憾我没能看懂，不过我希...", "content": "《模仿游戏》，这部讲述计算机之父图灵的传记片，能以批片的形式在七月暑假期间上映真是难能可贵。实话说，片中的演员演的都很赞，配乐也很精彩，也正是配乐为故事推进锦上添花。虽然很遗憾我没能看懂，不过我希望大家能多去影院为好片捧场。配音，长春这次出乎意料，基本都配的不错。总之，值得一看。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7553738/", "id": "7553738", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 3, "author": {"uid": "33633195", "avatar": "https://img3.doubanio.com/icon/u33633195-6.jpg", "signature": "", "alt": "https://www.douban.com/people/33633195/", "id": "33633195", "name": "帝都帅老汉"}, "created_at": "2015-07-29 14:11:51", "title": "活在自己世界里的伟大-致敬图灵", "updated_at": "2015-07-29 14:11:51", "share_url": "https://m.douban.com/movie/review/7552172", "summary": "   平凡庸碌又自鸣得意的人对在障壁中生存的边缘群体从来缺少悲悯，用欺侮谩骂及各种恶作剧来扣在那些注定不平凡的头顶上来哗自己的众取别人的宠，但受辱者满身污垢的躯体却遮不住注定闪耀的灵魂。    生命的价值...", "content": "   平凡庸碌又自鸣得意的人对在障壁中生存的边缘群体从来缺少悲悯，用欺侮谩骂及各种恶作剧来扣在那些注定不平凡的头顶上来哗自己的众取别人的宠，但受辱者满身污垢的躯体却遮不住注定闪耀的灵魂。\n   生命的价值体现在终极自我的升华对宏观历史进程的影响几何，而不是周遭俗人的拙劣的谄媚与陋俗的掌声，图灵的伟大不仅在于挽救了千万人的生命，埋下了信息社会的种子，更在于他那无限爆发的小宇宙里对自我世界的珍视，在与时间赛跑的征程中，他和种种的白眼和蔑视抗争，只为了心中机器生命的沸腾。\n    当卷福颤抖着手也要呵护那生命般的存在，所谓人性的光芒就是那藏在巨大机器里无尽的付出。汗水是抽象的，因为我们没法衡量投入的多少，因为所有的力量都只存在于图兰执着于自己的世界里的生命投入。正如图灵所说，我们常常不能理解那些特立独行者的偏执，我们早已经被繁复琐碎的社会规则包裹，我们已经不断的放弃了自己的世界的边界，对外部世界不接纳的恐惧超过了自己世界的拱卫，而笨拙的我们却无法给那些勇敢活在自己世界里的贤才一份起码的宽容。\n    他功彪史册却默默消逝，留下的一声叹息不断把当世人的偏见、无知、麻木清晰再现。后世终究无法理解先贤的痛苦，因为痛苦也只存在于他们自己的世界里，痛苦和精彩一起构成生命价值的永恒。在此，向每一个沉醉在自己的世界而为更大的世界牺牲的人致敬，后世的每一份美好都有他们的精血，后世的每一个人向他们朝圣时总有一种复杂的心疼。\n", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7552172/", "id": "7552172", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 2, "author": {"uid": "3864613", "avatar": "https://img3.doubanio.com/icon/u3864613-2.jpg", "signature": "", "alt": "https://www.douban.com/people/3864613/", "id": "3864613", "name": "searoses"}, "created_at": "2015-05-26 11:32:21", "title": "虎头蛇尾的典型", "updated_at": "2015-05-26 11:32:21", "share_url": "https://m.douban.com/movie/review/7482476", "summary": "这片用一个词来形容，就是可惜。  其实拍到图灵解密的种种都算不错，尤其是卷福的表演。但直到他们解码出来，画风突然一转，变成超级狗血的人伦道德讨论。为了要不要报告上级以保护某军舰的戏简直狗血到国内抗日...", "content": "这片用一个词来形容，就是可惜。\n\n其实拍到图灵解密的种种都算不错，尤其是卷福的表演。但直到他们解码出来，画风突然一转，变成超级狗血的人伦道德讨论。为了要不要报告上级以保护某军舰的戏简直狗血到国内抗日剧的水平，居然还安排了某个组员的哥哥在军舰上。看的我直摇头，实在是败笔中的败笔。\n\n再往后走就完全乱套，导演显然失去了对人物塑造的控制。图灵在政治中的挣扎被草草带过，前期铺垫很好很温馨的感情线，突然在和女主关系上变得异常狗血，又草草收场。导演想将图灵的同性恋背景和为此受到的迫害等等人生经历都放进影片，但因为这些因素的效应太大，反而无法拿捏和前半部解码游戏的衔接，让观众在毫无铺垫的情况下，直接面对图灵的崩溃和眼泪，然后......然后他就死了。\n\n双线架构的想法很好，但是后期感情戏处理粗暴，观众要对图灵的人生历程有理解，需要足够的脑补。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7482476/", "id": "7482476", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 4, "author": {"uid": "48386140", "avatar": "https://img3.doubanio.com/icon/u48386140-14.jpg", "signature": "", "alt": "https://www.douban.com/people/48386140/", "id": "48386140", "name": "月下梅子"}, "created_at": "2015-01-12 02:52:39", "title": "Yesterday‘s struggle is today's heritage", "updated_at": "2015-01-12 02:52:39", "share_url": "https://m.douban.com/movie/review/7337281", "summary": "人类历史上多少成就，都是靠前人不被理解的坚持换来； 人类历史上多少平等，都是靠前人被不平等的牺牲换来；  影片中的这两条线清晰而明了。  虽然许多人提出和史实有了各种各样的出入，但是对于这样的艺术加工我...", "content": "人类历史上多少成就，都是靠前人不被理解的坚持换来；\n人类历史上多少平等，都是靠前人被不平等的牺牲换来；\n\n影片中的这两条线清晰而明了。\n\n虽然许多人提出和史实有了各种各样的出入，但是对于这样的艺术加工我认为是成功并且值得欣赏的。如果片中的图灵善于社交，和队友相处和谐，大家一起happy together，最终共同破译Enigma，并将成功公之于众，赢得战争胜利。我们看不到他孤注一掷的信念，看不到他不被认可的折磨，看不到他为了大局决定他人生死时的痛苦，这似乎便只是一部”成功学励志片“。如果片中的图灵只是造出了”图灵机“，也只是个去酒吧随便找男人上床的同性恋。我们看不到他对爱的执念，看不到他精神上的追求，看不到他选择化学阉割的无奈，看不到他自杀时的绝望与希望。我们也无法深刻理解他以及同性恋群体曾经的悲哀。\n\n图灵的生命只有短短四十二年，但却深深的改变了世界。\n\n\nYesterday‘s struggle is today's heritage.这是著名的纽约同性恋游行的标语。正是因为有他，有他们，才会有今日。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7337281/", "id": "7337281", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "changklun", "avatar": "https://img3.doubanio.com/icon/u67991526-3.jpg", "signature": "", "alt": "https://www.douban.com/people/changklun/", "id": "67991526", "name": "開到荼蘼花事了"}, "created_at": "2015-02-26 11:13:31", "title": "《模仿遊戲》：被世人遺棄的人，才能成就讓人想像不到的大事", "updated_at": "2015-02-26 11:13:31", "share_url": "https://m.douban.com/movie/review/7389139", "summary": "傳記電影《模仿遊戲》述說的是英國數學家、邏輯學家艾倫‧圖靈（Alan Turing，1912-1954）的故事。二戰期間，以艾倫（Benedict Cumberbatch飾）為首的一群解碼專家，在英國的布萊切利園裡和德國納粹獨創、號稱...", "content": "傳記電影《模仿遊戲》述說的是英國數學家、邏輯學家艾倫‧圖靈（Alan Turing，1912-1954）的故事。二戰期間，以艾倫（Benedict Cumberbatch飾）為首的一群解碼專家，在英國的布萊切利園裡和德國納粹獨創、號稱全世界最精密的「恩尼格瑪」（Enigma）搏鬥。他們的戰爭不見硝煙，也不會流血，然而每分每秒的流逝卻等同於無辜生命的消逝。他們只能仰賴腦力當武器，必須在每一天的18個小時裡，從仿若天文數字的排列組合中找出唯一的解答，成功與失敗就像0與1那般分明。可惜的是，他們始終是薛西弗斯，日復一日進行著永無盡頭卻又徒勞無功的任務。直到艾倫研發出可自動運算的電算機，才順利破譯密碼，引領盟軍走向勝利。\n\n艾倫的成就不僅大幅縮短戰爭的時間，避免更多的百姓遭受戰火襲擾，更讓他被尊為電腦科學之父。當然，這些都是後話。艾倫及其同伴在當時並未享受到成功的甜美果實，因為他們就像電影《聽風者》（The Silent War，2012）裡的特工，只能活在規模龐大的戰爭遊戲的陰影底下，當個不知名的存在，更別說是以英雄之名受人景仰了。當民眾歡慶戰事告終時，艾倫等人必須關在和外界僅一牆之隔的房間裡，被迫銷毀曾經的功績，抹去自己的存在，成為遭排拒於歷史之外、身分不為社會所認同的無名英雄。\n\n學者紀大偉曾以「身分認同」（identity）為基礎，分辨同志與酷兒：「同志主張身分認同，但是酷兒卻加以質疑。」換言之，酷兒拒絕被收編於固定的身分認同中，是難以統一定義的存在。出於戰爭的特殊背景，艾倫固然是在非自願的情況下被置放於身分不被認同的處境中，但他的過人天賦，以至於性向，早就讓他具備無法抹滅的酷異性。片中的艾倫，自幼即被視為「怪胎」，不僅沒有朋友，還頻頻遭人欺侮霸凌，只有克里斯多夫願意幫助他、親近他。一次機緣下，克里斯多夫開啟艾倫對密碼的好奇心，兩人遂以密碼作暗語，互傳紙條。在他人眼中言不及義的愚蠢文字，對他們而言，卻是富含意義的心靈密語。密碼突顯出他們之於眾人的異質性，讓兩人自成一方小世界，也使得他們距離「主流社會」愈來愈遠，成為漂泊離散的孤獨個體。\n\n片名的「模仿遊戲」指的是為人津津樂道的「圖靈測試」（Turing test），為一判斷機器能否像人腦一樣進行思考的實驗，這也為人工智能的發展奠定基礎。不過「模仿遊戲」在片中有另一層指涉，即艾倫對主流社會的模仿。艾倫的天資聰穎和幼時經歷造就他的孤傲個性，即使長大成人仍舊和社會格格不入，經常是一開口就得罪一票人，使得共事的解碼專家們都對他頗有微詞，除了瓊（Keira Knightley飾）。在瓊的勸誘下，艾倫開始嘗試「模仿」他人的舉動，以融入群體。事實上，這確實也收到一定的效果，同事們不但願意親近他，更全力為他的實驗背書。艾倫的模仿看似隱藏原本的異質性，讓自己收編於主流社會的群體認同中，但是倘若從另一個角度來看，不也證明所謂的「主流社會」並非天生如此那麼理所當然，完全可經由學習或模仿而達成。艾倫無意間的舉動，無疑撼動了那個曾經排擠他、壓迫他的主流社會價值。\n\n試圖撼動主流價值的不只有艾倫，還有瓊。因為是女性，瓊的才智不被認可，遭排拒於智力掛帥的試場之外；因為是女性，不被允許和一群男性一起工作；因為是女性，人生唯一的道路只有步入婚姻、收編於（異性戀父權）家庭之中。然而瓊如同酷兒般去質疑，甚至是挑戰社會加諸於她身上的女性身分。她不僅展現出力壓群雄的智力，又混在男人堆裡，和艾倫等人一同進行解碼任務，種種限制讓她逐一破解，證明她從來就不是一位「正常」的女性。除此之外，曾言明不願窩在家中當家庭主婦的瓊，選擇和艾倫結伴步入婚姻，從表面上來看，主流規範終究還是收服了兩人，但事實上，他們都清楚知道這不過是具目的性的權宜之計：同性戀者艾倫可藉此悠遊於主流（異性戀）社會中，瓊則是從此能在男人堆裡工作。婚姻原本可能成為兩人的枷鎖，沒想到在異質性的組合（同性戀者和「不正常」的女性）之下，竟翻轉成為解套的手段。至此，主流價值明顯再次動搖。\n\n艾倫和瓊兩位酷兒在主流之中摸索出自處之道，證明主流空間和異質空間並非壁壘分明的兩端，而是疆界不明、相互牽連的存在。只是，酷兒還是只能留在主流空間的邊緣。艾倫和克里斯多夫的情誼自然是不見容於當時的社會，導演摩頓‧帝敦（Morten Tyldum）對同志情慾的隱晦處理彷彿呼應了這種壓抑的氛圍，而艾倫亦未曾言明他對克里斯多夫的情慾，但是祕而不宣並不表示這段同志情誼不存在。艾倫將那台電算機命名為「克里斯多夫」即讓同志情如暗流般潛伏於影片各處。\n\n於是，不管是艾倫身旁的同事，抑或銀幕之外的觀眾，都以為他十分執著於解密，不願任何人來破壞、汙辱他引以為傲的成就；事實上，他沉溺的根本是對克里斯多夫的愛。雖然這份愛只能留存於戒備森嚴的暗房（櫃子）中，但在主流的異性戀社會裡，艾倫還是藉此找到些許喘息的空間，成功偷渡他對克里斯多夫的同性情誼。為了這份愛，他寧願被施以化學去勢的刑責，因為唯有如此，他才不會被迫與「克里斯多夫」分離。艾倫最後站在「克里斯多夫」前對瓊說的那席話，實在令人動容，也讓人體會到什麼是一生一世的愛。或許寂寞永生，但我相信溫柔尚在。\n\n編劇格雷厄姆‧摩爾（Graham Moore）在進行劇本創作時，對史實做了諸多異動，我相信這些改編對電影而言皆有其必要性。誠如他在獲頒奧斯卡最佳改編劇本獎後的感性自白所言，電影意欲呈現的正是那些「奇怪而另類、不能適應任何環境」的酷兒。「被世人遺棄的人，才能成就讓人想像不到的大事。」克里斯多夫曾如是說。若從艾倫的人生經歷來看，這樣的成就背後勢必要付出殘酷的代價，但不可否認的是，遭遺棄的酷兒卻是牽動主流社會最重要的關鍵。如同女神卡卡（Lady Gaga）的歌曲〈天生完美〉（Born This Way）所傳遞的訊息，《模仿遊戲》不單單只是一部傳記電影而已，更緊抓現代的酷兒文化，進行有趣的異質論述。", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7389139/", "id": "7389139", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 4, "author": {"uid": "70240504", "avatar": "https://img3.doubanio.com/icon/u70240504-1.jpg", "signature": "", "alt": "https://www.douban.com/people/70240504/", "id": "70240504", "name": "sydneyvivi"}, "created_at": "2016-10-29 21:32:05", "title": "晚到的影评", "updated_at": "2016-10-29 21:32:05", "share_url": "https://m.douban.com/movie/review/8149383", "summary": "终于看了【 The Imitation Game】，谢谢朋友的推荐。  这里想说说影片的结尾：导演冷静地将镜头切回二战结束，熊熊火光中，一排排冰冷的字幕缓缓推出：天纵奇才又如何，命运早就做好了安排；最后尘缘昭雪又如何，...", "content": "终于看了【 The Imitation Game】，谢谢朋友的推荐。\n\n这里想说说影片的结尾：导演冷静地将镜头切回二战结束，熊熊火光中，一排排冰冷的字幕缓缓推出：天纵奇才又如何，命运早就做好了安排；最后尘缘昭雪又如何，与众不同的人注定一生孤独和心酸，再有才华的人总抵不过历史的洪流，在那一刻那一段，他不被世俗接纳，就必须走向死亡。\n\n喜欢这部影片的导演：冷静的叙述，在时光交错中刻画人性。喜欢电影的配乐，忧伤而凝重的暗色调子，特地去查了一下音乐的作曲，原来真是大师所做；喜欢BC的演绎，图灵接受化学阉割精神濒于崩溃的那段是经典。整部影片浓浓的英伦风格，这也是我喜欢的地方。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/8149383/", "id": "8149383", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "1166642", "avatar": "https://img3.doubanio.com/icon/u1166642-13.jpg", "signature": "", "alt": "https://www.douban.com/people/1166642/", "id": "1166642", "name": "Grace"}, "created_at": "2015-07-28 22:55:47", "title": "本尼迪克特•康伯巴奇：银幕上的天才与演艺界的知识分子", "updated_at": "2015-07-29 08:43:24", "share_url": "https://m.douban.com/movie/review/7551591", "summary": "「我们长脸界的骄傲。」  《模仿游戏》上映不久，时光网上便可见粉丝带几分戏谑几分崇拜的评论。这是本尼迪克特•康伯巴奇（Benedict Cumberbatch）的最新一部作品。继物理学家斯蒂芬•威廉•霍金（Stephen...", "content": "「我们长脸界的骄傲。」\n\n《模仿游戏》上映不久，时光网上便可见粉丝带几分戏谑几分崇拜的评论。这是本尼迪克特•康伯巴奇（Benedict Cumberbatch）的最新一部作品。继物理学家斯蒂芬•威廉•霍金（Stephen William Hawking）、神探夏洛克•福尔摩斯、维基解密创始人朱利安•保罗•阿桑奇（Julian Paul Assange）之后，本尼迪克特再一次扮演天才人物，被称为「人工智能之父」的艾伦•麦席森•图灵（Alan Mathison Turing）。\n\n\n天才的扮演者\n\n《模仿游戏》中的图灵是一个高智商、低情商的天才，这令他的童年饱受欺凌、不堪回首也就罢了，他还有一个不能吐露的性取向，并在那个保守而残酷的时代最终导致了他命运的悲剧。如果说尽管剧本呈现的图灵还是个扁平面——他的不谙世事就像是个英国版的谢尔顿，本尼迪克特还是赋予了这个角色更有维度的生命。在办公室里，他口齿不清地向指挥官丹尼斯顿（Commander Denniston）解释不会德语的他，怎么凭借填字游戏也可以破解密码；拿着图灵机的设计图，他摇摇晃晃地穿过人群，直接跑向长官，「我要十万英镑来制造这个机器！」本尼迪克特塑造的成年图灵直接得毫无城府，在他与他思考的核心之间的都被视为空气；他总是在旧西装里抖抖索索，却又总是一语中的。他天真得有一些呆萌，讲冷笑话时还会有一丝羞涩闪过。这些都符合真实的图灵的气质。\n\n图灵是异于常人的。他半夜爬进女人的阁楼，不是为了送花，而是为了破译密码；为了留住工作组里这个最聪明的姑娘，他甚至还向她求婚了，当然最后还是还给她自由。在所有人忙着破译密码的时候，他在忙着制造图灵机。休（Hugh Alexander）想要毁了它，他就变身人肉墙；Denniston想要毁了他，他就赶紧把自己和机器紧紧关起来，好像小时候躲避追着打他的男孩子们。\n\n「他们欺负我，因为我比他们聪明。」少年图灵说。\n\n「他们欺负你，是因为你与众不同。」少年克里斯托弗说。\n\n「他们说得对，你是个怪物。」未婚妻，或者更准确地说，他的好朋友琼说。\n\n如果我们以为图灵的怪异只是低情商，便是一种浅薄的自大，图灵的怪异更在于他基于智慧的惊人准确和忘我的投入。他坚信字母组合即可破解密码，也坚信图灵机是系统性地破解Enigma的唯一可能。这种基于缜密的理性的判断，在他那里足以抵挡所有人的不看好，和连续两年持续不断的失败。结果，前者使他得以招募最为有用的人才，后者则直接帮助盟军赢得了战争。在未被验证正确之前，这些想法都显得多么地怪异。因为我们常常把自己所不能理解的人与事归类为「怪异」，例如，同性恋。\n\n本尼迪克特似乎是善于演绎天才的「怪异」的。在《神探夏洛克》里，福尔摩斯神经质，高贵的冷漠，躁狂，都被他恰如其分地表达出来。我们相信这就是福尔摩斯，即便他穿着白衬衫系着漂亮的围巾，面对着全息画面，跟一个SM女王谈恋爱，我们也相信如果福尔摩斯在21世纪，就是这个样子的。\n\n「聪明才是性感新魅力」\n\n《生活大爆炸》（《the Big Bang》）里的一句「The smart is new sexy.」（「聪明才是性感新魅力。」）让nerd们欢呼，新的时代诞生了！\n\n虽然我们不知道，姑娘们在高长腿人鱼线和超弦论虫洞说之间会怎么选择，但是一个聪明幽默的人是不会令人反感的，即便在以美色为尊的演艺圈里，才华也会令人刮目相看。本尼迪克特的走红，当然不是因为他是「长脸界」最帅的男士，也不偶然地归因于出演福尔摩斯，更重要的是他本人独有的知性气质，在浮华的演艺圈里有一种难得的清醒与自持。\n\n本尼迪克特在青少年时便是一个独特的人。在升读大学之前，他选择了一年的「Gap Year」（空档年，在升学前或工作中间空出一年，做一次长期旅行），去了印度大吉岭的藏区僧院义务教授英语。这期间，他还与朋友一起到尼泊尔远足，中途迷路，历程惊险无比。他们四个人只有一片饼干和一块奶酪，一路爬过结冰的岩石和半冻的河面，差点摔断脖子；甚至还一度把手插进牦牛的粪便，寄希望它们能起到取暖的作用。\n\n「在寺院工作是段奇妙的经历；虽然有提供你膳食和住宿，但是你得靠拮据的收入过日子。我在那儿的时候，我们去了尼泊尔2周，乘着激浪漂流还在野外露宿看星星。」多年后，本尼迪克特这样回忆那段日子。\n\n有一些人会认为本尼迪克特是「大器晚成」，确实也是如此，在走红之前，他经历了很长一段跑龙套的日子，「众里寻他千百度，认脸还需靠长度」。但是，如果论获奖，早在2004年，他从业的第三年，就凭借《霍金的故事》中的史蒂芬•霍金一角，获得了第44届蒙特卡洛国际电视节最佳男演员奖及英国电影和电视艺术学院（BAFTA）电视奖最佳男主角的提名。2011年，他又凭借舞台剧《弗兰肯斯坦的灵与肉》获得奥利弗奖。\n\n2010年的《神探夏洛克》将本尼迪克特推上了事业的巅峰。《每日电讯》把他列为「史上最伟大的20位福尔摩斯」第一位，并获Digital Spy的读者选为「最伟大的福尔摩斯」。剧集也为本尼迪克特带来多个最佳男主角奖，包括艾美奖、金卫星奖、英国传播记者协会奖、英国罪案惊悚奖、英国电视选择奖及美国电视评论家选择奖等，另外亦获得金球奖、三次BAFTA电视奖提名。\n\n「他很像现实版的夏洛克，脑瓜转得很快，当然说话没那么犀利。他学识渊博，比很多人都聪明。」本尼迪克特的姐姐崔西•皮克(Tracy Peacock)说。\n\n成名之后的本尼迪克特依然保持着相对低调的态度，在影视之外也继续着他的戏剧事业。2015年8月，本尼迪克特主演的《哈姆雷特》将在巴比肯剧院上映。作品之外，他倒也不因为关注度而小心翼翼，他的直言不讳不只对他人也对自己，常称自己「毫无天赋」。当遇到一些无理的玩笑时，他可不会照旧那么好玩。一次《神探夏洛克》的记者会上，一个主持人让他阅读一篇用词不堪的福尔摩斯与华生的同人文，他直接在众人面前语调严肃地问：「你让我读这个是什么意思？」\n\n本尼迪克特的妻子索菲•亨特（Sophie Hunter）是一名剧场导演兼编剧、演员、歌手，曾在牛津大学研读法语和意大利语。2014年11月，他以非常传统的方式，在《泰晤士报》上刊登了两人订婚的消息。\n\n「这是我们国家的传统，很正常。我希望能够掌握发布消息的主动权，所以我不发twitter或者社交媒体——它们太没人情味。我这么做，让大家去发现这个消息，而不是通过某个劣质画质的视频看到我们在恩爱对视，手指上有戒指，从而得知我们要结婚了。」本尼迪克特说。\n\n\n", "useless_count": 0, "comments_count": 2, "alt": "https://movie.douban.com/review/7551591/", "id": "7551591", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 8, "author": {"uid": "21929051", "avatar": "https://img3.doubanio.com/icon/u21929051-6.jpg", "signature": "这不是神经病 是理想", "alt": "https://www.douban.com/people/21929051/", "id": "21929051", "name": "puramente"}, "created_at": "2014-12-27 12:13:33", "title": "伟大的头脑之所以伟大", "updated_at": "2014-12-27 12:13:33", "share_url": "https://m.douban.com/movie/review/7292562", "summary": "一直对二战背景的电影有种莫名偏好，也许是因为大背景下的人物往往有更丰满的个性，故事也更有戏剧张力。也一直对各种真正的“家”们充满崇敬之情，尤其是对人类历史做出贡献的人，许是出于文科生对于科学家的盲...", "content": "一直对二战背景的电影有种莫名偏好，也许是因为大背景下的人物往往有更丰满的个性，故事也更有戏剧张力。也一直对各种真正的“家”们充满崇敬之情，尤其是对人类历史做出贡献的人，许是出于文科生对于科学家的盲目崇拜吧。总之，The Imitation Game两点都符合，自然是去要看的。 果然一点都没让我失望。\n\n整个故事有三条时间线，故事的主线是图灵与当时英国最聪明的一群算法专家一起研制了一个叫“Christopher\"的机器，从而破译了德国通信工具Enigma。这个机器就是未来计算机的原型。有两条副线，一条副线是图灵少年时期初次显出的同性恋倾向，他暗恋的人叫Christopher。另一条是图灵家里被人break in，侦探进行调查，在监狱里得知图灵在二战期间所做的事情，图灵由于同性恋被判刑。这在某种意义上算是一个悲剧。故事结尾图灵让侦探评判他这个人，数学家？同性恋？还是战争英雄？侦探说他无法论断。是啊，所有的judgement都显得多余，我们只需要知道是他的头脑让二战提前两年结束，拯救了百万人的性命。\n\n伟大的头脑之所以伟大，是因为他能在最聪明的一群人都囿于传统的时候，他能够think out of the box，采用一种前所未有的方式解决问题。即使没有人能够理解他，即使成为大家眼中的怪胎。伟大的头脑之所以伟大，是因为大家都被密码破译的狂喜冲昏头脑的时候，他能冷静下来，以最理性最有逻辑的思维与敌人博弈，取得最终胜利。他说：我们的目标不是赢得一场战役，拯救几个人，我们的目标是赢得整场对纳粹德国的战争。即使那时候他被看作是冷血怪兽。\n\n伟大的头脑之所以伟大，是因为他能看到同时代人无法看到的东西，他的思想比其他人超前几十年。侦探问图灵：机器能像人类一样思考吗？他说不能，机器不能像人类一样思考，但它有自己的思考方式。一个东西的思维方式与我们不同，不代表它不能思考。聪明如他，必然知道未来的世界，计算机将会颠覆人类的工作学习方式，人工智能至今仍是科学家们研究和要攻克的对象。伟大的头脑之所以伟大，是因为他不仅看到了未来，并在他的时代里参与和影响了未来。\n\n“Sometimes it is the people no one imagines anything of who do the things that no one can imagine.” 向所有曾经是别人眼中的怪胎但心中自有天地的人致敬。Humanity cannot move forward without you \"awkwardly\" smart people. \n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7292562/", "id": "7292562", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "49089786", "avatar": "https://img3.doubanio.com/icon/u49089786-2.jpg", "signature": "", "alt": "https://www.douban.com/people/49089786/", "id": "49089786", "name": "小鬼家的师公"}, "created_at": "2015-08-10 13:51:56", "title": "戏里的在煎熬，戏外也在煎熬", "updated_at": "2015-08-11 10:24:39", "share_url": "https://m.douban.com/movie/review/7565354", "summary": "       我喜欢和平，每年的生日愿望之一必定会许一个“世界和平”~片子的背景是二战时期，卷福饰演的图灵，无论是学生时代的经历，还是二战时对德国密报系统的破解工作，到最后的战后获罪-化学阉割，都是一段漫长...", "content": "       我喜欢和平，每年的生日愿望之一必定会许一个“世界和平”~片子的背景是二战时期，卷福饰演的图灵，无论是学生时代的经历，还是二战时对德国密报系统的破解工作，到最后的战后获罪-化学阉割，都是一段漫长时期的煎熬~\n       坚持自己的人，不是每一位都能在最终战胜一切的~很多励志的电影其实真的只是戏，或许就仅仅是寓意美好，却脱离现实的一场梦~图灵应了那句“是天赋，也是诅咒”（《MONK》-\"It's a gift, and a curse！\"）~\n       相隔三个月，前后看了2遍，第一次是独自在家看，冲着豆瓣的高分，冲着对卷福和奈奈的喜爱~还惊喜发现了唐家屯的汤司机~第二次是约上汉纸、妹纸齐刷刷进电影院观赏~满座的情况让我小惊讶~也仅仅是三个月，职场上的风云变幻直接导致我一边吃着爆米花观影，一边暗自联想自己的境遇，在片子结尾时默默拭泪~“计算机科学之父”图灵为和平所作出的巨大贡献，难道还不足以抵过他同性恋的罪犯身份吗？\n        \n", "useless_count": 0, "comments_count": 1, "alt": "https://movie.douban.com/review/7565354/", "id": "7565354", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 1, "author": {"uid": "itheque", "avatar": "https://img1.doubanio.com/icon/u46715162-57.jpg", "signature": "", "alt": "https://www.douban.com/people/itheque/", "id": "46715162", "name": "罗宾汉"}, "created_at": "2015-08-02 19:55:57", "title": "这不是一部批判战争的反思电影", "updated_at": "2015-08-02 19:55:57", "share_url": "https://m.douban.com/movie/review/7557084", "summary": "人物传记电影一直都不是我兴趣所在，所以这部也不知道如何评价。对主人公的经历全然不知，不过剧本将其复杂而伟大的人生用如此浓缩的方式来展现也算是神乎其技了。奥斯卡改编剧本奖实至名归。尽管大部分情节发生...", "content": "人物传记电影一直都不是我兴趣所在，所以这部也不知道如何评价。对主人公的经历全然不知，不过剧本将其复杂而伟大的人生用如此浓缩的方式来展现也算是神乎其技了。奥斯卡改编剧本奖实至名归。尽管大部分情节发生在硝烟弥漫的二战时期，但剧情似乎并未让观众感受到太多战争的残酷，除了解码团队中一个男孩得知哥哥在军舰上即将遭遇德军炮击的那段。毕竟这不是一部批判战争的反思电影。整体来说英国味道浓郁，但没太大惊喜，人物刻画依然有公式化的嫌疑，戏剧化情节不算太夸张，最后两场戏稍稍让我感动了。男主角的演技也是一个看点，对于美剧英剧迷来说。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7557084/", "id": "7557084", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 3, "author": {"uid": "pinkfox", "avatar": "https://img3.doubanio.com/icon/u1048572-13.jpg", "signature": "带我离开这里", "alt": "https://www.douban.com/people/pinkfox/", "id": "1048572", "name": "饭思葱"}, "created_at": "2015-07-30 11:34:20", "title": "来自星星的天才", "updated_at": "2015-07-30 11:34:20", "share_url": "https://m.douban.com/movie/review/7553230", "summary": "看之前没看简介，以为是科幻大片，屁颠屁颠就去看了。于是在本片开场发生了如下对话：   “不是科幻片吗怎么能根据真实故事改编。”  “不是科幻片是讲图灵的故事片”  “图灵是谁”  “就是乔布斯那个缺了一口的...", "content": "看之前没看简介，以为是科幻大片，屁颠屁颠就去看了。于是在本片开场发生了如下对话：\n\n\n“不是科幻片吗怎么能根据真实故事改编。”\n\n“不是科幻片是讲图灵的故事片”\n\n“图灵是谁”\n\n“就是乔布斯那个缺了一口的苹果logo致敬的人”\n\n\n此时文史渣暗想：坑爹了，我想看科幻片。\n\n\n没看过图灵的故事，倒是把乔布斯传仔细读过一遍。因为父亲曾经几次说：乔布斯和我出生在同年同月同日，我真想看看我和天才的一生有多大的差别。于是买了一本送他，自己先读了一遍。\n\n\n以下谈一点和影片和书都无关的感想。\n\n\n乔布斯也好，图灵也好，其实都还比较像。惊人的才华（今天NASA说这些超脑达人可能来自开普勒星球，俗称K星），痛苦的灵魂。\n\n\n对于人生我不知道自己算是经历的多了还是少了，理解究竟是深了还是浅了。我发现每一个光芒万丈的人在过往和现实里总有种种伤痕，只是不知是才华造就的孤独还是孤独造就的才华。后来我想，也许如光影之相随，光芒太亮，投下的阴影总归更暗一些。\n\n\n自己现在应该算是一个平庸的人吧。忽然想起很小很小的时候好像也被小学同学排挤过。永远没法融入的小孩子的团体，永远没法讨好的同学。孤独的幼年。我对人际关系是敏感的，这也许是小时候留下的伤痕。\n\n\n想来人生至今，成功是没有成功过，失败倒是真的失败过。后来我开始看周期股，这可能使我对人生的态度变得更加——无情。如果你站远一些看，人生的起伏恰如周期股的波动，波涛是一种叫命运也叫运气的东西。人生那么长，一定有机会让你尝到一览众山小，也一定有机会让你尝到“我靠”。因此应该顺势而为，浪来了，冲高一些。浪去了，那就停一停。这个世界真的是有很多物种的，古人说燕雀安知鸿鹄之志，可如果真的生成一只燕雀那也没办法。\n\n\n我遇见过很多心怀鸿鹄之志的朋友。我看着他们好似在地上仰望天上的飞鸟。应该对这些伟大的人类心怀感激，因为有这些优秀的物种，这个星球才能允许自己如此平庸而无为的活着。\n\n\n我想起那些和我一起长大的人，我想起那些在人生中和在职业道路上和我一起长大的人。我想起在我人生最失败身体和精神最糟糕的时候，警察叔叔曾经对我说，你看你背井离乡这么拼命的工作，我们单位有个大姐每天过的很平凡，养孩子养花，也过得很好。以我当时的年纪，对警察叔叔的人生观嗤之以鼻。如今再想，他确实活的比我更有智慧。\n\n\n我想人生如在湍急河流之中，即便不是游泳健将，但也总是要努力去游。但你一定要有一个坐标系，你游不动，或者迷路的时候，你抬头看一眼，就知道自己应该往哪里去。这个坐标系应该是爱和幸福，是一些超越俗世生活的永恒存在的东西。\n\n\n父亲是一个老一辈的程序员，他不止一次感叹，都是玩电脑的，为什么乔布斯那么牛。《乔布斯传》他没有读完，后来我跟他说，你和同年同月同日出生的乔布斯，差了半个地球。你比他活的平庸，也比他活的幸福。\n\n\n谨以此篇毫无中心思想的乱弹向为了人类进步而奉献毕生的图灵和乔布斯致敬。每个人都有在自己的世界里牛逼哄哄的活着的权利，也许他们的痛苦只是我等凡人无法理解的常态，总之没有人有资格对别人的人生指手画脚。\n\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7553230/", "id": "7553230", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 3, "author": {"uid": "JoyceJB", "avatar": "https://img3.doubanio.com/icon/u1515955-14.jpg", "signature": "要有爱，有信仰，有慎独的心", "alt": "https://www.douban.com/people/JoyceJB/", "id": "1515955", "name": "司馬追燕"}, "created_at": "2015-07-20 15:17:59", "title": "读懂怪咖的人会有一颗奇葩心", "updated_at": "2015-07-20 15:17:59", "share_url": "https://m.douban.com/movie/review/7540851", "summary": "   《模仿游戏》的主角艾伦•图灵被誉为“计算机科学与人工智能之父”，他带领的团队在二战期间成功破译了德军的英格玛密码，拯救的人数以千万计，是一位世界级的英雄，而图灵的性取向却让他成了不容于世的异端...", "content": "   《模仿游戏》的主角艾伦•图灵被誉为“计算机科学与人工智能之父”，他带领的团队在二战期间成功破译了德军的英格玛密码，拯救的人数以千万计，是一位世界级的英雄，而图灵的性取向却让他成了不容于世的异端，被迫接受残酷的“化学阉割”，最终吃下有毒的苹果自杀身亡。几十年后，另一位天才为了纪念他，用“残缺”的苹果作为了公司的logo，他的名字叫斯蒂夫•乔布斯。\n   任何一个伟大的男人身边，必然会有一个独特的女人。图灵的“女人”叫琼•克拉克，是他一生中唯一求过婚的女性。和图灵一样，琼也是一位出色的数学家，一位漂亮、聪明、专注、理智、独立的女性。她和图灵有着许多相似点，两人彼此欣赏，成了终生的挚友。\n   “有时，恰恰是那些意想不到的人会完成最意想不到的事。”这句《模仿游戏》里最著名的励志台词，在片中出现过三次，先后由图灵少年时的“密友”克里斯托弗、图灵自己，以及琼说出。这句话既是对图灵的激励与总结，也同样映照出了琼的个性。\n    在那个女性生存仍十分艰难的年代，琼成了破译德军英格玛密码团队中唯一的女性。她帮助图灵调和同事关系，良性地改变着他。无论是在工作能力，还是两性关系上，琼都是个有主见的女人。她拒绝社会给她的定位，会反问质疑她的男人，“凭什么你认为我没有能力解出字谜？！” ——5分34秒，她证明了自己比所有应试的男人都要优秀。\n     天才往往是怪咖，而能读懂怪咖的人，通常也会有一颗奇葩心。在图灵向她出柜，决定取消婚约时，琼这样回答，“我们用自己的方式爱着对方，我们能一起过我们想要的生活，你成不了完美丈夫，我也不想做什么完美的妻子，我不会整天给你做羊排，等你从办公室下班回家……我们享受互相的陪伴，我们享受互相的思想，因为我在乎你。我们彼此相知，胜过任何人。”这段灵肉分离的言论，放到现在依然是前卫的。 \n    即使表演的重担80%压在了“卷福”身上，在这部以男性作为绝对主角的传记电影中，饰演琼的凯拉•奈特莉依然闪耀着自己的光芒。她与多年的好友卷福互飙演技，在几场重头的感情戏中，凯拉释放出了一股能把观众吸进角色心里去的魔力，让听的人和看的人都被深深的打动，从而赢得了金球奖和奥斯卡的最佳女配角提名。\n     现年30岁的凯拉•奈特莉本身就是个“传奇”，她成功证明了性感有时跟胸围成反比。在凯拉的履历表上，极少出现柔弱的角色，就算在雄性的《加勒比海盗》里，也要做拿刀砍人，踢人裆部的女汉子，而不是任人摆布，惊声尖叫的花瓶。这些年，她在各种类型片里历练，驾驭着形形色色的角色，表演精进。一开始，你是为了卷福才去看《模仿游戏》，但当电影结束时，你会想了解更多的凯拉•奈特莉。\n\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7540851/", "id": "7540851", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 0, "author": {"uid": "susan", "avatar": "https://img3.doubanio.com/icon/u1034085-21.jpg", "signature": "我有病", "alt": "https://www.douban.com/people/susan/", "id": "1034085", "name": "Su3苏三"}, "created_at": "2015-06-06 12:10:51", "title": "向图灵致敬", "updated_at": "2015-06-06 12:10:51", "share_url": "https://m.douban.com/movie/review/7491737", "summary": "没有刻意强调Turing的同性恋 也没有过多的渲染他的悲惨结局 但整部片子有感动到我 尤其是最后结尾处短短几行字  但整体来说还是差一口气 没能把这种触动推至最高点  BC和Keira的表演算中规中矩 意外看到唐顿的司...", "content": "没有刻意强调Turing的同性恋\n也没有过多的渲染他的悲惨结局\n但整部片子有感动到我\n尤其是最后结尾处短短几行字\n\n但整体来说还是差一口气\n没能把这种触动推至最高点\n\nBC和Keira的表演算中规中矩\n意外看到唐顿的司机\n\n直到2013年才获赦免\n英国人欠图灵太多\n\n无人所念之人\n方能成就无人感想之事", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7491737/", "id": "7491737", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 2, "author": {"uid": "47336013", "avatar": "https://img3.doubanio.com/icon/u47336013-1.jpg", "signature": "", "alt": "https://www.douban.com/people/47336013/", "id": "47336013", "name": "无为丁"}, "created_at": "2015-03-25 22:39:53", "title": "模仿游戏 小记 有剧透", "updated_at": "2015-03-25 22:39:53", "share_url": "https://m.douban.com/movie/review/7424821", "summary": "       刚刚在乐视云盘把《模仿游戏》看完了，看的时候像上课一样在本子上记了很多，有台词，有场景的记录或者自己的思维发散，比较无厘头，没什么逻辑，仅仅按照影片的发展来写，有剧透，没看过电影的注意下，而...", "content": "       刚刚在乐视云盘把《模仿游戏》看完了，看的时候像上课一样在本子上记了很多，有台词，有场景的记录或者自己的思维发散，比较无厘头，没什么逻辑，仅仅按照影片的发展来写，有剧透，没看过电影的注意下，而且影片并不可能百分百真实反映图灵，所以下面所写只针对电影情节，不代表现实。括号里是我自己的思绪。\n      影片刚开始反映了当时通信的状况，旋钮式电话机，需要忙碌的接线员。（总体感觉影片是插叙，时间交错。）1951年图灵家中被盗导致邻居报警，但是警察被图灵赶走了，在警察来调查时图灵提到了氰化物。（这是不是对应日后他的自杀呢？）但是好奇心害死猫，一位警探锲而不舍想要探究下去。（刚看时我挺讨厌这个警探的，要不是这家伙多此一举，可能图灵就不会早逝，可能我们今天计算机技术的发展会有更好的突破，人工智能会有更大的进展，后来觉得这样想只是一种假设，没什么依据，况且作为警探，对事情刨根问底是一种高尚的职业道德，没什么可以苛责的。）1939年英国和德国处于战争状态，火车站的报童在吆喝新闻卖报纸。（突然想到我们国家报童卖报的形式是不是跟英国学习的？现在汽车站还有一些人在班车没有发车前到旅客的位置上推销报纸和小册子，而且经常进行虚假的宣传，先吆喝一个惊天动地的新闻，然后等买了后发现其实压根就没有这样的新闻存在在报纸中。随着智能手机的普及，报纸的生意就算在长途客车上都不太好做了吧。现在我们的生活用品和很多技术都是西方首创的，那我们的生活方式其实必须适应这些产品和技术，那我们其实已经西化了，传统的文化还怎么继承下去呢？希望能够被继承且发扬光大。）27岁的图灵来到公园与军方老领导会面，老领导夸赞图灵是个数学天才，23岁发表连题目都看不懂的论文，24岁成为剑桥的研究员，但图灵本人却不认可这个评价，牛顿22岁发明了二项式定理，爱因斯坦写了四篇足以改变世界的论文。（我们大多数人在20几岁在干啥呢，呵呵）见面并不是愉快的，老领导差点要赶客了，图灵却洞悉了军方找他的目的，就是破译德军的英格玛密码机，对于图灵来说就是拼字游戏，就是猜字谜。话虽如此，英格玛密码机有159百万亿种可能性，而且每天更换一次设定，如果要全部破解，十个人每分钟一行需要花费2千万年才能破译，为了保证盟军在袭击发起前了解德军的计划，要把时间缩小到20分钟内破解一道密文，这是几乎不可能完成的任务。\n      在团队进行工作的时候，图灵的性格与思维的不同导致与团队无法融合，天天跑步，设计机器，把一堵墙面贴上满满的纸（实际情况据说并不如此，只是电影想当然认为智商高的人情商必然低。）团队投诉他，老领导也不喜欢他。图灵找老领导提出了解决方案：申请十万英镑的经费设计一种机器，英格玛是精密机器，尝试用人打败不现实，可以用机器打败机器。老领导不同意，坚决回绝，于是图灵写信给了丘吉尔，得到了首相的支持并当上了团队的主管，新官上任就解雇了两个认为毫无用处的语言学家。（越级上告，坚持自我，很了不起，但是县官不如现管，得罪直接上司的后果古今中外都是不好的，后面这位老领导掣肘了图灵多次）这段插叙了1928年时图灵在念书的情况，在学校吃饭时图灵把盘中的胡萝卜片跟豌豆分类，受到了同学的捉弄，甚至把他钉在讲台下，好在有最好的且唯一的好友克里斯托弗的鼓励：有时正是人们不抱期望之人做出了人们不敢期望的事。（这句话在影片中出现过多次，很有味道，还有关于暴力的解读也出现多次）团队抱怨人手不够，图灵想到把字谜游戏登在报纸上广选英才：如果你能在十分钟内解出字谜，请拨打电话，就有一份激动人心的工作等着你。（《互联网时代》中提到谷歌曾经把高数题目登在路边广告牌上然后一步一步招聘，这是不是受图灵启发的）不少应征者来到报名处参加测试，要求6分钟内解出字谜，图灵本人用了8分钟，女主角克拉克率先在5分34秒完成。1940年图灵与克拉克探讨了数字计算机和电子大脑，克拉克劝导图灵发展与团队成员良好的人际关系。1941年在团队的共同努力下，图灵的机器——克里斯托弗（为了纪念逝去的好友所以才帮机器取这个名吧）计算英格玛的设定，也就是计算那159百万亿的可能，但是德军的设定每天都在更改，机器运行了很长时间都没有结果，老领导按捺不住要驱逐图灵，团队成员积极支持图灵才争取到了一个月的时间。在小酒馆休与另一位女同事调情的话让图灵喜出望外，克里斯托弗完全不必算所用的设定，只需算已经了解的固定的设定，大大减少了计算量，2年的努力成功了，片中这句话很经典：爱情让德国输掉了战争。（图灵的大脑天天都在想这个机器的事情，所以表面看是女同事无意义的聊天却让图灵有了思维的灵光，科学史上类似的案例很多啊）为了麻痹德军，不被德军了解英格玛已被破译，图灵用数学统计的方式确定哪些行动可以避开，哪些维持原样，可以避开和取得胜利的行动让情报部门找理由解释情报的来源，只要不让德军怀疑到是英格玛出了问题就行，这就等于决定了很多人的生死，片中提到生死不在上帝的手中，而在图灵团队的手中，当然明明知道可以避免伤亡却还要让伤亡发生是非常痛苦的事情。图灵工作的特殊导致他的一言一行都在监视中，毫无隐私可言，于是他提出与即将订婚的克拉克分手，并告知了自身同性恋的情况，违心说出无情的话激怒克拉克，想不到克拉克早就有所了解且不在乎这些，一直坚持到任务完成，可惜后来两人还是天各一方。（大概这就是柏拉图式的情感吧）警探与图灵在监狱中的对话也很有味道，机器会像人一样思考吗，机器思考的方式与人不同就是异类，那人与人之间如果思考方式不同那又算什么呢，还提到了著名的“图灵测试”。在法官审判的二选一中，图灵接受了荷尔蒙治疗，克拉克的来访也没能安慰他受伤的身心，一年后自杀，享年42岁。（人类好像就是这样，对于不同于自身的人或物总有不确定感，进而可能产生恐惧感，除之而后快，如果图灵不是有这么大的贡献，或者同性恋群体中没有过出类拔萃的人物，2013年女王会帮图灵翻案吗，会拍电影让人们正视并且包容这个群体吗，不得而知）\n       最后引用影片中的语句：历史学家认为英格玛密码的破解使二战缩短了至少两年，拯救了一千四百万人的生命，图灵机演变成了今天的电脑。\n\n（来自E书园）", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7424821/", "id": "7424821", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "memorymare", "avatar": "https://img3.doubanio.com/icon/u4332196-20.jpg", "signature": "宝鼎茶闲烟尚绿，幽窗棋罢指犹凉", "alt": "https://www.douban.com/people/memorymare/", "id": "4332196", "name": "说什么图灵"}, "created_at": "2015-03-12 11:55:17", "title": "他的悲剧难以被描摹", "updated_at": "2015-03-12 11:55:17", "share_url": "https://m.douban.com/movie/review/7406284", "summary": "  《模仿游戏》根据最权威的图灵传记《Alan Turing: The Enigma》改编，是刚刚过去的奥斯卡颁奖季的大热影片。对于大部分完全没听过艾伦图灵这位计算机之父的人来说，《模仿游戏》无疑是最佳的入门介绍传记电影，...", "content": "  《模仿游戏》根据最权威的图灵传记《Alan Turing: The Enigma》改编，是刚刚过去的奥斯卡颁奖季的大热影片。对于大部分完全没听过艾伦图灵这位计算机之父的人来说，《模仿游戏》无疑是最佳的入门介绍传记电影，然而如若是对图灵有所了解的人来说，《模仿游戏》留给人的却是一个又一个遗憾，虽然改编自权威传记，但对于恰巧读过这本传记的人来说，对电影中图灵却觉得有点陌生。\n     《模仿游戏》主要由三条主线构成：1954年因为房子被盗窃以致于被发现同性恋身份而给关押的图灵；借由审讯室中的图灵之口回忆交代了他在二战中工作，主要集中在破解德军电报密码ENIGMA的过程；以及穿插其中的艾伦图灵和他的初恋克里斯托弗的故事。对于一部电影来说，这三条主线已经足够充实，然而无奈现实中的艾伦图灵人生经历太过传奇和丰富，这三条主线只是图灵人生海洋中的桑海一粟，并不足以展现图灵为何是近代最伟大的科学家之一的原因。\n     本片剧本在改编处理上存在很多不小的瑕疵，比如专业性的缺失，艾伦图灵当时是一名顶尖的数学家，他从事的也是高度专业性的工作，这就决定了在表现艾伦工作的部分，首当其要的就是突出其专业性，而影片中呈现的艾伦图灵却出人意料的没有用过一个专业词汇，在第一场艾伦面试的戏份中，这本是表现其专业素养的最佳时期，但在面试官表示失望时，艾伦用于扭转其态度的几句台词却不具有任何说服力，听上去甚至让人莫名的疑惑为何面试官又要了他。剧本改编中的专业性的缺失使得观众很难对于艾伦图灵这位科学伟人的过人之处有直观的感受，这是剧本最大的失误。\n     其次就是气氛的缺失，当时的布莱切利是英国作战的大脑中心，每一步作战方针都几乎依赖于8号营房提供破解情报，所以其重要性和紧张程度可想而知。影片为了方便观众，将8号营房的蜕变过程简化成了几位主角，但表现出来的效果就是，丝毫感觉不到这些人工作的紧张感，镜头之下总是能看到他们悠闲的喝着咖啡，或者在门口的草地上野餐，唯一让人心头一紧的，只有艾伦成功破解enigma时众人在夜色中狂奔的一段。\n      当然，最让人需要指出来的就是影片对于图灵形象的塑造有许多不符事实的地方。影片中的艾伦图灵总是一副头发梳理整齐，衣着干净的，典型的英国知识分子形象，然而事实上，现实中的艾伦图灵是个略微邋遢，不修边幅的准宅男。在传记原作中总是会提到图灵外形着装的随意，甚至因为即使散个步走个路也要东闻闻西摸摸，以至于多次都被布莱切利的保安们当做间谍给逮了起来（当时读到这里的时候差点笑出声）。现实中的艾伦图灵是个标准的宅男脑，他的大脑可以解的了最难解的数学问题，提出最抽象最高明的理论，但对于人情世故却是一窍不通，为人耿直，说话直率，甚至公然炮轰过布莱切利的领导人是一群对科学一无所知的人，可以说得罪过不少人，是个交际能力为0的人。影片在对图灵的性格表现上稍微有些淡化，但大体上还是还原了图灵真实的性格。\n       最莫名的是那条间谍线索，至少在我读原作的时候，并没有发现其中有涉及到苏联间谍的内容。不知道这条线是否为编剧杜撰用以增加影片戏剧效果的。\n       影片修改最严重的就是图灵对于其同性恋身份的态度，影片中的图灵基本上回避了自己的性取向问题，这其实更像是现代的很多同性恋，而非几十年前现实当中的图灵。事实上，现实当中的图灵从来不回避自己的性取向，基本上与他共事的人都知道他是同性恋，但好在与其共事的也都是当时英国科学界的精英知识分子，大多数人虽然难以理解，但并不妨碍他们对于图灵的原有看法。尤其是由凯拉纳特利扮演的琼克拉克，图灵确实曾向她求过婚，但不久图灵就向她坦承了自己是同性恋的事实并要求取消婚礼，然而克拉克妹子也和电影当中一样，并不在意这一点而是坚持要结婚，虽然最后婚礼还是取消了，但克拉克依然和图灵保持着高度的友谊。没错，现实中的图灵就是有着这样一个男主角女主角俱全的标准电影范本的人生经历。不过虽然图灵确实和克拉克关系很好，但像影片中编纂的半夜爬窗户这种戏码，应该是根本不可能的事情，编剧估计对同性恋还是一窍不通的。\n     有关克里斯多夫的一段，编就将图灵塑造成了一个校园欺凌的受害者，而克里斯多夫则是充当了一个高大的拯救者的角色，可以说这是一段标准的老式的王子拯救公主的老套模板套路。而事实上图灵并没有遭受过校园欺凌，正好相反的是，由于他天生怪才，还是让老师非常头疼的一位学生。图灵与克里斯托弗的相遇属于流水遇知音，惺惺惜惺惺，而且两人甚至还没来得及戳破那层窗户纸，这段感情就因为克里斯托弗的突然病逝而夭折。但克里斯托弗确实在图灵心中拥有至高无上的地位，在其去世后，图灵不论去哪里都会抽空去看望克里斯托弗的母亲或者给她写信。而那台机器也确实被命名为克里斯托弗，虽然在传记中作者对于这段感情着墨极少，但电影将其设置为一条主线也是可以接受的事情，只是图灵与克里斯托弗的感情更着重在两位天才少年的智商和感情的撞击，而非简单的少女式怀春，因为现实当中的克里斯托弗比图灵要还聪明，他们的交流更多的集中在智商的较量上。\n        占据影片最多份量的破解enigam部分是由在审讯室的图灵自己交代的，原因是官方档案被销毁，这其实是不可能的事情，因为现实中的图灵是个口风极其严密，守口如瓶的人。图灵是个高度专业的科学家，从事的也是涉密职业，连他的母亲都完全不清楚他在二战时做的什么工作，更别说是对一个陌生人侃侃而谈了。\n       影片最大的遗憾就是结局的处理，图灵最后是因为一个毒苹果而死，如果电影选择表现这个场景，将会是极具诗意和想象空间的一段，然而电影最终还是选择了使用文字的方式来交代，极度的削弱了这个悲剧的结局带来的冲击力。其实导演完全可以用那个著名的被咬过一口的苹果来作为图灵突然死亡的表现场景，正好据说乔布斯的偶像就是图灵，而乔布斯也是因苹果而死，这个意向又会具有双重含义。\n       \n      现实中的图灵是个典型的高智商宅男，有很多怪癖，是个呆萌呆萌的学霸，虽然对人际交往一窍不通，但在感情上却是个非常主动和有点小聪明的人。图灵一生寻求过多段感情，但可惜即使是在今天也不一定能寻求的到，更何况是60多年前，那个同性恋甚至还是违法被判罪的年代。最终让图灵引火自焚的直接原因也是遇人不淑，将一个小混混引狼入室。有关图灵的死因，到底是自杀还是他杀一直是一个谜，而这个谜并不难解，只是当时的英国政府敷衍了事了而已。\n \n \n     尽管《模仿游戏》有着各种各样的缺陷和遗憾，但依然要感谢这部电影的团队，因为他们让这位传奇又悲剧，背负了一身秘密的伟大的人被世界所知晓。事实上由于艾伦图灵一直参与的是最高级别的涉密工作，到底他在二战当中还做了哪些工作，到现在都是一个谜。但至少我们都知道的是，他的付出让二战至少提前了两年结束，他的智力拯救了无数的生命。图灵的一生除了破解enigam之外还有很多其他重要的成果，比如奠定现代计算机思想基础，战后还和香农一起研究过语音加密，在他生命的后期他又开始研究生物学等等。在他去世后，计算机学科成长为当今最强大的学科之一，计算机学界为了纪念他的伟大贡献，特意将计算机科学最高奖命名为图灵奖。\n　　《模仿游戏》的意义早已不单单是一部单纯的电影，他更大的意义在于让我们知道，一位改变了世界的天才又是如何被这个世界无情摧毁的悲剧，正如有人说的那样，“所有人都得救了，除了图灵”。 当然，对于我朝来说，还可以让那些整天说着“腐国”的人，对于英国对同性恋的态度有一个直观的认识，因为即使是图灵这样的科学伟人由于性取向被定的罪，也得到了2013年才被女王特赦，据说2009年时科学界就曾向英国政府提起过有关图灵的平反申请，但却被政府严词拒绝，于是更多的科学家联名请愿，才最终搬动了女王大人的特赦。\n\n      最后，本片的演员阵容有着本尼迪克特，凯拉奈特莉，马修古迪这几位中国缘极佳的演员加盟，如若在我朝上映，相信票房一定不俗，所以本片让人扼腕叹息的地方着实太多。如果观看了本片之后对于图灵的一生感兴趣的，可以亲自看一看那本传记，中译本名为《艾伦图灵传：如迷的解密者》（豆瓣：http://book.douban.com/subject/10522003/）。这本传记原作同样是一位数学家，而中文译者也是一名人工智能的从业人员，所以这本中译本素质极佳，推荐感兴趣的阅读。当然，电影上映后也推出了电影同款的英文版：http://item.jd.com/1408030967.html", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7406284/", "id": "7406284", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 6, "author": {"uid": "rsywx", "avatar": "https://img3.doubanio.com/icon/u2357018-4.jpg", "signature": "Alea Iacta Est!", "alt": "https://www.douban.com/people/rsywx/", "id": "2357018", "name": "TR@SOE"}, "created_at": "2015-02-26 21:50:07", "title": "图灵（Turing）（1912-1954）——生平与成就", "updated_at": "2015-02-26 21:50:07", "share_url": "https://m.douban.com/movie/review/7389867", "summary": "就不写影评了。发一点历史资料。原文来自霍金的《上帝创造了整数》，我随便翻译的。译文链接：http://rsywx.com/gcti/turing  =====这是分割线===   美国物理学家奥本海默正等着在国会委员会前作证，委员会试图剥...", "content": "就不写影评了。发一点历史资料。原文来自霍金的《上帝创造了整数》，我随便翻译的。译文链接：http://rsywx.com/gcti/turing\n\n=====这是分割线===\n\n\n美国物理学家奥本海默正等着在国会委员会前作证，委员会试图剥夺他最高机密的特权。奥本海默的朋友兼同事拉比试图安慰他。拉比对他说：“奥比，要是在英国，你在原子弹上的成就足以让你获得骑士头衔。”\n\n如果说奥本海默因领导曼哈顿项目，而结束了太平洋战争，因此记头功的话，那么图灵也应该同样被记头功：他破译了纳粹使用的加密设备Enigma，而将欧洲的战争提前结束。二战之后，图灵受到的荣誉比骑士身份低。获封骑士意味着要公开承认图灵破译了英格玛密码，而英国保守这个秘密长达25年，图灵早已死去多年。讽刺的是，在图灵因为“严重猥亵”行为而被捕时，这个荣誉没能起到什么用。反而加重了他违背公共道德的指控。他不仅是犯下了严重猥亵的行为，而且还是对一个劳动阶层的某人实施。\n\n图灵出生于一个有着一些地位的家庭。图灵家族的先祖可以追溯到14世纪，来自北苏格兰的阿伯丁郡。1603年，詹姆士一世登基，斯图亚特王朝南下英格兰，当时他们必定是支持者。1638年，查理一世册封约翰·图灵爵士为从男爵。因为有这个封号，约翰爵士差点在英格兰内战中丢了命。\n\n图灵的母亲埃瑟尔·斯通尼，来自一个爱尔兰新教徒家庭，1688年从奥朗热的威廉手里获得了土地。他们的一个远方堂亲乔治·约翰斯通·斯通尼于1894年创造了“电子”这个单词，那正是原子时代刚降临的时候。埃瑟尔的父亲爱德华在英属印度因建造铁路和桥梁而颇有名声。她和图灵的父亲尤里乌斯·马希森·图灵在1907年春认识，他当时第二次从印度回国。他获得牛津的学位后，在印度行政部门开始他的事业。他们于当年10月结婚并返回印度。第二年9月，他们的长子约翰出生。图灵是他们的次子，于1912年6月23日生于伦敦。当时全家正在英格兰度假。\n\n受雇于印度行政部门的英国人过着既有好处也有代价的生活。在印度，他们生活近乎奢华，比他们回国后能过上的生活好得多。但是印度毕竟不是大不列颠，特别是对于孩子来说，回国后有很长一段时间无法和父母在一起。这也是小图灵的生活：在他九个月大的时候，父亲返回了印度，母亲六个月后也回了印度。这两个孩子留给沃茨家庭照顾。沃茨家和他们无牵无挂，是退役军官家庭，住在黑斯廷斯附近的一个小镇。\n\n沃茨家没法给图灵家的孩子太多的时间，他们自己有四个女儿。沃茨上校古板又不尽人情。图灵也让沃茨太太失望，因为他对军事玩具没有任何兴趣。这就是图灵在成长期过的生活，父母都远在印度。幸运的是，老图灵于1926年辞去了印度的工作，此时图灵刚进入伯恩，一所古老的英格兰公共寄宿学校。\n\n在伯恩，图灵一直没法适应。第一学年结束时，图灵的校长写信给他的父母：“如果他找到工作，他应该可以做的非常好。但同时，如果他试着作为学校的一分子而努力做到最好，那会更佳。他应该有更多的团队精神（esprit de corps）。”图灵在运动场上表现糟糕，同样在课堂上也表现糟糕。前一年半，他所有非科学类的科目的成绩都是垫底的。但是数学和科学的成绩就完全是两码事了。图灵很快在这些课程上出类拔萃。第二学年的下半学期，他“幸运地”得上了腮腺炎，于是有机会钻研这些课程而对其他科目置之不理。他待在学校疗养院的时候，研读了爱因斯坦狭义与广义相对论的通俗版本。\n\n在伯恩的时候，图灵和克里斯多夫·摩康姆成了密友，他比图灵长一年级。摩康姆所是，正是图灵所不是。他各科成绩优秀，赢得了多项学校奖励。他们对数学都有激情，并希望能进入剑桥三一学院继续深造——那是一所培养了牛顿和罗素的学院，英格兰数学的真正中心。\n\n1929年，两人参加了三一学院奖学金考试。摩康姆成绩斐然，顺利通过。图灵却没有。他一想到，虽然可以进入剑桥另一所学院，但不能和摩康姆朝夕相处就心烦意乱。但两人在剑桥没能共同相处。1930年2月，摩康姆突然发病并死于肺结核综合症。这个病是摩康姆小时候患上的。\n\n摩康姆的死让图灵彻底陷入了孤独。他的父母只是一次离开他一两年，而摩康姆却永远的抛弃了他。图灵决定，要进入剑桥，而且凭一己之力完成两个人可以获得的成就。他做到了！图灵最终获得了剑桥国王学院的奖学金并于1931年秋天入学。从多方面来看，国王学院要比三一学院更适合图灵。拥有凯恩斯和福斯特的国王学院不像三一学院那样死守于传统。它的老师甚至会和学生们走在一起！对于图灵来说，能在剑桥学习数学是一种乐趣。他终于到了这样一个环境：伯恩学校所强调的那些特质，诸如体育才能，个人魅力，在这里统统不重要。这里只看重你的数学能力，而图灵是这方面的王牌！\n\n作为他的本科毕业论文，图灵研究出了一种新的概率中心极限定理的证明，并以“杰出”的评分通过了本科考试。这些成果让他获得一份年金得以在国王大学进行研究生工作，而这也导向了他最伟大的数学成就：他1936年的论文《论可计算数及其在判定问题上的应用》（本书有选入）。\n\n1928年，德国数学家希尔伯特——这位在世的最伟大的数学家向数学界重新提出了三个他最早在1900年巴黎国际数学家大会上提出的问题：\n\n证明所有的真数学命题可以被证明，即数学的完备性。\n证明只有真数学命题才可以被证明，即数学的一致性。\n证明数学的可确定性，即存在一种判定过程，来确定任意给定数学命题的真伪。\n1934年末，图灵得知哥德尔已经证伪了前两个挑战。现在还留下第三个挑战。图灵开始解决这个问题。他从1935年春开始，一直到1936年春结束。为了研究这个问题，他需要为判定过程这个概念下一个精确的定义。他需要将其形式化。也许是受到小时候对打字机的兴趣的影响，图灵通过将判定过程概念用机器——即我们现在所知的图灵机——来表述而完成这点。\n\n图灵意识到打字机只能在一张纸上书写。它们不能去解释这页纸的内容——那是打字员的工作。图灵意识到，要去除人的因素，机器需要能读取输入，就像写出输出那样。图灵做了极度的抽象和简化，设想他的机器对一卷磁带进行操作，磁带上有小方块，可以是一个标记也可以是一个空白。这卷磁带长度无限，左右都没有边界。图灵给予机器的能力是：从磁带上读取，在一个方块中写一个标记，或者在方块中抹除一个标记。为了避免人的影响并做到纯机器化，那么对于机器扫描的每个配置和符号的组合，机器本身的构造就有必要确定如下事项：\n\n是否要在一个空白方块内写符号，还是擦去符号，还是既不写也不擦；\n是否继续使用当前配置（即一系列的规则），还是换用另一套配置；\n要向左还是向右移动，还是保持不动。\n定义一台自动机器的这些信息写下来后，就构成了“行为表”，该表是有限的，而且完备地定义了机器的行为。在抽象的角度看，这个表就是机器本身。\n\n这样的表可以有好多张，各自定义了不同表现的一种机器。一台很简单的机器可以机械性的模仿两数相加的过程。假定每个数字都由磁带上连续的标记表示，两个数字之间用一个空白分割。机器先从两个数字中最左边被标记的方块开始。它向右移动，找到符号不做处理。而在找到第一个空白的时候，写下一个记号，表示第一个数字结束，第二个数字开始。然后改变配置为如下规则。一直向右移动，对找到的有标记的方块不做处理，直到碰到下一个空白方块。这也标记了第二个数字的结束。向左移一次并删除那个符号。具有稍微复杂一点的一个表格的图灵机可以用来定义两数的乘法。但这些都是简单的过程。相反，图灵意识到，如希尔伯特判定性问题所要求的那种判定机器不能被直接构造出来。最多，其存在只能被推导出来。而如果这样的机器不存在，也就是只能被推导，那么也许可以使用所有这样的机器的库存——图灵正是这么做的。\n\n他假定，所有的机器按照一个确定的次序安防。他然后注意到，一个方块上面有符号可以被解释为1，而一个空的方块可以被解释为0。做出这样的解释后，机器就可以被理解为产出0和1的磁带。假定这些0和1的序列前置一个小数点，图灵就可以将每台机器（以二进制方式）表达为一个0和1之间的实数。图灵将这些数称为可计算数，而他进而用康托的对角线法构造一个实数，但它不是一个可计算数，一个与表中所有数都不同的实数。这样的一个数不可能是排列好的机器中任何一台机器的输出。这是一个不可计算数。\n\n图灵还没讲完。也许康托的对角线法本身不过也是一个机械过程，它所作的无非是，计算第一台机器的表格中的第一个方块（并改变其值），然后计算第二台机器的表格中的第二个方块（并改变其值），如此类推，永无止境，第2241985台机器的表格中的第2241985个方块（并改变其值）……但是，图灵意识到，这需要我们假定第n台机器确实能达到第n个方块，但没人保证第n台机器不会进入一个循环而永远到不了第n个方块。既然没有判定过程——这个过程本身是否存在还是一个大问号——也就没有方法去检查机器的表格，看看它会不会陷入循环。唯一能确定一台机器是否避免了这样循环，是让机器跑，直到它达到第n个方块。但是，这需要对所有最初排好的那些机器都做一遍，以证明康托对角线法确实是个机械过程。为所有机器都做一次，将需要无穷多步，而不是图灵定义的机械过程所规定的有限步数。因此，在图灵定义的严格意义上，康托对角线法不是一个机械过程。\n\n图灵证明了，不存在判定过程。短短六年间，哥德尔和图灵粉碎了希尔伯特的梦想。\n\n正如图灵本人的一贯风格，他关于可计算数的成果完全是原创，一点也不是从他人的开创性成果中推导出来的。事实上，它是如此原创，以致于图灵根本不知道美国逻辑学家丘奇用完全不同的方法就希尔伯特的判定问题得到了相同的结果。图灵的证明是如此革命性，因此伦敦数学家协会认为只有丘奇本人才能来审阅这篇论文。丘奇不仅审阅了论文，而且邀请图灵来到普林斯顿大学跟他学习。图灵在剑桥的导师纽曼同意了。\n\n普林斯顿的仿哥德式建筑让图灵想到了在剑桥的时光。但是，如果说剑桥蕴含的是阶层，普林斯顿展现的是财富。图灵对这样的财富根本就不熟悉。它研究院的钟楼模仿了牛津莫德林学院的钟楼。学生们开玩笑地称之为“象牙塔”，这倒不是因为它俯视着在下面举行的通常都是优雅万分的学术活动，而是因为它俯视着“普克特大厅”。这是研究生院的主要公共大厅，它的建造来自威廉·库伯·普克特的捐赠。而这位普克特先生创建了美国公司P&G，它们生产象牙肥皂！\n\n只要不违反数学系的规章，图灵可以想干嘛就干嘛，也没有非要遵守什么的要求。他在系里感觉像是到了家。但是，尽管冯·诺依曼邀请他到高等研究院当一名助理研究员，图灵还是决定在获得博士学位后回到英格兰。他认为，美国作为一个整体，而长老会派的普林斯顿作为其特例，不会那么轻易容忍像他这样一个从不墨守成规的人。\n\n1938年夏天，战争爆发前沿，他回到了欧洲。在回到剑桥之前，图灵先拜访了外交部开办的政府密码和解密学院（GCCS），并告诉他们他开始了加密，特别是解密技术的研究。1939年战争爆发后，图灵离开他剑桥的教职，立即向由GCCS建立的，位于小镇布莱切利公园的场所报道。该镇正是牛津到剑桥的铁路和伦敦到北方的铁路交汇之处！\n\n在布莱切利公园，图灵和一位女性有了唯一一次正式的交往。琼·克拉克在1940年6月向布莱切利公园报到的时候，她正准备参加剑桥数学学位的最后考试。她的哥哥也曾就读于剑桥国王学院，而她在战前也和图灵见过一次。1941年春，图灵开始和琼约会。他们上班的班次一样，所以有机会一起下棋或者去看电影，或者一起休假的时候，进行为期一天的自行车之旅。\n\n约会了几个月后，图灵向琼求婚，琼也理解答应了。没过几天，图灵当时已经有了别的想法，他向琼坦白了他的同性恋倾向并希望她能终止订婚。出乎图灵的意料之外，她没有那么做而带他去伦敦见了她的父母。\n\n图灵和琼同意将他们的订婚消息保密，而只告诉最亲密的几个朋友。她在班上也从来不戴订婚戒指，而两者之间也继续以“图灵先生”和“克拉克小姐”互相称呼。几个月后，图灵意识到他无法继续这桩婚姻。他是爱琼，但更多多的是那种他想象中对妹妹的爱，或许是对摩康姆母亲的那种爱。他对她的爱很深，但不是那种对摩康姆的爱。和琼取消订婚后，图灵确保他不再和她在一个班次上工作。\n\n战争结束后，图灵本来可以恢复他剑桥的教职并在数学领域开展他的职业生涯。但是，其英格玛上工作让他有了“建造一个大脑”的热情。剑桥不是做这件事的场所。而伦敦的国家物理实验室则是！战后，冯·诺依曼（一位普林斯顿人）和图灵各自开始研究第一台真正的计算机的工作。他们都设想了一台有着指令存储的计算机。但他们的相似之处也仅此而已。冯·诺依曼倾向于储存在计算机中的指令不能修改。它们只能说是以一种预定义的方式存储在里面。图灵走得更远。他认为计算机应该存储一系列指令表格，对于输入可以按需调用。图灵创造了对一台有内部程序存储的自动电子数字计算机编程的艺术！\n\n在国家物理实验室期间，英国政府因图灵在战争期间的工作授予图灵大英帝国勋章（Order of the British Empire，简称OBE）。OBE勋章对图灵没有什么影响。由于国王生病，授奖仪式被取消，图灵大松了一口气。在他办公室门上漆有这些字母只是意味着，无论是谁问他做了什么而得了这个荣誉，他必须回答。到最后，他就把勋章收到了工具箱里。\n\n计算机项目开始不到两年，图灵意识到项目陷入了官僚主义的泥沼之中。他知道他要的不是这些，于是他提早了休假，离开伦敦而回到剑桥这个庇护所，图灵恢复了教职并在那一年教授数学。回到剑桥后，图灵和一名三年级本科生内维尔·约翰逊有了超越师生之间的关系。\n\n那年末，内维尔从剑桥毕业而离开。图灵也离开了。他没有回到伦敦的国家物理实验室，而接受了英国中部曼彻斯特大学的一个教职。他之前的导师纽曼在那里领导着一个团队，并在建造计算机方面做出了显著的成果。曼城的简陋让图灵很满意。这里没有那种剑桥或者普林斯顿的氛围。也没有剑桥对离经叛道的容忍。\n\n1952年，图灵到曼城警察局报案，说他家被偷窃了。罪犯名叫“哈利”，图灵同性恋新伙伴的一个相识。哈利老于世故，认为图灵是个偷窃的好目标。作为同性恋者，在20世纪中叶的英国图灵不受到法律的保护。但是哈利算错了。图灵真的去了法律部门。在图灵天真的帮助下，有关部门指认了哈利就是罪犯，并以偷窃罪将其逮捕。\n\n哈利也许是棋差一招，但图灵则错的更加严重。他付出的代价远远高于哈利。政府指控他“严重猥亵”罪。也许更糟糕的是，图灵事实上跨越了阶级区分，而和一个劳动阶层的人发生了亲密关系。相比之下，他在大学中的同性性行为，出了围墙就没有人注意。\n\n他被定罪后，图灵选择接受雌性激素治疗，而不是两年入狱。他宁可放弃情感的欲望，也不能放弃两年的知识追求。但他的选择很糟糕。雌性激素治疗引发了不举（其实就是目的所在）以及严重的抑郁。有一次，图灵对一位朋友说：“我开始长乳房了！”而给另一位朋友的信中，他重新形式化了撒谎者悖论用在他自己身上：\n\n图灵认为机器会思考。\n图灵撒谎了。\n因此，机器不会思考。\n图灵于1954年自杀。\n\n我们只能想象，图灵如果活下去，他能有怎样伟大的成果。我们也只能想象，要是图灵所受的折磨早发生十五年，在他于二战期间领导了破解纳粹使用的英格玛密码之前，英国和整个自由世界会有怎样的后果。不过，图灵已经证明，没有机器可以判定这个问题。", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7389867/", "id": "7389867", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 4, "author": {"uid": "1762955", "avatar": "https://img3.doubanio.com/icon/u1762955-21.jpg", "signature": "偷得浮生日日闲", "alt": "https://www.douban.com/people/1762955/", "id": "1762955", "name": "榴莲王子"}, "created_at": "2015-02-07 21:09:44", "title": "天才的悲剧总是比常人的悲剧更具有破坏性", "updated_at": "2015-02-07 21:09:44", "share_url": "https://m.douban.com/movie/review/7371572", "summary": "他的天真与偏执，他的奔跑与口吃，他的克拉克小姐与克里斯托弗，他的一口苹果与填字游戏。  来，先做个小游戏，你可以试着回答一下，在看这部电影之前，关于图灵 我们都知道些什么？  著名的公开同性恋者（却结过...", "content": "他的天真与偏执，他的奔跑与口吃，他的克拉克小姐与克里斯托弗，他的一口苹果与填字游戏。\n\n来，先做个小游戏，你可以试着回答一下，在看这部电影之前，关于图灵 我们都知道些什么？\n\n著名的公开同性恋者（却结过婚），著名的图灵测试与图灵机，著名的苹果（乔布斯曾说：（苹果的标志来源于图灵）不是真的，但我多么希望那是真的），著名的密码天才。\nOK，这些就足够了。\n\n关于电影\n很难找出比图灵更适合被拍成传记片的原型，他的一生如此传奇又如此悲剧，就如一个苦涩的笑话。而他的性格又是那么容易被脸谱化（无非是不被世人理解的怪异天才），可短短113分钟，又能让我们看到多少真实的图灵？\n是的，并没有那么多。\n\n本片选择了传记片比较讨巧的手法：三线并行叙事，选择他人生中较为重要的三个点：少年时代的初恋、二战时期破译德方密码Enigma，以及战后被捕的口述。而重点叙事是图灵在布雷契莱庄园（当时的英国情报破译中心）的时期。\n\n为什么，因为这样最好看，是的，好看，轰然倒下的历史就在眼前，一分钟就有三位年轻的士兵在战争中死亡，近代史最黑暗也最耀眼的一页。只是，这些还远远不是他的一生。\n\n但不可否认，最后寥寥几句带过的字幕还是让我足足哭了一分钟，不知是为电影还是为他，也许，为什么也并不重要。有些庆幸导演没有拍出图灵离开这个世界时的细节，那样恐怕又会多用一包纸巾。\n \n关于真实\n该片最大的改动，就是那台机器，原名为bombe（一种甜品的名字，来源于早期波兰的一款破译机：bomba，但因为与bomb形似，一般翻译为炸弹）的破译机被改为了Christopher，也就是图灵初恋的名字。固然更凄婉浪漫，却并非图兰本意。但故事与史实，本不可兼得，作为一个狠戳泪点的梗，倒也无可厚非。\n\n还有一点是，真实的图灵在生活中不修边幅，总会把他身边的环境搞得一塌糊涂，西装对他来说几乎是不可能的，可在电影中，图灵穿上了规规矩矩的三件套，干净整洁，甚至一丝不苟，或许因为导演的敬畏之心，或许只是方便卷福粉舔屏，不得而知。\n\n最后一点，在求婚的第二天，图灵就向克拉克出柜了，而他也真的爱她，只是无需身体而已，并不是电影中因为可以继续工作的关系。这点改动虽小，但对于表现图灵的并不低下的情商是比较大的损害。\n \n关于跑步\n从在剑桥的学生时代开始，图灵就热爱跑步，这是一件孤独而自给自足的事，还在战争结束后差点跑进了奥运会。\n引用一段书中的原文：他跑得并不是很快，也不是很好看（因为他扁平足），但他要强迫自己培养耐力。这一点电影的表现倒是很准确。\n \n关于苹果\n有人说，图灵吃了那只涂有氰化物的苹果并不是自杀，而是因为他的房间实在是乱得可怕（甚至他的母亲也认同这样的猜想）。有人说，是因为图灵从小就喜欢白雪公主的故事，尤其是将苹果浸上毒药的那段，只是，并没有王子来吻醒他。\n \n每一个国家的建立与成长都会经历它的黑暗时期，而图灵的大脑将时代远远抛在身后，肉身却无法抽离。\n\n总体来看，电影拍得过于工整，不管有没有刻意讨好奥斯卡，它都是一部中规中矩的学院派作品。有些情节设置过于幼稚（比如休与图灵的相爱相杀），而所谓格局也未见其显，更为了凸显悲剧而给图灵生加了自闭症倾向的性格。\n\n这一切都让模仿游戏注定只能成为一部平庸之作，但如果你像我一样对图灵的印象只限于开篇提到的那几条之外，那这部电影依然那样值得我们花两个小时去认识一位曾改变过世界的天才。\n\nfrom 一个与七个", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7371572/", "id": "7371572", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "62578846", "avatar": "https://img3.doubanio.com/icon/u62578846-6.jpg", "signature": "", "alt": "https://www.douban.com/people/62578846/", "id": "62578846", "name": "spoon"}, "created_at": "2015-01-22 19:16:54", "title": "个人记录", "updated_at": "2015-07-30 10:25:10", "share_url": "https://m.douban.com/movie/review/7352953", "summary": "不是影评，仅个人记录。  关于图灵在二战期间参加英国政府一个机密计划的事件，期间设计了人功智能破解德军的密码系统Enigma，帮助二战提早两年结束，预示一个伟大的计算机时代的来临。 “计算机科学之父”。虽然...", "content": "不是影评，仅个人记录。\n\n关于图灵在二战期间参加英国政府一个机密计划的事件，期间设计了人功智能破解德军的密码系统Enigma，帮助二战提早两年结束，预示一个伟大的计算机时代的来临。\n“计算机科学之父”。虽然只上过一年计算机相关课程，但我也记得数据库老师讲过这个人，以及他的“图灵机”“图灵问题”。电影里，图灵让警察问他问题，以直观解释“图灵问题”时，我又激动又莫名地觉得温馨：我知道这个，老师讲过！（泥垢......\n里面的图灵个性是奇葩了点，与卷福有相像之处，像自视甚高啦极烂的人际交往啦，难道天才都有个极烂的个性。\n但个人命运忒惨了点。\n伟大。感动。唉。还有很多思考。\n\nSmart is a new sexy. 这个图录有着所有流行于当下影视剧的天才人物的特点：聪明，自闭，基友，无名英雄，再加上特定的二战背景。但这些都变得不重要。与其他影视剧的天才不同是的，图灵是真实的，但这些标签都不重要。我不知道编剧是不是有目的地以这些作为卖点，但在看电影时，这些都不重要，电影里最有趣的是图灵这个人。\n看他对人、事件作出怎样的反应，推敲他怎么想的，还有他与女人（忘记名字了）、与队友之间的感情，这种近交际无能的人与他人进行的互动和发展的情感其实就像是我们平常人与他人建立情感联系过程的慢镜加特写，将那个生硬与笨拙放大，这部份很有意思。\n而他与女人的感情，与队友的感情，都很感人。\n少年基友那段我倒是看得很淡定，不是觉得故意卖腐，因为作为一个同性恋图灵无疑是有过这样类似初恋的一段的，而是这一段我更感趣的是小图灵的反应，行为学家心理学家要爱死他了。\n最后，打了荷尔蒙的图灵变得情绪外露而脆弱，哭倒在机器前说“I can't be alone, don't leave me alone\"太悲情了。\n但是他对机器的爱在结尾处如此明示的说出来强化（“我选择化学阉割，因为不能去坐牢，我的机器会被收走，他正在变得越来越聪明”），我觉得煽情过了，电影到这里，图灵已经不需要再加一项病态的感情来加深人们对之的“迷恋”，这段强调是败笔。不过，如何处理会更好呢，没想到。", "useless_count": 1, "comments_count": 1, "alt": "https://movie.douban.com/review/7352953/", "id": "7352953", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 0, "author": {"uid": "64225096", "avatar": "https://img3.doubanio.com/icon/u64225096-2.jpg", "signature": "", "alt": "https://www.douban.com/people/64225096/", "id": "64225096", "name": "无事公"}, "created_at": "2016-01-30 13:59:23", "title": "模仿游戏：图灵传", "updated_at": "2016-01-30 13:59:23", "share_url": "https://m.douban.com/movie/review/7754829", "summary": "我们知道比尔盖茨，知道微软；我们知道马云，知道淘宝；我们知道苹果，知道乔布斯。但有几个人知道计算机的创始人，有几个人知道艾伦·图灵！   这部叫做模仿游戏的电影，开始看的时候还以为是上个世纪二战后悬疑...", "content": "我们知道比尔盖茨，知道微软；我们知道马云，知道淘宝；我们知道苹果，知道乔布斯。但有几个人知道计算机的创始人，有几个人知道艾伦·图灵！\n \n这部叫做模仿游戏的电影，开始看的时候还以为是上个世纪二战后悬疑片，为什么这人家里被盗了反说没事？或是谋战片，回到十几年前的二战时期，他又是要如何破译德军的加密电码？一直到差不多中段的时候，他跟女朋友讲述他的想法时，我才微微觉得他要创的机器原来正是电脑，也才想起好像计算机之父就是图灵。\n \n没有想到这部讲述讲算机诞生史及讲算机之父平生事的电影，竟然叫模仿游戏这么不起眼的名字。就因为这么个名字差点还让我要把它删掉，还好我认真的把前半部看了，并且也被它的悬念吸引，才知道有这部讲述一个伟人的电影。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7754829/", "id": "7754829", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "92508682", "avatar": "https://img3.doubanio.com/icon/u92508682-1.jpg", "signature": "", "alt": "https://www.douban.com/people/92508682/", "id": "92508682", "name": "酥偼"}, "created_at": "2015-08-08 16:46:17", "title": "A machine or a human being?", "updated_at": "2019-01-16 19:23:48", "share_url": "https://m.douban.com/movie/review/7563590", "summary": "写在前面不得不吐槽的话： 1.自从看了Begin Again后记住了KK的脸，没想到这部电影的女主又是她。老了好多的感觉，好奇怪。 2.自从在音悦台知道了一个叫Christopher的丹麦歌手,而且歌唱得还不错。每次提到这个名字...", "content": "写在前面不得不吐槽的话：\n1.自从看了Begin Again后记住了KK的脸，没想到这部电影的女主又是她。老了好多的感觉，好奇怪。\n2.自从在音悦台知道了一个叫Christopher的丹麦歌手,而且歌唱得还不错。每次提到这个名字就不停跳戏啊。\n3.本来这篇影评要叫做Christopher------My lover  不过看了其它影评才知道，图灵根本没有把这个机器命名为Christopher.而且这部电影有点OOC，而且有些地方不符合史实（竟然是有分类在传记电影），就不是很想写这部电影的影评了，不过昨天晚上写了一点了，不要了，太浪费，所以还是写完。\n\n\n正题：\n  这部影片我拖了很久才看。在它还没有在中国上映的时候，逛B站的同学应该有印象有那么几次看到电影那一栏的播放排行榜都有它在列。不过我并没有点进去看，因为看封面知道是在《神探夏洛克》中饰演夏洛克的演员主演的。我很担心这部电影是因为很多人是男主的粉丝才火的，毕竟周围都有很多人喜欢《神探夏洛克》，所以担心内容和质量，一直没有看。而且看电影的名字也不是很吸引人，最初还以为是要讲男主去饰演一个在历史上有巨大贡献的人物，然后有一个很刺激的游戏就产生了，笑 原谅我的想象力。\n  直到在空间看见有学霸推荐这部电影；有同学晒看第二次的票根；还有发的我看后才知道的，剧中那句很鼓舞人心的：Sometimes it’s the people who no one imagines anything of who do the things that no one can imagine.\n  最近很想看一些烧脑的电影，就在网页上搜索，结果就看见了这部电影。（虽然不怎么烧脑，但我还没有搞清楚为什么“只要认识一个德国人就好”的原理。 看完之后觉得是分错了类吧 笑）也是观看的一个契机。\n我看电影喜欢把它下载下来看，这部电影是我下过占内存最大的电影，刚开始觉得幸好没有枉费我的内存啊，笑。（下载东西都只关注内容，不关注画质的我）\n\n\n*真·正题\n  开篇节奏有点快，我要一边看英文字幕，一边看画面，而画面又一直在变，有点吃力。而且刚开始的时间点切换有点频繁，不过还好能够凭借在Bletchley和Nock警探（安利一下这位警探是在我很喜欢的美剧Penny Dreadful里面饰演弗兰肯斯坦的First born）分清楚现在和过去。（有人说这个是冲奥片 确实，有八项提名，而且还获得了“最佳改编剧本”奖）\n  在防空洞内看见有很多市民都在做填字游戏很感动，大概是在那个时候看见了所谓的“团结”和“奉献”吧。还有人在拉手风琴，不仅是让自己镇定也同时也让周围人放松了心情吧。\n  本尼的演技在最后一段很显眼，宁愿化学阉割也不愿意离开Christopher的感觉表现了出来。不过这台机器的真实名字叫做“Turing Bombe”，剧本真是改的让人心惊，电影中图灵把自己的感情都寄托在Christopher上，电影最后我哭的唯一地方也是这儿，但竟然是假的，（是化学的成分，）让我怎么写Christopher啊。\n\n图灵和Bombe\n制作一件东西，就像弗兰肯斯坦造人一样，会把它当做自己的儿女看待。\nTuring Bombe上面有着对christopher的追随我是赞同的。因为（引自网易）：尽管图灵和摩尔康一起上了好几门课，但摩尔康比图灵高一级。图灵为了和摩尔康同学，曾提前一年考剑桥。结果摩尔康得到了剑桥三一学院的奖学金，而图灵没考上，等到第二年才考上了剑桥国王学院。……一次图灵在向格林鲍姆回忆摩尔康（Christopher Morcom）时从口袋里拿出钱包，指着钱包里摩尔康的照片对格林鲍姆深情地说：He made me want to be good。而且根据在有些豆瓣评论里面看见的，图灵有口吃，喜欢的学科优秀的不得了，但不喜欢的学科碰都不碰，但Christopher却把他和这个世界联系了起来。不过就像所有悲伤的故事，初恋都离开主角了。有Turing Bombe，我们还得感谢Christopher 吧。\n而电影中两人的基情就更明显了。有人说处理的很隐晦，但我觉得很明显啊。两人在树下一个看书，一个玩填字游戏，紧紧靠着彼此。Christopher 看图灵的眼神，图灵回给Christopher 甜蜜的笑。上课传只有我们两人知道密匙的暗号。在人群中等待Christopher 想要给他情书。天啦，你们还能再基点吗？（所以隐晦是指没有XXOO吗？ 笑）\n图灵自杀，还是因为忍受不了这样的迫害吧。吃占有氰化物的苹果，太罗曼蒂克了，图灵你是要当白雪小公举吗？ 笑（想起看过有一篇叫做 恋爱的味道像氰化钾 的推理小说）\n也想到了我国的一些科学家，也是要这样隐姓埋名，这样在死后才会被人熟知。\n2013年有多远呢？也只不过两年而已。在那一年才被女王伊丽莎白二世追授特赦，如果没有包括霍金在内的人为你平反，你会出现出现在我们的眼前吗？被政府保管50年后公开。\nEvery day we decided who lived and who died. Every day we helped the allies to victories, and nobody knew.\n\n\n\n图灵和克拉克\n在影片中，我不得不承认图灵可能真的对克拉克有带异性上的喜欢，不过只有一点。他们两个更多的还是柏拉图式精神上对对方的欣赏，图灵对克拉克赏识很大的原因是克拉克确实很聪明，他们有共同的话题。\n\n影片中喜欢的台词评论：\n1Do you know why people like violence?It is because it feels good.Humans find violence deeply satisfying,but remove the satisfaction,the acts becomes hollow.\n我不得不承认有时候我也喜欢用暴力去解决问题，就像是要恐吓对方一样，让对方遵从于我。冷暴力就发生的更为频繁了。为什么我们不能尝试去更温柔地对待别人呢？暴力只是空洞的形式。 看到这句就想到了《哲学家们都干了些什么》中的：要是殴打就来吧，肉体的疼痛总会终止，要么是你停手了，要么是我麻木了。是饥饿吗？饥饿的结果要么是死亡带来的平静，要么是一顿幸福的大餐。是羞辱吗？只要我的意志足够坚强，在我的精神世界里，我可以视一切为粪土。他人的嘲笑和蔑视只存在于外界那一元，和我的精神世界无关，那么又何来凌辱只有？\n\nHardest time to lie to somebody is when they’re expecting to be lied to. If someone’s waiting for a lie, you can’t just give them one.\n\nAnd if we can say that about one another,then why can’t we say the same thing for brains…built of copper and wire,steel? 虽然机器不能像人那样思考，但它们也有自己思考的方式\n\nNow,detective,you get to judge.So,tell me…what am I?Mm,am I…a machine?Am I a person?Am I a war hero?Am I a criminal? \n图灵是war hero吗？他在影片中说 -You’re not god, you don’t get to decide who lives and who dies.-Yes, we do.-Why?-Because no one else can.   \nWas I God? No. Because god didn’t win the war. We did.\n图灵是devil吗？Every day we decided who lived and who died.\n是他造的机器模仿人，还是人类是模仿机器的思维方式？\n\n\n\n留在最后的同性话题。\n没有看这部电影之前我根本不知道以前英国还有对同性恋这么严重的刑法。为什么人们认为同性恋是有罪的呢？\n在看了奇葩说之后，我想我们不仅仅只是要尊重同性恋，我们这样对待他们还是把他们作为特殊的看待。因为我们仍有一个意识：他们是同性恋，我们要尊重他们。而不是真正的把他们看做普通人，与我们一样的人，让他们和我们平等地存在。\n关于这个推荐大家去看“同性恋在道德上有什么错”（WHAT'S MORALLY WRONG WITH HOMOSEXUALITY）Dr. John Corvino  （我有一个小时版本的，好像微博也上可以搜到）\n和讲同性恋那一期的奇葩说。", "useless_count": 0, "comments_count": 3, "alt": "https://movie.douban.com/review/7563590/", "id": "7563590", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 2, "author": {"uid": "milocamus", "avatar": "https://img3.doubanio.com/icon/u2374639-80.jpg", "signature": "浮名本是身外物，不著方寸也风流", "alt": "https://www.douban.com/people/milocamus/", "id": "2374639", "name": "谢玩玩"}, "created_at": "2015-08-06 10:33:49", "title": "模仿游戏", "updated_at": "2015-08-06 10:33:49", "share_url": "https://m.douban.com/movie/review/7561180", "summary": "在电影院里哭得无法自抑。 敏感的人本来就更容易感觉孤独，如果没有那一抹阳光的出现，也许会习惯冰凉，而当那道光出现又消失，留下的人是不是会更加绝望。几次看到他神经质地保护克里，其实更多的是保护自己永无...", "content": "在电影院里哭得无法自抑。\n敏感的人本来就更容易感觉孤独，如果没有那一抹阳光的出现，也许会习惯冰凉，而当那道光出现又消失，留下的人是不是会更加绝望。几次看到他神经质地保护克里，其实更多的是保护自己永无法言说的爱恋和无法摆脱的孤独绝望。人在这个世界上的局限如此难堪，所谓自由只是一个相对论，而当信仰被摧毁的时候，也许死亡才是最好的归宿。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7561180/", "id": "7561180", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 1, "author": {"uid": "Livia", "avatar": "https://img3.doubanio.com/icon/u1098821-12.jpg", "signature": "无条件，是快乐的条件。", "alt": "https://www.douban.com/people/Livia/", "id": "1098821", "name": "轩辕肆意"}, "created_at": "2015-08-02 19:53:44", "title": "命运如树 难以自拔", "updated_at": "2015-08-03 10:37:07", "share_url": "https://m.douban.com/movie/review/7557079", "summary": "没有人能比卷福把图灵的呆萌和聪慧演绎得更好。 一些人的决定，偶然地改变了历史的走向，混乱的结局回归必然。they are not playing God. They are God. 不自知的天才改写了人类的历史，甚至触动了文明本身，如果...", "content": "没有人能比卷福把图灵的呆萌和聪慧演绎得更好。\n一些人的决定，偶然地改变了历史的走向，混乱的结局回归必然。they are not playing God. They are God.\n不自知的天才改写了人类的历史，甚至触动了文明本身，如果不是图灵和他的团队，一千多万人将死在战争的车轮下，这世界上许多人因而也不会存在，而图灵自己，却死于世俗偏见的践踏。\n可笑命运如一株植物，无法自拔。渡得了众生，救不了自己。\n如果平行空间真的存在，他能够清算自己的人生轨迹吗？他会不会和好基友Christopher一起在树影下面看完那本书，然后隐姓埋名平淡地度过余生呢？又或者神一样的存在，注定了blessed and cursed at the same time。\n如果图灵活在今天的大腐国，有颜又智慧的他，一定是大腐国男同界的hottest merchandise。\n感谢那些在不能忍的世道里破除黑暗的骑士们。\n铭记。致敬。", "useless_count": 0, "comments_count": 1, "alt": "https://movie.douban.com/review/7557079/", "id": "7557079", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 3.0, "min": 0}, "useful_count": 1, "author": {"uid": "27728988", "avatar": "https://img3.doubanio.com/icon/u27728988-5.jpg", "signature": "", "alt": "https://www.douban.com/people/27728988/", "id": "27728988", "name": "人生何处问多情"}, "created_at": "2015-07-31 00:11:05", "title": "相信我，真爱真是无敌的！！！！坏就坏在你是个GAY", "updated_at": "2015-07-31 00:11:05", "share_url": "https://m.douban.com/movie/review/7554101", "summary": "很少写影评因为懒加上语言组织能力又低。 不过今天还是有冲动写上一写，关于《模仿游戏》的。 究其原因其中之一就是因为卷福，自从一口气看了《神探夏洛特》这后这个就得了严重的卷重综合症，眼前接连几天晃动的...", "content": "很少写影评因为懒加上语言组织能力又低。\n不过今天还是有冲动写上一写，关于《模仿游戏》的。\n究其原因其中之一就是因为卷福，自从一口气看了《神探夏洛特》这后这个就得了严重的卷重综合症，眼前接连几天晃动的都是那张尖峭的脸庞和那上面那头卷卷的发，悲催的是下一季还遥遥无期，为解相思先拿部旁的片子慰藉一下，至少也是男主角嘛。\n这片子跟神探一样讲的都是天才的故事，难免让我边看脑中边刷神探的画面，二出片子的神情动作交叉啪啪啪地显现，每每提醒着这者之间的差别，一英明神勇，一可悲可叹； \n片子一开初我就被卷福额上那二道弯弯的皱纹给深深伤到了，，以至于后面只顾盯着他的各种皱纹去了，还好他的表情不多，脸部基本属于僵硬派。呜呜，虽然明知西方男人老得快，但也请别这么急转直下行吗？？这都步入中年男人的行列了，再说自己27也违和啊。真心伤~~\n卷福演的是图灵，图灵是谁？一言蔽之就是计算机它老爹。\n如果这个故事属实，那么图灵之成名恐怕就是借着这次破译密码事件为明了计算机开始的。\n破译原理很复杂，没太看懂，初步理解估计就是英军用手段从波兰拿到了一台译码机，只需要需入转换码就可以破译密码了。\n英军每天拦截到无数的德军的密码，这个很容易，会调频就行。但拿到的都是些什么天气很好啊，旅游愉快啊，之类的无关痛痒的东西，这里面隐含的意思是不能通过字面去猜的，因为这不是语言题，是数字题，用图灵的话讲就是猜字游戏，他也把这种破译方法称作模仿游戏。\n题面有了，没有转换码，破译机也解不了码，等于没用。以人手排除破译太难了，耗时电影中说的二千万年……简言之到了那时仗都打完了，破不破就无区别了。\n时间紧逼，为了提高速度，图灵决定用机器代替人干这人所不能及的事情。\n几经辛苦，不眠不休肯定的，顶多就喝过一碗汤，真可谓高产出低能耗，鞠躬尽瘁，舍我其谁了。\n终于大机器搞出来了，虽然它很原始，动起来燥音那个大也是让领导层忍无可忍的地方，坚决要派人拆了。幸好被全组人齐心协力保住了。\n图灵在正果修成之际还顺带捞了个准老婆回来，这老婆也是个数字奇才，正是识英雄重英雄的戏码。可惜他们彼此的爱只是知音间的相识，图灵终究不想拖累她而提出解除婚约。\n克拉克的回应堪称经典：那又怎么样，你不是个好丈夫我也不见得是个好妻子，我们只是了解彼此，心灵相通，已经比许多人的婚姻幸福多了。OMG，如果伪婚也比正常婚姻幸福得多的话，想想我们现实中的婚姻都有些什么？可能有无数人既不相爱也不做爱，心灵就更加是扯谈。\n密码行动漂亮完成，图灵机不负众望，据说后来统计是至少减免了1400万人死亡，而且让二战至少提前二年结束，说它是让盟军扭转局面、反败为胜的至胜绝密也毫不为过，像图灵这类不可多得的天才，才华得以展露，求仁得仁风调雨顺了吧，坏就坏在，他本身是个GAY，这是当时的欧洲都是个禁忌，一但获罪不是入狱便是接受那个要命的药物疗程。可笑的是政府居然认为同性恋倾向是种病，可以通过药物治疗去康服。\n最后一代天才彻底给这化学毒物疗法给毁了，而他宁愿被药物折磨到身体肌能逐渐丧失也不愿离开他的机器，那个以他爱人名字命名的计算机，想想真难过。\n我想图灵到最后肯定被药物剥夺了工作能力，因为无法再创造更好的计算机才会选择自杀的，愚昧果真要不得，要是能晚生50年该有多好！！！！\n这电影拍得最好的地方就是分了三个不同时间段说故事，而且是三条主线并行，分别是少年、破译期和被盗后。\n三线并行但条理清晰，观众看了也不乱，剪切也不着痕迹。算是完整又高效地把整体故事说了个滴水不漏，当然事情本身也不算复杂。\n整体算是比较沉闷的片子，但完整性不错，人物也是可圈可点，再次赞下卷福的演技，演一个社交能力低但专业水平高的人天才也是杠杠的好。不过这类题材最好的到目前为止还是《美丽心灵》，相信我，真爱真是无敌的！！！！\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7554101/", "id": "7554101", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "saya1749", "avatar": "https://img3.doubanio.com/icon/u44482283-43.jpg", "signature": "论辈分 我应该自称老娘！", "alt": "https://www.douban.com/people/saya1749/", "id": "44482283", "name": "saya1749"}, "created_at": "2015-07-22 01:10:45", "title": "圖靈 計算機之父", "updated_at": "2015-07-22 01:10:45", "share_url": "https://m.douban.com/movie/review/7542975", "summary": "模仿游戏能引进破有些意料之外，上映第一天便去送了票房。一周以来在影院里泡了从大圣到捉妖记到模仿游戏，全是良心作。前两部是国产良心，只是电影；后者已经不仅是电影，而是人们对于一个不该被遗忘的、不该为...", "content": "模仿游戏能引进破有些意料之外，上映第一天便去送了票房。一周以来在影院里泡了从大圣到捉妖记到模仿游戏，全是良心作。前两部是国产良心，只是电影；后者已经不仅是电影，而是人们对于一个不该被遗忘的、不该为人类的无知所牺牲的伟人所给予的歉意和敬意。图灵，是我们每一个在享受着和平和计算机带来生活便利的人都应该记住的名字，也要记住人们曾对他的不公正和几十年后历史还他的清白，在國產保護月的這段日子裡，也許不會有太多人注意到這部精品之作，但是導演的陳述已經讓全世界人得知了一個真相。很佩服這位導演講故事的能力，很佩服編劇寫故事的能力，能把本來就一句話計算機之父拍成一部90分鐘震動人心的電影，相比之下，國內有些導演卻能把很富有故事性的人物傳記拍成了一句話就能概況的電影。圖靈。計算機之父，字面永遠無法表達背後的故事。因為太震撼了。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7542975/", "id": "7542975", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 2, "author": {"uid": "MGRJGirl", "avatar": "https://img3.doubanio.com/icon/u39873443-100.jpg", "signature": "愿无岁月可回头", "alt": "https://www.douban.com/people/MGRJGirl/", "id": "39873443", "name": "目光如炬"}, "created_at": "2015-05-31 23:17:09", "title": "苹果的Logo是为纪念图灵创作的", "updated_at": "2015-05-31 23:37:38", "share_url": "https://m.douban.com/movie/review/7486866", "summary": "一直好奇：为什么苹果公司的标识，是个被咬了一口的苹果，直至今天，偶然看到，才懂得，被咬了一口的苹果，真的很凄凉，很凄凉。  历史完全有理由永远记住图灵这个名字，不是因为他在ULTRA行动中所扮演的重要角色...", "content": "一直好奇：为什么苹果公司的标识，是个被咬了一口的苹果，直至今天，偶然看到，才懂得，被咬了一口的苹果，真的很凄凉，很凄凉。\n\n历史完全有理由永远记住图灵这个名字，不是因为他在ULTRA行动中所扮演的重要角色，而是因为，他为开辟信息时代的计算机技术，做出了卓越贡献。他去世大约20年后，图灵的粉丝乔布斯，把公司起名为苹果，并且以被咬了一口的苹果，作为标志。\n\n有媒体报道，苹果标识来源于一个二战中的故事。开头是很伟大的：盟军发起了一个代号ULTRA的绝密行动，费尽心机，搞到了德国最机密的通讯密码机，为此，由英国剑桥大学，一位年轻毕业生图灵为首，建造了世界上第一台真正的计算机，从而破获了德国自以为无法被破解的密码，完全掌握了德国潜艇部队的秘密，最终灭了德国海军，为提前打败德国，做出了决定性的贡献。\n\n但是，故事的结尾却很悲惨：参与行动的4位关键人物的下场都很不幸。研究出密码破译基础算法的波兰人雷耶夫斯基，战后不被党信任，被发配当了个企业经理，一生再没机会做密码研究；\n\n破解了日本绝密密码的弗里德曼，战后神经崩溃，终生为一个问题所困扰：为什么美国政府不利用他破解的日本密码，预测到珍珠港事件；向盟军要了一万美元，就出卖了德国密码机的施密特，42年就被德军发现枪毙了；但比较而言：“艾伦.图灵的命运，最为悲惨。\n\n战争结束后，他回到剑桥大学，过着同性恋的隐秘生活，当时的同性恋，在英国被视为重罪。1952年，他因与一名19岁男子有性交而被捕。英国政府给他两个选择----要么坐牢，要么接受医学实验性质的激素治疗，以根除‘同性恋情结’。他选择了接受激素治疗，但治疗让他痛苦不堪，且双乳不断胀大。\n\n1954年6月8日，图灵42岁，正逢进入他生命中，最辉煌的创造顶峰。一天早晨，女管家走进他的卧室，发现台灯还亮着，床头上还有个苹果，只咬了一小半，图灵沉睡在床上，一切都和往常一样。但这一次，图灵永远地睡着了，不会再醒来……\n\n经过解剖，法医断定是剧毒氰化物致死，那个苹果，是在氰化物溶液中，浸泡过的。但外界的说法，是服毒自杀，图灵再也无法忍受，疼痛和羞辱的图灵在自己家中的实验室，配置了一种氰化物药剂，将其注射到一只苹果里，自己咬了一口苹果。\n\n他在短短几分钟之内，就死去了。只有四人参加了他的葬礼，他的母亲也在其中，一代天才，就这样走完了人生。他去世大约四年之后，英国取消了将同性恋定罪的法令。\n\n来自:互联网时代", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7486866/", "id": "7486866", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "bamboo1988", "avatar": "https://img3.doubanio.com/icon/u3561929-45.jpg", "signature": "电影并非只有娱乐一个属性。", "alt": "https://www.douban.com/people/bamboo1988/", "id": "3561929", "name": "竹子"}, "created_at": "2015-04-27 17:13:00", "title": "Dont wanna be alone.", "updated_at": "2015-04-27 17:13:00", "share_url": "https://m.douban.com/movie/review/7456491", "summary": "  看了一篇很棒的长评。   说，图灵的功绩，电影里介绍的只是冰山一角罢了。   说，天才总是把最单纯真挚的带给世界，而世界回馈他们的往往是一盆脏水。    历史上的天才还在世时，往往是悲惨的。正是看似不会有...", "content": "  看了一篇很棒的长评。\n  说，图灵的功绩，电影里介绍的只是冰山一角罢了。\n  说，天才总是把最单纯真挚的带给世界，而世界回馈他们的往往是一盆脏水。\n\n  历史上的天才还在世时，往往是悲惨的。正是看似不会有作为的人，才能成就无人能成之事。\n  而天才也往往需要帮衬，比如图灵身边的琼。是她慢慢将天才注入“人”的气息，让他能够与人相处，得到帮助，从而实现他的梦想。\n  但是，更多的天才们，因为特立独行而度过了悲惨的一生，只能在身后再被世人所追忆。\n\n  他们的功绩无人知晓，他们的成就无人能及。\n  是不是有点遗憾呢，自己几乎改变了世界的命运，却只能压抑住心中的激情，回归到平凡。\n  对于天才来说，应该是不会的吧。他们的存在，已经远远超过了生命本身赋予人类的意义。他们不需要空洞的赞美，鲜花，和掌声，可能就像图灵最后说的，他只是想有人陪，不想一个人。\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7456491/", "id": "7456491", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "mpower007", "avatar": "https://img3.doubanio.com/icon/u45831860-3.jpg", "signature": "让梦想成真，“醉”完美！", "alt": "https://www.douban.com/people/mpower007/", "id": "45831860", "name": "幸哉乐活"}, "created_at": "2015-04-12 00:16:32", "title": "谁该被纵容？", "updated_at": "2015-04-12 00:16:32", "share_url": "https://m.douban.com/movie/review/7441019", "summary": "      进步大多是那些能人推动的，而给世界开了天窗把我们带入新的境地的往往是那些天才。而天才的世界，世人是很难懂的，大多数人就以非我族类打压之的心态对待。君不见如未有牛顿、爱因斯坦、冯诺依曼等辈出的...", "content": "      进步大多是那些能人推动的，而给世界开了天窗把我们带入新的境地的往往是那些天才。而天才的世界，世人是很难懂的，大多数人就以非我族类打压之的心态对待。君不见如未有牛顿、爱因斯坦、冯诺依曼等辈出的天才，汝等还放牛种田哪。\n      天才往往不合群，但不合群的不见得是天才。查理芒格说过：先知如果告诉我，我将在哪里死去，我将永远不去那个地方。当然也不会有先知告诉你那些不合群的人是天才，所以我的问题就是应该怎么对待这类人哪？就是以一种包容的心态给与自由，只要不合群的不危害社会就不应该被迫害，只有这样社会才会更和谐更快的进步，不要像影片里的那样生的时候对天才不断的压榨来获取更多他的才华，死后再把他恭入庙堂，这有什么用？\n      还“异类”一个自由吧。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7441019/", "id": "7441019", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 1, "author": {"uid": "7798390", "avatar": "https://img1.doubanio.com/icon/u7798390-8.jpg", "signature": "二逼的文艺青年", "alt": "https://www.douban.com/people/7798390/", "id": "7798390", "name": "香蕉皮"}, "created_at": "2015-04-10 06:58:24", "title": "只有傲娇受才能如此的伟大！", "updated_at": "2015-04-10 06:58:24", "share_url": "https://m.douban.com/movie/review/7439411", "summary": "    图灵的很多台词让人记忆犹新！比如他的初恋男友克里斯托弗推荐密码书籍时，图灵说了一段大概是“语言往往也不是人与人要交流的内容，通常语言中的隐喻和语气才是真实的内容”这段简直太让人震撼了！尼玛绝对...", "content": "    图灵的很多台词让人记忆犹新！比如他的初恋男友克里斯托弗推荐密码书籍时，图灵说了一段大概是“语言往往也不是人与人要交流的内容，通常语言中的隐喻和语气才是真实的内容”这段简直太让人震撼了！尼玛绝对只有天才才能说出来啊！\n\n    还有警察问他“机器会思考吗”那段，他的回答简直绝了，大意是“机器只是跟人类的思考方式不同，就像人类之间口味不同一样”，既完美的回答了机器问题，也顺便讲了“我们基佬只是口味与众不同而已”。从他的回答中你也可以想到，普通人——也就是那几个密码专家——只能用传统的角度去思考和解决问题，但只有天才图灵才能想到用冰冷的机器去分析问题，这完全是对人类传统思想的颠覆，也只有与众不同的图灵才能想出来！\n\n    很多伟大的艺术家，哲学家好像都有傲娇基的一面，也许正是这些饱受主流价值观摧残的与众不同的人推动了主流世界的进步和发展，好讽刺！", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7439411/", "id": "7439411", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "jelly-8", "avatar": "https://img3.doubanio.com/icon/u32331072-50.jpg", "signature": "清风徐来 顺其自然", "alt": "https://www.douban.com/people/jelly-8/", "id": "32331072", "name": "废柴中年R少女"}, "created_at": "2015-03-17 22:49:28", "title": "不得不说没有一分钟是废话", "updated_at": "2015-07-21 22:36:51", "share_url": "https://m.douban.com/movie/review/7416450", "summary": "这部电影从开始到结尾，就连一分钟，都没有浪费，传达出来的信息，都足以感同深受，故事以倒叙的方式，不断的穿插，走神一秒，又要回到上一秒。  虽然历史不是这样，但是编剧还算编的到位，整个人还是很立体的，...", "content": "这部电影从开始到结尾，就连一分钟，都没有浪费，传达出来的信息，都足以感同深受，故事以倒叙的方式，不断的穿插，走神一秒，又要回到上一秒。\n\n虽然历史不是这样，但是编剧还算编的到位，整个人还是很立体的，其实开始蛮夸张了些，我对历史不熟，只是觉得好看，很喜欢这个人物，艺术的手法有夸张的成分，但从电影的角度，不得不说，是好电影。\n\n我觉得整个故事塑造的人特别立体，本尼迪克特·康伯巴奇演的太好了，以前看他演的神探，那性格独特的好讨喜，这个角色，奇葩到了极致，但是又那么有血有肉，他每个角色，每个细节，我都好喜欢。\n\n不管是情节，还是语言，还是人物塑造，还是场景，真的，都喜欢。", "useless_count": 0, "comments_count": 1, "alt": "https://movie.douban.com/review/7416450/", "id": "7416450", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "48593436", "avatar": "https://img3.doubanio.com/icon/u48593436-3.jpg", "signature": "", "alt": "https://www.douban.com/people/48593436/", "id": "48593436", "name": "独舞"}, "created_at": "2015-03-03 08:42:08", "title": "我们每一个人都应该记住这个名字《艾伦 图灵》", "updated_at": "2015-03-03 08:42:08", "share_url": "https://m.douban.com/movie/review/7394362", "summary": "今年看的第一个五星电影，好多年没看电影看哭了，为他执着的感情与那句“我不想一个人” ，也为他所做的一切只能隐瞒然后却被迫害而死。  正像女主角说的一样 我们活着的每一个人都应该感谢他！感谢他让二战缩短...", "content": "今年看的第一个五星电影，好多年没看电影看哭了，为他执着的感情与那句“我不想一个人” ，也为他所做的一切只能隐瞒然后却被迫害而死。\n\n正像女主角说的一样 我们活着的每一个人都应该感谢他！感谢他让二战缩短了好几年！感谢他为人工智能所做的贡献！\n\n短短114分钟很难描述图灵伟大的一生（虽然只有短短的41年）。\n\n#有时候正是那些最意想不到的人能做出最超出想象的事# ", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7394362/", "id": "7394362", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "66052897", "avatar": "https://img1.doubanio.com/icon/u66052897-9.jpg", "signature": "平凡的和特别说没空", "alt": "https://www.douban.com/people/66052897/", "id": "66052897", "name": "玫瑰狗"}, "created_at": "2015-03-01 10:39:24", "title": "给祖师爷上香了", "updated_at": "2015-07-26 21:44:32", "share_url": "https://m.douban.com/movie/review/7392360", "summary": "听说和历史有诸多不符之处， 比如图灵其实人际关系没有很差。 比如破译Enigma的时候管理那个研究院的军官并非军棍。 比如他们并没有牺牲很多人来刻意隐瞒已经破解的事实，而是德军根本不相信他们能破解。 比如那...", "content": "听说和历史有诸多不符之处，\n比如图灵其实人际关系没有很差。\n比如破译Enigma的时候管理那个研究院的军官并非军棍。\n比如他们并没有牺牲很多人来刻意隐瞒已经破解的事实，而是德军根本不相信他们能破解。\n比如那台机器并不叫Christopher。。\n\n图灵这一生中最多，最值得称道的状态，应该是那段在构思破译机器的时候，不停的跑步，不停的往墙上贴便签的时光。真正能让科学家解决问题的品质，是专注。可惜在电影中只有5分钟。电影是浪漫的，所以对此无法展现太多。\n\n他的际遇，就是我讨厌为政府，为军方工作的原因。我甚至讨厌为大公司工作。不管你的权利多么令人生畏，不管你有怎样重大的理由。我就是讨厌被人欺负。\n\n看完之后专门查了一下图灵和冯诺依曼。感觉他俩都可以称为祖师爷。冯诺依曼机感觉是图灵机的一个电子版实现。", "useless_count": 0, "comments_count": 2, "alt": "https://movie.douban.com/review/7392360/", "id": "7392360", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "61621650", "avatar": "https://img1.doubanio.com/icon/user_normal.jpg", "signature": "", "alt": "https://www.douban.com/people/61621650/", "id": "61621650", "name": "SSnn"}, "created_at": "2015-02-23 21:01:08", "title": "True love", "updated_at": "2015-02-23 21:01:08", "share_url": "https://m.douban.com/movie/review/7386490", "summary": "\"sometimes it is just the people who imagines anything of who do the things that no one can imagine\"  看完后略微激动，在现在这种浮躁的年代，估计也只有这种用真人真事改编的电影才能拥有这种历史的厚重...", "content": "\"sometimes it is just the people who imagines anything of who do the things that no one can imagine\"\n\n看完后略微激动，在现在这种浮躁的年代，估计也只有这种用真人真事改编的电影才能拥有这种历史的厚重感并编谱出如此合适的乐章。 \n\n想来想去，还是给了满分，尽管影片中有很多缺陷和可以弥补的地方，但是就故事而言，五分远远不能评价这个在平淡之下惊心动魄的故事。 \n\n不过看完后最想吐槽的竟然是男主能爱着一个人20多年，并且还为了他拯救了1400万人，帮英国赢得战争，我想说，这就是同性才是真爱吗？\n\n影片的整体风格还是模仿美丽心灵，但图灵不是纳什，没生在一个好年代也没有一个好结果，图灵的悲剧也不可能会发生在纳什这种人的身上，可能因为类型过于相同，奥斯卡不能给模仿游戏机会，但是就艺术价值来说，个人觉得图灵比纳什更适合改编成电影。 \n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7386490/", "id": "7386490", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "65890941", "avatar": "https://img1.doubanio.com/icon/u65890941-7.jpg", "signature": "", "alt": "https://www.douban.com/people/65890941/", "id": "65890941", "name": "薰莸"}, "created_at": "2015-02-03 16:46:56", "title": "Alen Turing and  本尼迪克特", "updated_at": "2015-02-03 16:46:56", "share_url": "https://m.douban.com/movie/review/7366764", "summary": "这本片子无论从哪方面说都是一部非常棒的片子！演员，内容，传递的东西，都让人感受到一种不同的力量，对，是一种奇特的力量，让人不由的感受到了关于战争的，关于绅士的，关于许多奇特东西的，都想那句台词一样...", "content": "这本片子无论从哪方面说都是一部非常棒的片子！演员，内容，传递的东西，都让人感受到一种不同的力量，对，是一种奇特的力量，让人不由的感受到了关于战争的，关于绅士的，关于许多奇特东西的，都想那句台词一样，Sometimes it is the people who no one imagines anything of who do the things that no one can imagine.\n\n天才总是异于常人的，又或者从一开始就要让周围的人包容他，因为天才，在某个方面长得太快，所以总会有一块短板。谁都不会完美。就像谁都不会是上帝，一样！\n\n卷福很棒！在这本片子里还原的ALEN很有风味吧，还是有着卷福的倔强，可是的确天才都有相似之处。\n\n这本电影还让我了解了这位可以用得上伟大来形容的数学家，图灵机，我相信我不会忘记了，因为这是一个非常具有时代特色的英雄的产物，并且他开始改变了我们，我们人类的生活，和我们计算和思考的方式。即使，我们都变得不那么聪明了，但是一种创举是不能被简单磨灭的。\n\nHERO\n我想这样来说你，Turing~\n\n有些历史被翻开，就是为了让这样不一样的人，被人们看到，因为伟大本来就该在更多的人心中。\n\n2013年英国女皇为他赦免了罪名。\n\n每个人或许都有每个人的权利，至少这点隐私，我们不表态，却也不能妄加指责！\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7366764/", "id": "7366764", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 2, "author": {"uid": "Guanyuzhizi", "avatar": "https://img3.doubanio.com/icon/u3918762-4.jpg", "signature": "墉人自扰", "alt": "https://www.douban.com/people/Guanyuzhizi/", "id": "3918762", "name": "Guanyuzhizi"}, "created_at": "2015-02-03 04:26:23", "title": "一个孤僻者的浪漫", "updated_at": "2015-09-03 01:42:02", "share_url": "https://m.douban.com/movie/review/7366197", "summary": "这个世界不懂他，他却把自己奉献给了这个世界。 他造就了无数人，而却没有人能帮上他。  ------------------------------  人和机器的区别是什么？人有不同想法，机器则不是。（e.g. 你爱草莓，我讨厌滑冰，你喜...", "content": "这个世界不懂他，他却把自己奉献给了这个世界。\n他造就了无数人，而却没有人能帮上他。\n\n------------------------------\n\n人和机器的区别是什么？人有不同想法，机器则不是。（e.g. 你爱草莓，我讨厌滑冰，你喜欢看书，我对花粉过敏……）\n\n然而，世人却没有把Turing当作人。\n\n------------------------------\n\n人和机器的区别是什么？人会选择，机器则不会。\n\n\n对于世界，对于Joan，Turing都选择了最大爱的抉择。\n\n------------------------------\n\n\"But we're not like other people. We love each other in our own way, and we can have the life together that we want. You won't be the perfect husband? I can promise you I harbored no intention of being the perfect wife. I'll not be fixing your lamb all day, while you come home from the office, will I? I'll work. You'll work. And we'll have each other's company. We'll have each other's minds. Sounds like a better marriage than most. Because I care for you. And you care for me. And we understand one another more than anyone else ever has.\"\n-Joan Clarke\n\n这才是爱情！这就是爱情！不能感动再多！完美的女人！\n\n------------------------------\n\n剧情过度focus于那台机器，呆板了点。", "useless_count": 1, "comments_count": 5, "alt": "https://movie.douban.com/review/7366197/", "id": "7366197", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 1, "author": {"uid": "lovemimidog", "avatar": "https://img3.doubanio.com/icon/u62940861-1.jpg", "signature": "", "alt": "https://www.douban.com/people/lovemimidog/", "id": "62940861", "name": "予儿"}, "created_at": "2015-01-28 10:50:12", "title": "传奇狗血的寂寞英雄", "updated_at": "2015-07-30 09:53:12", "share_url": "https://m.douban.com/movie/review/7359420", "summary": "为了2月22日的奥斯卡颁奖，绕有兴致地找来所有最佳影片的提名入围片，准备一部一部看下来，不知个人喜好与最终结果会相差多少，还挺期待的。           作为二战题材影片的狂热粉，这段鲜为人知却精彩绝伦的传奇...", "content": "为了2月22日的奥斯卡颁奖，绕有兴致地找来所有最佳影片的提名入围片，准备一部一部看下来，不知个人喜好与最终结果会相差多少，还挺期待的。          \n作为二战题材影片的狂热粉，这段鲜为人知却精彩绝伦的传奇故事足以撑起整部影片。我一直说德国的失败是因为所有密码被英国偷偷破译，而且是很多年后才爆出的绝密档案，朋友都反应淡然。好吧，此片正好还原了这段被掩盖的历史。         \n此次卷福演技爆表，演活了图灵，这个对二战最具影响力的数学家，这个渴望爱却终不得的同性恋，这个上世纪命运最狗血的“无名”英雄。如果一定要挑点刺的话，感情处理以及内心挣扎再渲染多些就更符合我心中的完美。          \n一个人际交往严重障碍巨宅的数学家，却用初恋的名字来命名他的杰作，他的爱是人还是机器？在别人眼中他到底是人还是机器？如此深沉的爱，不为世人接受；如此伟大的发明，无法公之于众；如此传奇的天才，最终选择自尽。图灵的一生令人叹息，谁说IQ高的EQ一定低，我只是相信他的感情太完美太禁忌，才使他比一般的天才更寂寞…\n", "useless_count": 0, "comments_count": 1, "alt": "https://movie.douban.com/review/7359420/", "id": "7359420", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 1, "author": {"uid": "blueroc", "avatar": "https://img3.doubanio.com/icon/u1017969-2.jpg", "signature": "2005年8月30日加入豆瓣", "alt": "https://www.douban.com/people/blueroc/", "id": "1017969", "name": "blueroc"}, "created_at": "2015-01-22 13:44:23", "title": "神并不指望人懂他", "updated_at": "2015-01-22 13:44:23", "share_url": "https://m.douban.com/movie/review/7352483", "summary": "    从一个半吊子IT从业人员的视角来看，图灵就是神，也是祖师爷，中国人就好供祖师爷，各行各业的。虽然，图灵在祖师爷里算最小的，但却是人类历史上最重要的祖师爷之一。他出生于20世纪初，英国人，50年代自杀...", "content": "    从一个半吊子IT从业人员的视角来看，图灵就是神，也是祖师爷，中国人就好供祖师爷，各行各业的。虽然，图灵在祖师爷里算最小的，但却是人类历史上最重要的祖师爷之一。他出生于20世纪初，英国人，50年代自杀，41岁，男同。\n    模拟游戏这部电影想尝试还原这位天才，据俺看来，很可能是悲剧，因为不知道的就算看了电影还是不知道他的盖世武功，除了解密码；而知道的要么读过传记不屑于看电影，要么看后狂吐槽，IT男吐槽的水准大抵是领教过的，那是敢教日月无光神仙也挡不住。但俺是半吊子，果断点开看完，觉得很欣慰。\n    历史上每隔一阵尤其是乱世，总会出现一些天才一些大神，而这样人物领先普通人不知几条街，几乎会被主流抛弃郁郁而终，总要等若干年后，人们回想起当年黑暗中那盏弱小而倔强灯光之时，才明白原来它早已指明人类进步的方向，顿时泪如雨下。。。\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7352483/", "id": "7352483", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 4, "author": {"uid": "dataroom", "avatar": "https://img3.doubanio.com/icon/u58247753-2.jpg", "signature": "庸人不自扰，冷暖要自知。", "alt": "https://www.douban.com/people/dataroom/", "id": "58247753", "name": "dataroom.with"}, "created_at": "2015-01-20 15:08:15", "title": "The Imitation Game，深刻的电影都是有声读物。", "updated_at": "2015-05-16 22:23:27", "share_url": "https://m.douban.com/movie/review/7350196", "summary": "1）i don't have time to explain myself as i go along.and i am afraid these men would only slow me down.  2）our problem is that we are only using men to try to beat it.what if only a machine can de...", "content": "1）i don't have time to explain myself as i go along.and i am afraid these men would only slow me down.\n\n2）our problem is that we are only using men to try to beat it.what if only a machine can defeat another machine?\n\n3）they only beat me up because i am smarter than they are.\nno,they beat you up because you are different.\n\n4）sometimes it's the very people who no one imagines anything of who do the things that no one can imagine.\n\n5）it wasn't just programmable,it was reprogrammable.\n\n6）i know you don't like me,but that does not make me a soviet spy.\n\n7）if you really want to solve your puzzle,then you are goging to need all the help you can get,and they are not going to help you if they do not like you.\n\n\n8）Uh, there are two people in a wood,and they run into a bear.The first person\ngets down on his knees to pray.The second personstarts lacing up his boots.The first person asks the second person,\"My dear friend,what are you doing?You can't outrun a bear.\"Uh, to whichthe second person responds,\"I don't have to.I only have to outrun you.\"\n\n9）it isn't ordinary, but whoever loved ordinary?\n\n10）Love will make a man do strange things, I suppose.In this case, love just lost\nGermany the whole bloody war.\n\n11）You know why people like violence, Hugh?It's because it feels good.Sometimes we can't do what feels good.We have to do what is logical.\n\n12）Hardest time to lie to somebody is when they're expecting to be lied to.\n\n13）You're not God, Alan.you don't get to decide who lives and who dies.\nYes, we do.Because no one else can.\n\n14）we are not here for right and wrong,we are here to kill them.\n\n15）Don might be crazier than a shithouse rat, but he is solid\n\n16）Ideals are peaceful,history is violent.\n\n17）if a man loves the world, the love of the father's not in him,\nfor all that's in the world,lust of the flesh,lust of the eyes,pride of life,\nit's not of the father,it's of the world。", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7350196/", "id": "7350196", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 1, "author": {"uid": "60140602", "avatar": "https://img1.doubanio.com/icon/u60140602-19.jpg", "signature": "疯狂黏膜爱好者", "alt": "https://www.douban.com/people/60140602/", "id": "60140602", "name": "午夜滴长岛冰茶"}, "created_at": "2015-01-12 20:33:18", "title": "吃毒苹果的不只是白雪公主，还有图灵。", "updated_at": "2015-01-12 20:33:18", "share_url": "https://m.douban.com/movie/review/7339160", "summary": "图灵的故事相信许多许多苹果的用户都烂熟于心。传承这方面乔布斯的执念基本上与图灵无二。但是不同的是，图灵遭受的打击与乔布斯遭受的打击有着天壤之别。  政治是愚蠢的愚昧的，但是又是民众离不了的，无论是独...", "content": "图灵的故事相信许多许多苹果的用户都烂熟于心。传承这方面乔布斯的执念基本上与图灵无二。但是不同的是，图灵遭受的打击与乔布斯遭受的打击有着天壤之别。\n\n政治是愚蠢的愚昧的，但是又是民众离不了的，无论是独裁政权还是民主政权都是相同。就算是民主的社会就算是有女王这个偶像，他们还是会去自然而然的迫害和他们不一样的人。图灵就出生在那个时代。\n\n难说图灵就算生存在世界上能给人类带来多少进步，毕竟有牛顿这位大神烂尾在前让后人只能望其项背。但是在41岁并且经历1年的荷尔蒙治疗的情况下吃下自己灌注氰化物的苹果凄然离世，这是英国政府刻在历史上的笑话。更不用说作为计算机的先驱和战争战局的改变。\n\n但，政治就是政治，如同他们的邻国路易十六这位技艺精湛的————锁匠，和他那不谙世事温文尔雅的王后安托万耐特。法兰西共和国的纪念晚会上，密特朗曾经表情严肃且略带惋惜但坚定的说过：路易十六是个好人，但是在那种情况下，他必须死。于是不但是路易十六，就算是欧洲各国王室成员的多方求情下，他那高贵血统的皇后在关了一年之后也去了上帝那个地方和他那可爱的、具有工匠精神的老公团聚去了。\n\n所以，人类近代史的种种恶行，无一不包括了拒绝进步，让社会倒退。这点上，任何政府，任何政权，都难全身而退。\n\n而图灵，声名得到平反，后又有继任者将其精神发扬光大，总可以含笑九泉，愿你在天之灵安息。", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7339160/", "id": "7339160", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 1, "author": {"uid": "lovelans", "avatar": "https://img3.doubanio.com/icon/u56994695-3.jpg", "signature": "Permission to be human.", "alt": "https://www.douban.com/people/lovelans/", "id": "56994695", "name": "月薇澜"}, "created_at": "2015-01-11 04:56:21", "title": "《模仿游戏》——爱是人的天性，也是我们的权利。", "updated_at": "2015-01-11 04:56:31", "share_url": "https://m.douban.com/movie/review/7335456", "summary": "今天真是凑巧，看了三个电影，都是2014年豆瓣评分超过8分的电影，又刚刚好都涉及了同性恋问题，它们分别是《爱很怪》、《骄傲》和这部《模拟游戏》。 《爱很怪》讲的是两个住在纽约七十多岁的老头新婚，但是他们...", "content": "今天真是凑巧，看了三个电影，都是2014年豆瓣评分超过8分的电影，又刚刚好都涉及了同性恋问题，它们分别是《爱很怪》、《骄傲》和这部《模拟游戏》。\n《爱很怪》讲的是两个住在纽约七十多岁的老头新婚，但是他们的工作单位因为他们是同性恋而把他们开除，找不到工作的他们无法承担纽约高昂的房租，于是一直寄住在朋友家，期间种种心酸让人难过，但片子却温润如水，始终让人感觉暖暖的。\n《骄傲》讲述的是上个世纪英国最大的一次工人罢工，同性恋者也加入进来帮助工人们，从被鄙视到被接受，人们开始成为朋友，依旧是一部色彩明亮，基调温馨的片子。\n而这部《模拟游戏》则是改编自艾伦图灵的传记，讲述了这位数学天才对克里斯多夫的执着迷恋，以及不被人理解坎坷的一生，后来又因为种种原因他的伟大不被世人了解，而他又因为性取向是同性而受到英国政府的迫害，最后在风华正茂时绝望自杀。\n\n我不知道为什么忽然这个世界上一下子出现了那么多同性恋者，但我对他们其实并没有歧视，现如今社会对他们也愈见渐宽容，甚至说好多人都纷纷加入到同性恋的队伍里，不管他们是不是真的性取向是同性，好像同性恋已经变成一种时尚，但在不远的几十年之前，哪怕是在发达的英国，同性恋者都受到了不公。\n\n我以前从来不知道艾伦图灵这个人，因为喜欢卷福才看的这部片子，而且在看到卷福那张长脸的时候非常担心在没有字幕的情况下是不是完全无法了解剧情，不过他难得说话说得很慢，但鉴于这是英腔，我不是很熟悉，所以对于剧情也还是猜的成分更大一点，不过倒不是很影响观看。\n\n图灵是一个天才，但是这个天才总是受到歧视，他不懂得和人相处，他毕生爱的都是他的工作，他是个呆呆傻傻的疯子。他对于人类的贡献相当之大，因为他破解了德军的密码才使得二战提前两年结束，挽救了很多生命；而他的克里斯多夫也是电脑的前身，没有他，现在的我也不可能敲下这篇影评。但不幸的是，为了顾全大局，他的伟大不能被公布，所以没有人知道是他挽救了那么多人的生命。更不幸的是，后来因为他的性取向被曝光，他要坐牢或者接受医学治疗，为了和他心爱的“克里斯多夫”在一起他选择医学治疗，他病得连拿报纸的手都在颤抖，一个伟大的天才到最后被绝望逼到自杀，实在令人惋惜。\n\n这部电影拍摄得非常好，它是一部传记片，也是一部文艺片，我们能感受到强烈的英伦古典气息，整个故事也很委婉内敛恰到好处，没有过分渲染他的不幸。有时候悲剧不需要刻意地渲染，有时候仅仅是几句话，几行字就可以让人心如死灰，泪流满面。结尾部分几位数学家开心地在平地上焚烧那些图纸，而屏幕上出现了几行字。画面中的欢声笑语和文字里的悲惨结局形成了鲜明的对比，于是我更难过了。\n\n这是一部很棒的电影，也感谢这部电影让我知道这样一个伟大的人物——虽然我早就该知道他。\nENGIMA这个单词的存在就是因为图灵，以前就觉得它好美。\n\n很难想象，这些在几十年前深深迫害同性恋者的欧洲国家近几年纷纷同性婚姻合法，于是现在欧洲同性恋多到猖狂。这些同性恋者在享受他们自由相爱的人生的同时，却也应该记得曾经有无数像他们一样的人因为遵从天性去爱而受到了不公。这些我们现如今享有的权利和公平都是前人用鲜血去斗争和牺牲的结果，我们应该心怀感恩。\n感谢我们生在这样的年代，虽然世界上的很多地方还有各种各样令人发指的不公，但世界正在变得越来越美好。\n\n伟人应该被铭记，感谢拍摄了这部电影的导演，以及所有用心表演的演员。\n\n\n2015-01-10 21 :49 \n\n\n\n\n\n\n\n\n\n\n", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/7335456/", "id": "7335456", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 5, "author": {"uid": "kingdajiangyou", "avatar": "https://img3.doubanio.com/icon/u66035182-13.jpg", "signature": "", "alt": "https://www.douban.com/people/kingdajiangyou/", "id": "66035182", "name": "GAKI"}, "created_at": "2015-01-09 22:38:51", "title": "感觉差了点什么", "updated_at": "2015-01-09 22:38:51", "share_url": "https://m.douban.com/movie/review/7332634", "summary": "是和《鸟人》同一时间拿到资源的，纠结了半天要先看那一部，后来由于《鸟人》字幕的问题还是先看了《模仿游戏》 不得不说之前看了《模仿游戏》的预告对本片格外期待，但往往期待过头的东西都没有什么好下场。本片...", "content": "是和《鸟人》同一时间拿到资源的，纠结了半天要先看那一部，后来由于《鸟人》字幕的问题还是先看了《模仿游戏》\n不得不说之前看了《模仿游戏》的预告对本片格外期待，但往往期待过头的东西都没有什么好下场。本片虽然谈不上失望，但也没有什么惊喜。就像大家都在说的，一部中规中矩的片子，打法很讨好奥斯卡，仅此而已。\n本片的预告做的实在很赞，几乎把该呈现的都呈现了，但最惊心动魄的也就仅在预告片体现。\n卷福为本片的关注度提高不少，事实证明他值得这样的关注，这种神经质的高智商低情商的角色驾驭起来简直没难度，不过我也就爱他这茬，尤其在他试图讲冷笑话的时候，看着他的马脸，感觉好适合哦。\n本片最值得一提的就是三条线穿插着来阐述图灵的一生，学生时期图灵扮演者的眉毛在观影过后一直在我脑海中挥之不去。片头的氰化物也是不错的点睛之笔，如果不是百度告诉我图灵是吃含有氰化物的苹果死去的，我完全不知道这是在铺什么。\n还有时不时就会出现卷福像傻瓜一样奔跑的场景，我完全不知道这有什么用，还是百度，它告诉我图灵是世界级长跑运动员。好吧，我承认，没有普及过知识去看电影是我的错。\n总的来说，本片还算不错，它值得期待，只是没有惊喜。看过之后你会对图灵在工作上的贡献和性别上的被歧视有所了解，没有更多的心灵上的悸动。影片缺少那种抓住人心的感觉。\n另外，看预告的时候我一直以为是一部高水准的高智商片，看过之后才知道仅仅是部人物传记罢了。", "useless_count": 1, "comments_count": 0, "alt": "https://movie.douban.com/review/7332634/", "id": "7332634", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 5.0, "min": 0}, "useful_count": 5, "author": {"uid": "simazizhou", "avatar": "https://img3.doubanio.com/icon/u53860132-2.jpg", "signature": "晴耕雨读", "alt": "https://www.douban.com/people/simazizhou/", "id": "53860132", "name": "司马子周"}, "created_at": "2014-11-24 05:31:08", "title": "有些人用生命让人类文明进步，却得不到公平的对待", "updated_at": "2015-01-12 09:31:16", "share_url": "https://m.douban.com/movie/review/7207313", "summary": "看完这篇，我哭成狗了。卷福演得非常好，不管是作为天才的turning，还是一直爱着Christopher的turning。前段为天才喝彩，后段为人性泪奔。一个创造了计算机，扭转二战直至胜利的英雄，却因为是gay而遭到迫害~我们...", "content": "看完这篇，我哭成狗了。卷福演得非常好，不管是作为天才的turning，还是一直爱着Christopher的turning。前段为天才喝彩，后段为人性泪奔。一个创造了计算机，扭转二战直至胜利的英雄，却因为是gay而遭到迫害~我们的世界远不够好。还是有很多极端卫道士和教条让人生活得生不如死。\n\n真想对那些迫害gay的人说 —— 有本事不要用电脑！不要上网！\n\n我们的社会还不够文明。笼罩在每个人头上的无形的形容词远比这个人所拥有的能力，所能做出的成就更具代表性。\n\n历史总是有惊人的相似性，是因为人类总是在重复愚蠢的错误。\n\n影片最后几段文字，写到女王在2013年承认同性婚姻。对于社会的进步，我想作为经历过这一段历史时期的女王大人比我更有体会。\n\n其实，不要觉得在外国就一定活得很自由。我在英国4年，明白了一个道理。有些人对gay是很接纳，身边也有很gay的朋友。但是出柜并不是一件容易的事，因为一旦遇上那些极端的卫道士（不是少数），出柜者所遭受的对待将会很危险。\n\n我总是告诉自己，如果遭受到不公平，忽略它们就好，如果社会不让我活下去，还可以去死呢~多简单。阮玲玉就不这么干的，人言可畏。", "useless_count": 0, "comments_count": 2, "alt": "https://movie.douban.com/review/7207313/", "id": "7207313", "subject_id": "10463953"}, {"rating": {"max": 5, "value": 4.0, "min": 0}, "useful_count": 1, "author": {"uid": "chasel", "avatar": "https://img1.doubanio.com/icon/u2104393-7.jpg", "signature": "活着时要尽可能快乐因为会死很久", "alt": "https://www.douban.com/people/chasel/", "id": "2104393", "name": "chasel"}, "created_at": "2019-01-02 08:27:09", "title": "“模仿游戏”：本就不同，谈何模仿", "updated_at": "2019-01-02 08:27:09", "share_url": "https://m.douban.com/movie/review/9866504", "summary": "图灵这样的人物的传记简直是电影人的宝藏：如此天才，如此高的成就，如此不容于当时的“独特”，又如此跌宕起伏的被世人认知的历史…… 电影用三条时间线串联起一个有逻辑有厚度的人物：1951年因家中被盗而被警察...", "content": "图灵这样的人物的传记简直是电影人的宝藏：如此天才，如此高的成就，如此不容于当时的“独特”，又如此跌宕起伏的被世人认知的历史……\r\n电影用三条时间线串联起一个有逻辑有厚度的人物：1951年因家中被盗而被警察盯上，牵扯出猥亵罪调查线；二战开始时被招募入伍解“谜”线；幼时被校园霸凌，与christopher相知并意识到自己爱他线……三条线之间被回忆或颇具因果关系的插叙自然连接，不乱。\r\n第一层：机器，模仿人\r\n模仿游戏，算是图灵测试的另一种说法：把测试者与被试（一个人和一台机器）隔离开，由测试者通过提问判断对面的是人还是机器。如果30%的测试者认为对面是机器，那恭喜这台机器通过测试，具有人工智能了。\r\n电影中图灵制造出用以破解德军密码的机器叫christopher，以那个与他心灵相通，在校园里对他伸以援手，送他密码学书为他点亮智慧人生的“初恋”命名，作为对早逝的小克的怀念……\r\n第二层：人和人，本就不同\r\n电影把图灵塑造成高智商低情商的天才，让熟悉图灵生平的观影者很不爽，电影是否终于人物生平暂且不论，导演想要展现的该是人和人有多么不同，一段经典台词反复出现：Sometimes it’s the very people who no one imagines anything of who do the things that no one can imagine.\r\n的确，人类中的大多数是如此普通，思维，行事，同于芸芸众生，但就是有一些个体能够跳脱出来，开创性地改变世界；也正是因为“不同”，他们往往与当时的世界格格不入。\r\n第三层：既然人和人如此不同，又为何要因为机器与人的不同，而不去承认机器？或者那仅仅是另一种不同，无关族类\r\n-It's about cryptography.\r\n-Like secret messages?\r\n-Not secret. That's the brilliant part.\r\nMessages that anyone can see,but no one knows what they mean unless you have the key.\r\n-How's that different from talking?\r\n- Talking? \r\n- When people talk to each other, they never say what they mean.\r\nThey say something else,and you're expected to just know what they mean.Only I never do.\r\nSo, how's that different?\r\n电影里，小图灵和christopher之间关于破译密码就像破译人们交流背后的真实意图那段对话，令人印象深刻。\r\n语言本就是一套需要破译的密码。破译密码很难吗？对图灵而言，这跟听懂人们懂得言外之意一样～\r\nOf course machines...can't think as people do.\r\nA machine is different...from a person.\r\nHence, they think differently.\r\nThe interesting question is,just because something, uh,thinks differently from you,does that mean it's not thinking?\r\nWell, we allow for humans to have such divergences from one another.\r\nYou like strawberries,I hate ice-skating, you... cry at sad films,I... am allergic to pollen.\r\nWhat is the point of-of different tastes, different... preferences if not to say that our brains work differently, that we think differently?\r\nAnd if we can say that about one another, then why can't we say the same thing for brains... built of copper and wire, steel?\r\n这算是一个本质问题了吧：因为不同而被分类，那是人类认识世界让世界有序的方式；当这种分类被固定下来容易形成一套特权，让更多未被发现的多样性失去色彩。对，人类并不是至高无上的，上一级高度，换一种视角，会看到大千世界！", "useless_count": 0, "comments_count": 0, "alt": "https://movie.douban.com/review/9866504/", "id": "9866504", "subject_id": "10463953"}], "start": 0, "total": 1198, "next_start": 100, "subject": {"rating": {"max": 10, "average": 8.6, "details": {"1": 343.0, "3": 30591.0, "2": 1767.0, "5": 113803.0, "4": 115002.0}, "stars": "45", "min": 0}, "genres": ["剧情", "传记", "战争"], "title": "模仿游戏", "casts": [{"avatars": {"small": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p41072.jpg", "large": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p41072.jpg", "medium": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p41072.jpg"}, "name_en": "Benedict Cumberbatch", "name": "本尼迪克特·康伯巴奇", "alt": "https://movie.douban.com/celebrity/1009405/", "id": "1009405"}, {"avatars": {"small": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p10192.jpg", "large": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p10192.jpg", "medium": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p10192.jpg"}, "name_en": "Keira Knightley", "name": "凯拉·奈特莉", "alt": "https://movie.douban.com/celebrity/1054448/", "id": "1054448"}, {"avatars": {"small": "https://img1.doubanio.com/view/celebrity/s_ratio_celebrity/public/p22847.jpg", "large": "https://img1.doubanio.com/view/celebrity/s_ratio_celebrity/public/p22847.jpg", "medium": "https://img1.doubanio.com/view/celebrity/s_ratio_celebrity/public/p22847.jpg"}, "name_en": "Matthew Goode", "name": "马修·古迪", "alt": "https://movie.douban.com/celebrity/1000008/", "id": "1000008"}], "durations": ["114分钟"], "collect_count": 414748, "mainland_pubdate": "2015-07-21", "has_video": true, "original_title": "The Imitation Game", "subtype": "movie", "directors": [{"avatars": {"small": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1422983107.34.jpg", "large": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1422983107.34.jpg", "medium": "https://img3.doubanio.com/view/celebrity/s_ratio_celebrity/public/p1422983107.34.jpg"}, "name_en": "Morten Tyldum", "name": "莫滕·泰杜姆", "alt": "https://movie.douban.com/celebrity/1299674/", "id": "1299674"}], "pubdates": ["2014-11-14(英国)", "2014-12-25(美国)", "2015-07-21(中国大陆)"], "year": "2014", "images": {"small": "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2255040492.jpg", "large": "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2255040492.jpg", "medium": "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2255040492.jpg"}, "alt": "https://movie.douban.com/subject/10463953/", "id": "10463953"}}